RIOT-OS/RIOT/cpu/gd32f3x0/include/gd32f3x0_periph.h
    struct {
      __IOM uint32_t WDE        : 1;            /*!< Analog watchdog flag                                                      */
      __IOM uint32_t EOC        : 1;            /*!< End of group conversion flag                                              */
      __IOM uint32_t EOIC       : 1;            /*!< End of inserted group conversion flag                                     */
      __IOM uint32_t STIC       : 1;            /*!< Start flag of inserted channel group                                      */
      __IOM uint32_t STRC       : 1;            /*!< Start flag of regular channel group                                       */
            uint32_t            : 27;
    } STAT_b;
  } ;

  union {
    __IOM uint32_t CTL0;                        /*!< control register 0                                                        */

    struct {
      __IOM uint32_t WDCHSEL    : 5;            /*!< Analog watchdog channel select bits                                       */
      __IOM uint32_t EOCIE      : 1;            /*!< Interrupt enable for EOC                                                  */
      __IOM uint32_t WDEIE      : 1;            /*!< Analog watchdog interrupt enable                                          */
      __IOM uint32_t EOICIE     : 1;            /*!< Interrupt enable for injected channels                                    */
      __IOM uint32_t SM         : 1;            /*!< Scan mode                                                                 */
      __IOM uint32_t WDSC       : 1;            /*!< Enable the watchdog on a single channel in scan mode                      */
      __IOM uint32_t ICA        : 1;            /*!< Automatic injected group conversion                                       */
      __IOM uint32_t DISRC      : 1;            /*!< Discontinuous mode on regular channels                                    */
      __IOM uint32_t DISIC      : 1;            /*!< Discontinuous mode on injected channels                                   */
      __IOM uint32_t DISNUM     : 3;            /*!< Discontinuous mode channel count                                          */
            uint32_t            : 6;
      __IOM uint32_t IWDEN      : 1;            /*!< Analog watchdog enable on injected channels                               */
      __IOM uint32_t RWDEN      : 1;            /*!< Analog watchdog enable on regular channels                                */
      __IOM uint32_t DRES       : 2;            /*!< ADC resolution                                                            */
            uint32_t            : 6;
    } CTL0_b;
  } ;

  union {
    __IOM uint32_t CTL1;                        /*!< control register 1                                                        */

    struct {
      __IOM uint32_t ADCON      : 1;            /*!< A/D converter ON / OFF                                                    */
      __IOM uint32_t CTN        : 1;            /*!< Continuous conversion                                                     */
      __IOM uint32_t CLB        : 1;            /*!< A/D calibration                                                           */
      __IOM uint32_t RSTCLB     : 1;            /*!< Reset calibration                                                         */
            uint32_t            : 4;
      __IOM uint32_t DMA        : 1;            /*!< Direct memory access mode                                                 */
            uint32_t            : 2;
      __IOM uint32_t DAL        : 1;            /*!< Data alignment                                                            */
      __IOM uint32_t ETSIC      : 3;            /*!< External event select for injected group                                  */
      __IOM uint32_t ETEIC      : 1;            /*!< External trigger conversion mode for injected channels                    */
            uint32_t            : 1;
      __IOM uint32_t ETSRC      : 3;            /*!< External event select for regular group                                   */
      __IOM uint32_t ETERC      : 1;            /*!< External trigger conversion mode for regular channels                     */
      __IOM uint32_t SWICST     : 1;            /*!< Start conversion of injected channels                                     */
      __IOM uint32_t SWRCST     : 1;            /*!< Start conversion of regular channels                                      */
      __IOM uint32_t TSVREN     : 1;            /*!< Temperature sensor and VREFINT enable                                     */
      __IOM uint32_t VBATEN     : 1;            /*!< enable/disable the VBAT channel                                           */
            uint32_t            : 7;
    } CTL1_b;
  } ;

  union {
    __IOM uint32_t SAMPT0;                      /*!< Sampling time register 0                                                  */

    struct {
      __IOM uint32_t SPT10      : 3;            /*!< Channel 10 sample time selection                                          */
      __IOM uint32_t SPT11      : 3;            /*!< Channel 11 sample time selection                                          */
      __IOM uint32_t SPT12      : 3;            /*!< Channel 12 sample time selection                                          */
      __IOM uint32_t SPT13      : 3;            /*!< Channel 13 sample time selection                                          */
      __IOM uint32_t SPT14      : 3;            /*!< Channel 14 sample time selection                                          */
      __IOM uint32_t SPT15      : 3;            /*!< Channel 15 sample time selection                                          */
      __IOM uint32_t SPT16      : 3;            /*!< Channel 16 sample time selection                                          */
      __IOM uint32_t SPT17      : 3;            /*!< Channel 17 sample time selection                                          */
      __IOM uint32_t SPT18      : 3;            /*!< Channel 18 sample time selection                                          */
            uint32_t            : 5;
    } SAMPT0_b;
  } ;

  union {
    __IOM uint32_t SAMPT1;                      /*!< Sampling time register 1                                                  */

