RIOT-OS/RIOT/cpu/gd32f3x0/include/gd32f3x0_periph.h
    struct {
      __IOM uint32_t SPT0       : 3;            /*!< Channel 0 sample time selection                                           */
      __IOM uint32_t SPT1       : 3;            /*!< Channel 1 sample time selection                                           */
      __IOM uint32_t SPT2       : 3;            /*!< Channel 2 sample time selection                                           */
      __IOM uint32_t SPT3       : 3;            /*!< Channel 3 sample time selection                                           */
      __IOM uint32_t SPT4       : 3;            /*!< Channel 4 sample time selection                                           */
      __IOM uint32_t SPT5       : 3;            /*!< Channel 5 sample time selection                                           */
      __IOM uint32_t SPT6       : 3;            /*!< Channel 6 sample time selection                                           */
      __IOM uint32_t SPT7       : 3;            /*!< Channel 7 sample time selection                                           */
      __IOM uint32_t SPT8       : 3;            /*!< Channel 8 sample time selection                                           */
      __IOM uint32_t SPT9       : 3;            /*!< Channel 9 sample time selection                                           */
            uint32_t            : 2;
    } SAMPT1_b;
  } ;

  union {
    __IOM uint32_t IOFF0;                       /*!< Inserted channel data offset register 0                                   */

    struct {
      __IOM uint32_t IOFF       : 12;           /*!< Data offset for injected channel x                                        */
            uint32_t            : 20;
    } IOFF0_b;
  } ;

  union {
    __IOM uint32_t IOFF1;                       /*!< Inserted channel data offset register 1                                   */

    struct {
      __IOM uint32_t IOFF       : 12;           /*!< Data offset for injected channel x                                        */
            uint32_t            : 20;
    } IOFF1_b;
  } ;

  union {
    __IOM uint32_t IOFF2;                       /*!< Inserted channel data offset register 2                                   */

    struct {
      __IOM uint32_t IOFF       : 12;           /*!< Data offset for injected channel x                                        */
            uint32_t            : 20;
    } IOFF2_b;
  } ;

  union {
    __IOM uint32_t IOFF3;                       /*!< Inserted channel data offset register 3                                   */

    struct {
      __IOM uint32_t IOFF       : 12;           /*!< Data offset for injected channel x                                        */
            uint32_t            : 20;
    } IOFF3_b;
  } ;

  union {
    __IOM uint32_t WDHT;                        /*!< watchdog higher threshold register                                        */

    struct {
      __IOM uint32_t WDHT       : 12;           /*!< Analog watchdog higher threshold                                          */
            uint32_t            : 20;
    } WDHT_b;
  } ;

  union {
    __IOM uint32_t WDLT;                        /*!< watchdog lower threshold register                                         */

    struct {
      __IOM uint32_t WDLT       : 12;           /*!< Analog watchdog lower threshold                                           */
            uint32_t            : 20;
    } WDLT_b;
  } ;

  union {
    __IOM uint32_t RSQ0;                        /*!< regular sequence register 0                                               */

    struct {
      __IOM uint32_t RSQ12      : 5;            /*!< 12th conversion in regular sequence                                       */
      __IOM uint32_t RSQ13      : 5;            /*!< 13th conversion in regular sequence                                       */
      __IOM uint32_t RSQ14      : 5;            /*!< 14th conversion in regular sequence                                       */
      __IOM uint32_t RSQ15      : 5;            /*!< 15th conversion in regular sequence                                       */
      __IOM uint32_t RL         : 4;            /*!< Regular channel sequence length                                           */
            uint32_t            : 8;
    } RSQ0_b;
  } ;

  union {
    __IOM uint32_t RSQ1;                        /*!< regular sequence register 1                                               */

    struct {
      __IOM uint32_t RSQ6       : 5;            /*!< 6th conversion in regular sequence                                        */
      __IOM uint32_t RSQ7       : 5;            /*!< 7th conversion in regular sequence                                        */
      __IOM uint32_t RSQ8       : 5;            /*!< 8th conversion in regular sequence                                        */
      __IOM uint32_t RSQ9       : 5;            /*!< 9th conversion in regular sequence                                        */
      __IOM uint32_t RSQ10      : 5;            /*!< 10th conversion in regular sequence                                       */
      __IOM uint32_t RSQ11      : 5;            /*!< 11th conversion in regular sequence                                       */
            uint32_t            : 2;
    } RSQ1_b;
  } ;

  union {
    __IOM uint32_t RSQ2;                        /*!< regular sequence register 2                                               */

    struct {
      __IOM uint32_t RSQ0       : 5;            /*!< conversion in regular sequence                                            */
      __IOM uint32_t RSQ1       : 5;            /*!< 1st conversion in regular sequence                                        */
      __IOM uint32_t RSQ2       : 5;            /*!< 2nd conversion in regular sequence                                        */
      __IOM uint32_t RSQ3       : 5;            /*!< 3rd conversion in regular sequence                                        */
      __IOM uint32_t RSQ4       : 5;            /*!< 4th conversion in regular sequence                                        */
      __IOM uint32_t RSQ5       : 5;            /*!< 5th conversion in regular sequence                                        */
            uint32_t            : 2;
    } RSQ2_b;
  } ;

  union {
    __IOM uint32_t ISQ;                         /*!< injected sequence register                                                */

