RIOT-OS/RIOT/cpu/gd32f3x0/include/gd32f3x0_periph.h
    struct {
      __IOM uint32_t ISQ0       : 5;            /*!< conversion in injected sequence                                           */
      __IOM uint32_t ISQ1       : 5;            /*!< 1st conversion in injected sequence                                       */
      __IOM uint32_t ISQ2       : 5;            /*!< 2nd conversion in injected sequence                                       */
      __IOM uint32_t ISQ3       : 5;            /*!< 3rd conversion in injected sequence                                       */
      __IOM uint32_t IL         : 2;            /*!< Injected sequence length                                                  */
            uint32_t            : 10;
    } ISQ_b;
  } ;

  union {
    __IM  uint32_t IDATA0;                      /*!< injected data register 0                                                  */

    struct {
      __IM  uint32_t IDATAn     : 16;           /*!< Injected data                                                             */
            uint32_t            : 16;
    } IDATA0_b;
  } ;

  union {
    __IM  uint32_t IDATA1;                      /*!< injected data register 1                                                  */

    struct {
      __IM  uint32_t IDATAn     : 16;           /*!< Injected data                                                             */
            uint32_t            : 16;
    } IDATA1_b;
  } ;

  union {
    __IM  uint32_t IDATA2;                      /*!< injected data register 2                                                  */

    struct {
      __IM  uint32_t IDATAn     : 16;           /*!< Injected data                                                             */
            uint32_t            : 16;
    } IDATA2_b;
  } ;

  union {
    __IM  uint32_t IDATA3;                      /*!< injected data register 3                                                  */

    struct {
      __IM  uint32_t IDATAn     : 16;           /*!< Injected data                                                             */
            uint32_t            : 16;
    } IDATA3_b;
  } ;

  union {
    __IM  uint32_t RDATA;                       /*!< regular data register                                                     */

    struct {
      __IM  uint32_t RDATA      : 16;           /*!< Regular data                                                              */
            uint32_t            : 16;
    } RDATA_b;
  } ;
  __IM  uint32_t  RESERVED[12];

  union {
    __IOM uint32_t OVSAMPCTL;                   /*!< ADC oversample control register                                           */

    struct {
      __IOM uint32_t OVSEN      : 1;            /*!< Oversampler Enable                                                        */
            uint32_t            : 1;
      __IOM uint32_t OVSR       : 3;            /*!< Oversampling ratio                                                        */
      __IOM uint32_t OVSS       : 4;            /*!< Oversampling shift                                                        */
      __IOM uint32_t TOVS       : 1;            /*!< Triggered Oversampling                                                    */
            uint32_t            : 22;
    } OVSAMPCTL_b;
  } ;
} ADC_Type;                                     /*!< Size = 132 (0x84)                                                         */



/* =========================================================================================================================== */
/* ================                                            CEC                                            ================ */
/* =========================================================================================================================== */


/**
  * @brief HDMI-CEC controller (CEC)
  */

typedef struct {                                /*!< CEC Structure                                                             */

  union {
    __IOM uint32_t CTL;                         /*!< control register                                                          */

    struct {
      __IOM uint32_t CECEN      : 1;            /*!< CEC controller Enable                                                     */
      __IOM uint32_t STAOM      : 1;            /*!< Start of sending a message                                                */
      __IOM uint32_t ENDOM      : 1;            /*!< ENDOM bit value in the next frame in TX mode                              */
            uint32_t            : 29;
    } CTL_b;
  } ;

  union {
    __IOM uint32_t CFG;                         /*!< Configuration register                                                    */

    struct {
      __IOM uint32_t SFT        : 3;            /*!< Signal Free Time                                                          */
      __IOM uint32_t RTOL       : 1;            /*!< Reception bit timing tolerance                                            */
      __IOM uint32_t BRES       : 1;            /*!< Whether stop receive message when detected BRE                            */
      __IOM uint32_t BREG       : 1;            /*!< Generate an Error-bit when detected BRE in singlecast                     */
      __IOM uint32_t BPLEG      : 1;            /*!< Generate an Error-bit when detected BPLE in singlecast                    */
      __IOM uint32_t BCNG       : 1;            /*!< Do not generate Error-bit in broadcast message                            */
      __IOM uint32_t SFTOPT     : 1;            /*!< The SFT start option bit                                                  */
            uint32_t            : 7;
      __IOM uint32_t OAD        : 15;           /*!< Own Address                                                               */
      __IOM uint32_t LMEN       : 1;            /*!< Listen mode enable                                                        */
    } CFG_b;
  } ;

  union {
    __OM  uint32_t TDATA;                       /*!< Transmit data register                                                    */

