RIOT-OS/RIOT/cpu/gd32f3x0/include/gd32f3x0_periph.h
    struct {
      __OM  uint32_t TDATA      : 8;            /*!< Tx Data register                                                          */
            uint32_t            : 24;
    } TDATA_b;
  } ;

  union {
    __IM  uint32_t RDATA;                       /*!< Rx Data Register                                                          */

    struct {
      __IM  uint32_t RDATA      : 8;            /*!< CEC Rx Data Register                                                      */
            uint32_t            : 24;
    } RDATA_b;
  } ;

  union {
    __IOM uint32_t INTF;                        /*!< Interrupt Flag Register                                                   */

    struct {
      __IOM uint32_t BR         : 1;            /*!< Rx-Byte Received                                                          */
      __IOM uint32_t REND       : 1;            /*!< End Of Reception                                                          */
      __IOM uint32_t RO         : 1;            /*!< Rx-Overrun                                                                */
      __IOM uint32_t BRE        : 1;            /*!< Bit rising error                                                          */
      __IOM uint32_t BPSE       : 1;            /*!< Bit period short error                                                    */
      __IOM uint32_t BPLE       : 1;            /*!< Bit Period Long Error                                                     */
      __IOM uint32_t RAE        : 1;            /*!< Rx Acknowledge error                                                      */
      __IOM uint32_t ARBF       : 1;            /*!< Arbitration fail                                                          */
      __IOM uint32_t TBR        : 1;            /*!< Tx-Byte Request                                                           */
      __IOM uint32_t TEND       : 1;            /*!< End of Transmission                                                       */
      __IOM uint32_t TU         : 1;            /*!< Tx-Buffer Underrun                                                        */
      __IOM uint32_t TERR       : 1;            /*!< Tx-Error                                                                  */
      __IOM uint32_t TAERR      : 1;            /*!< Tx-Missing acknowledge error                                              */
            uint32_t            : 19;
    } INTF_b;
  } ;

  union {
    __IOM uint32_t INTEN;                       /*!< interrupt enable register                                                 */

    struct {
      __IOM uint32_t BRIE       : 1;            /*!< Rx-Byte Received Interrupt Enable                                         */
      __IOM uint32_t RENDIE     : 1;            /*!< End Of Reception Interrupt Enable                                         */
      __IOM uint32_t ROIE       : 1;            /*!< Rx-Buffer Overrun Interrupt Enable                                        */
      __IOM uint32_t BREIE      : 1;            /*!< Bit Rising Error Interrupt Enable                                         */
      __IOM uint32_t BPSEIE     : 1;            /*!< Short Bit Period Error Interrupt Enable                                   */
      __IOM uint32_t BPLEIE     : 1;            /*!< Long Bit Period Error Interrupt Enable                                    */
      __IOM uint32_t RAEIE      : 1;            /*!< Rx-Missing Acknowledge Error Interrupt Enable                             */
      __IOM uint32_t ARBFIE     : 1;            /*!< ARBF Interrupt Enable                                                     */
      __IOM uint32_t TBRIE      : 1;            /*!< Tx-Byte Request Interrupt Enable                                          */
      __IOM uint32_t TXENDIE    : 1;            /*!< Tx-End of message interrupt enable                                        */
      __IOM uint32_t TUIE       : 1;            /*!< Tx-Underrun interrupt enable                                              */
      __IOM uint32_t TERRIE     : 1;            /*!< Tx-Error Interrupt Enable                                                 */
      __IOM uint32_t TAERRIE    : 1;            /*!< Tx-Missing Acknowledge Error Interrupt Enable                             */
            uint32_t            : 19;
    } INTEN_b;
  } ;
} CEC_Type;                                     /*!< Size = 24 (0x18)                                                          */



/* =========================================================================================================================== */
/* ================                                            CMP                                            ================ */
/* =========================================================================================================================== */


/**
  * @brief Comparator (CMP)
  */

typedef struct {                                /*!< CMP Structure                                                             */

  union {
    __IOM uint32_t CS;                          /*!< control and status register                                               */

    struct {
      __IOM uint32_t CMP0EN     : 1;            /*!< Comparator 0 enable                                                       */
      __IOM uint32_t CMP0SW     : 1;            /*!< Comparator 0 switch                                                       */
      __IOM uint32_t CMP0M      : 2;            /*!< Comparator 0 mode                                                         */
      __IOM uint32_t CMP0MSEL   : 3;            /*!< Comparator 0 input selection                                              */
            uint32_t            : 1;
      __IOM uint32_t CMP0OSEL   : 3;            /*!< Comparator 0 output selection                                             */
      __IOM uint32_t CMP0PL     : 1;            /*!< Polarity of comparator 0 output                                           */
      __IOM uint32_t CMP0HST    : 2;            /*!< Comparator 0 hysteresis                                                   */
      __IM  uint32_t CMP0O      : 1;            /*!< Comparator 0 output                                                       */
      __IOM uint32_t CMP0LK     : 1;            /*!< Comparator 0 lock                                                         */
      __IOM uint32_t CMP1EN     : 1;            /*!< Comparator 1 enable                                                       */
            uint32_t            : 1;
      __IOM uint32_t CMP1M      : 2;            /*!< Comparator 1 mode                                                         */
      __IOM uint32_t CMP1MSEL   : 3;            /*!< Comparator 1 inverting input selection                                    */
      __IOM uint32_t WNDEN      : 1;            /*!< Window mode enable                                                        */
      __IOM uint32_t CMP1OSEL   : 3;            /*!< Comparator 1 output selection                                             */
      __IOM uint32_t CMP1PL     : 1;            /*!< Comparator 1 output polarity                                              */
      __IOM uint32_t CMP1HST    : 2;            /*!< Comparator 1 hysteresis                                                   */
      __IM  uint32_t CMP1O      : 1;            /*!< Comparator 1 output                                                       */
      __IOM uint32_t CMP1LK     : 1;            /*!< Comparator 1 lock                                                         */
    } CS_b;
  } ;
} CMP_Type;                                     /*!< Size = 4 (0x4)                                                            */



/* =========================================================================================================================== */
/* ================                                            CRC                                            ================ */
/* =========================================================================================================================== */


/**
  * @brief cyclic redundancy check calculation unit (CRC)
  */

