RIOT-OS/RIOT/cpu/gd32f3x0/include/gd32f3x0_periph.h
typedef struct {                                /*!< CRC Structure                                                             */

  union {
    __IOM uint32_t DATA;                        /*!< Data register                                                             */

    struct {
      __IOM uint32_t DATA       : 32;           /*!< CRC calculation result bits                                               */
    } DATA_b;
  } ;

  union {
    __IOM uint32_t FDATA;                       /*!< Free data register                                                        */

    struct {
      __IOM uint32_t FDATA      : 8;            /*!< General-purpose 8-bit data register bits                                  */
            uint32_t            : 24;
    } FDATA_b;
  } ;

  union {
    __IOM uint32_t CTL;                         /*!< Control register                                                          */

    struct {
      __IOM uint32_t RST        : 1;            /*!< reset bit                                                                 */
            uint32_t            : 2;
      __IOM uint32_t PS         : 2;            /*!< Size of polynomial                                                        */
      __IOM uint32_t REV_I      : 2;            /*!< Reverse input data                                                        */
      __IOM uint32_t REV_O      : 1;            /*!< Reverse output data                                                       */
            uint32_t            : 24;
    } CTL_b;
  } ;
  __IM  uint32_t  RESERVED;

  union {
    __IOM uint32_t IDATA;                       /*!< Initialization Data Register                                              */

    struct {
      __IOM uint32_t IDATA      : 32;           /*!< CRC calculation initial value                                             */
    } IDATA_b;
  } ;

  union {
    __IOM uint32_t POLY;                        /*!< Polynomial register                                                       */

    struct {
      __IOM uint32_t POLY       : 32;           /*!< User configurable polynomial value                                        */
    } POLY_b;
  } ;
} CRC_Type;                                     /*!< Size = 24 (0x18)                                                          */



/* =========================================================================================================================== */
/* ================                                            CTC                                            ================ */
/* =========================================================================================================================== */


/**
  * @brief Clock trim controller (CTC)
  */

typedef struct {                                /*!< CTC Structure                                                             */

  union {
    __IOM uint32_t CTL0;                        /*!< Control Register 0                                                        */

    struct {
      __IOM uint32_t CKOKIE     : 1;            /*!< Clock trim OK (CKOKIF) interrupt enable                                   */
      __IOM uint32_t CKWARNIE   : 1;            /*!< Clock trim warning (CKWARNIF) interrupt enable                            */
      __IOM uint32_t ERRIE      : 1;            /*!< Error (ERRIF) interrupt enable                                            */
      __IOM uint32_t EREFIE     : 1;            /*!< EREFIF interrupt enable                                                   */
            uint32_t            : 1;
      __IOM uint32_t CNTEN      : 1;            /*!< CTC counter enable                                                        */
      __IOM uint32_t AUTOTRIM   : 1;            /*!< Hardware automatically trim mode                                          */
      __IOM uint32_t SWREFPUL   : 1;            /*!< Software reference source sync pulse                                      */
      __IOM uint32_t TRIMVALUE  : 6;            /*!< IRC48M trim value                                                         */
            uint32_t            : 18;
    } CTL0_b;
  } ;

  union {
    __IOM uint32_t CTL1;                        /*!< Control Register 1                                                        */

    struct {
      __IOM uint32_t RLVALUE    : 16;           /*!< CTC counter reload value                                                  */
      __IOM uint32_t CKLIM      : 8;            /*!< Clock trim base limit value                                               */
      __IOM uint32_t REFPSC     : 3;            /*!< Reference signal source prescaler                                         */
            uint32_t            : 1;
      __IOM uint32_t REFSEL     : 2;            /*!< Reference signal source selection                                         */
            uint32_t            : 1;
      __IOM uint32_t REFPOL     : 1;            /*!< Reference signal source polarity                                          */
    } CTL1_b;
  } ;

  union {
    __IM  uint32_t STAT;                        /*!< Status Register                                                           */

    struct {
      __IM  uint32_t CKOKIF     : 1;            /*!< Clock trim OK interrupt flag                                              */
      __IM  uint32_t CKWARNIF   : 1;            /*!< Clock trim warning interrupt flag                                         */
      __IM  uint32_t ERRIF      : 1;            /*!< Error interrupt flag                                                      */
      __IM  uint32_t EREFIF     : 1;            /*!< Expect reference interrupt flag                                           */
            uint32_t            : 4;
      __IM  uint32_t CKERR      : 1;            /*!< Clock trim error bit                                                      */
      __IM  uint32_t REFMISS    : 1;            /*!< Reference sync pulse miss                                                 */
      __IM  uint32_t TRIMERR    : 1;            /*!< Trim value error bit                                                      */
            uint32_t            : 4;
      __IM  uint32_t REFDIR     : 1;            /*!< CTC trim counter direction when reference sync pulse                      */
      __IM  uint32_t REFCAP     : 16;           /*!< CTC counter capture when reference sync pulse                             */
    } STAT_b;
  } ;

  union {
    __OM  uint32_t INTC;                        /*!< Interrupt clear Register                                                  */

