RIOT-OS/RIOT/cpu/gd32f3x0/include/gd32f3x0_periph.h
    struct {
      __OM  uint32_t CKOKIC     : 1;            /*!< CKOKIF interrupt clear bit                                                */
      __OM  uint32_t CKWARNIC   : 1;            /*!< CKWARNIF interrupt clear bit                                              */
      __OM  uint32_t ERRIC      : 1;            /*!< ERRIF interrupt clear bit                                                 */
      __OM  uint32_t EREFIC     : 1;            /*!< EREFIF interrupt clear bit                                                */
            uint32_t            : 28;
    } INTC_b;
  } ;
} CTC_Type;                                     /*!< Size = 16 (0x10)                                                          */



/* =========================================================================================================================== */
/* ================                                            DAC                                            ================ */
/* =========================================================================================================================== */


/**
  * @brief Digital-to-analog converter (DAC)
  */

typedef struct {                                /*!< DAC Structure                                                             */

  union {
    __IOM uint32_t CTL;                         /*!< control register                                                          */

    struct {
      __IOM uint32_t DEN        : 1;            /*!< DAC enable                                                                */
      __IOM uint32_t DBOFF      : 1;            /*!< DAC output buffer disable                                                 */
      __IOM uint32_t DTEN       : 1;            /*!< DAC trigger enable                                                        */
      __IOM uint32_t DTSEL      : 3;            /*!< DAC trigger selection                                                     */
      __IOM uint32_t DWM        : 2;            /*!< DAC noise wave mode                                                       */
      __IOM uint32_t DWBW       : 4;            /*!< DAC noise wave bit width                                                  */
      __IOM uint32_t DDMAEN     : 1;            /*!< DAC DMA enable                                                            */
      __IOM uint32_t DDUDRIE    : 1;            /*!< DAC DMA underrun interrupt enable                                         */
            uint32_t            : 18;
    } CTL_b;
  } ;

  union {
    __OM  uint32_t SWT;                         /*!< software trigger register                                                 */

    struct {
      __OM  uint32_t SWTR       : 1;            /*!< DAC software trigger                                                      */
            uint32_t            : 31;
    } SWT_b;
  } ;

  union {
    __IOM uint32_t DAC_R12DH;                   /*!< DAC 12-bit right-aligned data holding register                            */

    struct {
      __IOM uint32_t DAC_DH     : 12;           /*!< DAC 12-bit right-aligned data                                             */
            uint32_t            : 20;
    } DAC_R12DH_b;
  } ;

  union {
    __IOM uint32_t DAC_L12DH;                   /*!< DAC 12-bit left aligned data holding register                             */

    struct {
            uint32_t            : 4;
      __IOM uint32_t DAC_DH     : 12;           /*!< DAC 12-bit left-aligned data                                              */
            uint32_t            : 16;
    } DAC_L12DH_b;
  } ;

  union {
    __IOM uint32_t DAC_R8DH;                    /*!< DAC 8-bit right aligned data holding register                             */

    struct {
      __IOM uint32_t DAC_DH     : 8;            /*!< DAC 8-bit right-aligned data                                              */
            uint32_t            : 24;
    } DAC_R8DH_b;
  } ;
  __IM  uint32_t  RESERVED[6];

  union {
    __IM  uint32_t DAC_DO;                      /*!< DAC data output register                                                  */

    struct {
      __IM  uint32_t DAC_DO     : 12;           /*!< DAC data output                                                           */
            uint32_t            : 20;
    } DAC_DO_b;
  } ;
  __IM  uint32_t  RESERVED1;

  union {
    __IOM uint32_t STAT;                        /*!< status register                                                           */

    struct {
            uint32_t            : 13;
      __IOM uint32_t DDUDR      : 1;            /*!< DAC DMA underrun flag                                                     */
            uint32_t            : 18;
    } STAT_b;
  } ;
} DAC_Type;                                     /*!< Size = 56 (0x38)                                                          */



/* =========================================================================================================================== */
/* ================                                            DBG                                            ================ */
/* =========================================================================================================================== */


/**
  * @brief Debug support (DBG)
  */

typedef struct {                                /*!< DBG Structure                                                             */

  union {
    __IM  uint32_t ID;                          /*!< MCU Device ID Code Register                                               */

    struct {
      __IM  uint32_t ID_CODE    : 32;           /*!< DBG ID code register                                                      */
    } ID_b;
  } ;

  union {
    __IOM uint32_t CTL0;                        /*!< Debug Control Register 0                                                  */

    struct {
      __IOM uint32_t SLP_HOLD   : 1;            /*!< Sleep mode hold register                                                  */
      __IOM uint32_t DSLP_HOLD  : 1;            /*!< DEEPSLEEP mode hold Mode                                                  */
      __IOM uint32_t STB_HOLD   : 1;            /*!< Standby mode hold Mode                                                    */
            uint32_t            : 5;
      __IOM uint32_t FWDGT_HOLD : 1;            /*!< FWDGT hold register                                                       */
      __IOM uint32_t WWDGT_HOLD : 1;            /*!< WWDGT hold register                                                       */
      __IOM uint32_t TIMER0_HOLD : 1;           /*!< Timer 0 hold register                                                     */
      __IOM uint32_t TIMER1_HOLD : 1;           /*!< Timer 1 hold register                                                     */
      __IOM uint32_t TIMER2_HOLD : 1;           /*!< Timer 2 hold register                                                     */
            uint32_t            : 2;
      __IOM uint32_t I2C0_HOLD  : 1;            /*!< I2C0 hold register                                                        */
      __IOM uint32_t I2C1_HOLD  : 1;            /*!< I2C1 hold register                                                        */
            uint32_t            : 2;
      __IOM uint32_t TIMER5_HOLD : 1;           /*!< Timer 5 hold register                                                     */
            uint32_t            : 7;
      __IOM uint32_t TIMER13_HOLD : 1;          /*!< Timer 13 hold register                                                    */
            uint32_t            : 4;
    } CTL0_b;
  } ;

  union {
    __IOM uint32_t CTL1;                        /*!< Debug Control Register 1                                                  */

