RIOT-OS/RIOT/cpu/gd32f3x0/include/gd32f3x0_periph.h
    struct {
            uint32_t            : 10;
      __IOM uint32_t RTC_HOLD   : 1;            /*!< RTC hold register                                                         */
            uint32_t            : 5;
      __IOM uint32_t TIMER14_HOLD : 1;          /*!< Timer 14 hold register                                                    */
      __IOM uint32_t TIMER15_HOLD : 1;          /*!< Timer 15 hold register                                                    */
      __IOM uint32_t TIMER16_HOLD : 1;          /*!< Timer 16 hold register                                                    */
            uint32_t            : 13;
    } CTL1_b;
  } ;
} DBG_Type;                                     /*!< Size = 12 (0xc)                                                           */



/* =========================================================================================================================== */
/* ================                                            DMA                                            ================ */
/* =========================================================================================================================== */


/**
  * @brief DMA controller (DMA)
  */

typedef struct {                                /*!< DMA Structure                                                             */

  union {
    __IM  uint32_t INTF;                        /*!< DMA interrupt flag register (DMA_INTF)                                    */

    struct {
      __IM  uint32_t GIF0       : 1;            /*!< Channel 0 Global interrupt flag                                           */
      __IM  uint32_t FTFIF0     : 1;            /*!< Channel 0 Full Transfer Finish flag                                       */
      __IM  uint32_t HTFIF0     : 1;            /*!< Channel 0 Half Transfer Finish flag                                       */
      __IM  uint32_t ERRIF0     : 1;            /*!< Channel 0 Error flag                                                      */
      __IM  uint32_t GIF1       : 1;            /*!< Channel 1 Global interrupt flag                                           */
      __IM  uint32_t FTFIF1     : 1;            /*!< Channel 1 Full Transfer Finish flag                                       */
      __IM  uint32_t HTFIF1     : 1;            /*!< Channel 1 Half Transfer Finish flag                                       */
      __IM  uint32_t ERRIF1     : 1;            /*!< Channel 1 Error flag                                                      */
      __IM  uint32_t GIF2       : 1;            /*!< Channel 2 Global interrupt flag                                           */
      __IM  uint32_t FTFIF2     : 1;            /*!< Channel 2 Full Transfer Finish flag                                       */
      __IM  uint32_t HTFIF2     : 1;            /*!< Channel 2 Half Transfer Finish flag                                       */
      __IM  uint32_t ERRIF2     : 1;            /*!< Channel 2 Error flag                                                      */
      __IM  uint32_t GIF3       : 1;            /*!< Channel 3 Global interrupt flag                                           */
      __IM  uint32_t FTFIF3     : 1;            /*!< Channel 3 Full Transfer Finish flag                                       */
      __IM  uint32_t HTFIF3     : 1;            /*!< Channel 3 Half Transfer Finish flag                                       */
      __IM  uint32_t ERRIF3     : 1;            /*!< Channel 3 Error flag                                                      */
      __IM  uint32_t GIF4       : 1;            /*!< Channel 4 Global interrupt flag                                           */
      __IM  uint32_t FTFIF4     : 1;            /*!< Channel 4 Full Transfer Finish flag                                       */
      __IM  uint32_t HTFIF4     : 1;            /*!< Channel 4 Half Transfer Finish flag                                       */
      __IM  uint32_t ERRIF4     : 1;            /*!< Channel 4 Error flag                                                      */
      __IM  uint32_t GIF5       : 1;            /*!< Channel 5 Global interrupt flag                                           */
      __IM  uint32_t FTFIF5     : 1;            /*!< Channel 5 Full Transfer Finish flag                                       */
      __IM  uint32_t HTFIF5     : 1;            /*!< Channel 5 Half Transfer Finish flag                                       */
      __IM  uint32_t ERRIF5     : 1;            /*!< Channel 5 Error flag                                                      */
      __IM  uint32_t GIF6       : 1;            /*!< Channel 6 Global interrupt flag                                           */
      __IM  uint32_t FTFIF6     : 1;            /*!< Channel 6 Full Transfer Finish flag                                       */
      __IM  uint32_t HTFIF6     : 1;            /*!< Channel 6 Half Transfer Finish flag                                       */
      __IM  uint32_t ERRIF6     : 1;            /*!< Channel 6 Error flag                                                      */
            uint32_t            : 4;
    } INTF_b;
  } ;

  union {
    __OM  uint32_t INTC;                        /*!< DMA interrupt flag clear register (DMA_INTC)                              */

    struct {
      __OM  uint32_t GIFC0      : 1;            /*!< Channel 0 Global interrupt flag clear                                     */
      __OM  uint32_t FTFIFC0    : 1;            /*!< Channel 0 Full Transfer Finish clear                                      */
      __OM  uint32_t HTFIFC0    : 1;            /*!< Channel 0 Half Transfer clear                                             */
      __OM  uint32_t ERRIFC0    : 1;            /*!< Channel 0 Error clear                                                     */
      __OM  uint32_t GIFC1      : 1;            /*!< Channel 1 Global interrupt flag clear                                     */
      __OM  uint32_t FTFIFC1    : 1;            /*!< Channel 1 Full Transfer Finish clear                                      */
      __OM  uint32_t HTFIFC1    : 1;            /*!< Channel 1 Half Transfer clear                                             */
      __OM  uint32_t ERRIFC1    : 1;            /*!< Channel 1 Error clear                                                     */
      __OM  uint32_t GIFC2      : 1;            /*!< Channel 2 Global interrupt flag clear                                     */
      __OM  uint32_t FTFIFC2    : 1;            /*!< Channel 2 Full Transfer Finish clear                                      */
      __OM  uint32_t HTFIFC2    : 1;            /*!< Channel 2 Half Transfer clear                                             */
      __OM  uint32_t ERRIFC2    : 1;            /*!< Channel 2 Error clear                                                     */
      __OM  uint32_t GIFC3      : 1;            /*!< Channel 3 Global interrupt flag clear                                     */
      __OM  uint32_t FTFIFC3    : 1;            /*!< Channel 3 Full Transfer Finish clear                                      */
      __OM  uint32_t HTFIFC3    : 1;            /*!< Channel 3 Half Transfer clear                                             */
      __OM  uint32_t ERRIFC3    : 1;            /*!< Channel 3 Error clear                                                     */
      __OM  uint32_t GIFC4      : 1;            /*!< Channel 4 Global interrupt flag clear                                     */
      __OM  uint32_t FTFIFC4    : 1;            /*!< Channel 4 Full Transfer Finish clear                                      */
      __OM  uint32_t HTFIFC4    : 1;            /*!< Channel 4 Half Transfer clear                                             */
      __OM  uint32_t ERRIFC4    : 1;            /*!< Channel 4 Error clear                                                     */
      __OM  uint32_t GIFC5      : 1;            /*!< Channel 5 Global interrupt flag clear                                     */
      __OM  uint32_t FTFIFC5    : 1;            /*!< Channel 5 Full Transfer Finish clear                                      */
      __OM  uint32_t HTFIFC5    : 1;            /*!< Channel 5 Half Transfer clear                                             */
      __OM  uint32_t ERRIFC5    : 1;            /*!< Channel 5 Error clear                                                     */
      __OM  uint32_t GIFC6      : 1;            /*!< Channel 6 Global interrupt flag clear                                     */
      __OM  uint32_t FTFIFC6    : 1;            /*!< Channel 6 Full Transfer Finish clear                                      */
      __OM  uint32_t HTFIFC6    : 1;            /*!< Channel 6 Half Transfer clear                                             */
      __OM  uint32_t ERRIFC6    : 1;            /*!< Channel 6 Error clear                                                     */
            uint32_t            : 4;
    } INTC_b;
  } ;

  union {
    __IOM uint32_t CH0CTL;                      /*!< DMA channel configuration register (DMA_CH0CTL)                           */

