RIOT-OS/RIOT/cpu/gd32f3x0/include/gd32f3x0_periph.h
    struct {
      __IOM uint32_t CHEN       : 1;            /*!< Channel enable                                                            */
      __IOM uint32_t FTFIE      : 1;            /*!< Full Transfer Finish interrupt enable                                     */
      __IOM uint32_t HTFIE      : 1;            /*!< Half Transfer Finish interrupt enable                                     */
      __IOM uint32_t ERRIE      : 1;            /*!< Transfer access error interrupt enable                                    */
      __IOM uint32_t DIR        : 1;            /*!< Transfer direction                                                        */
      __IOM uint32_t CMEN       : 1;            /*!< Circular mode enable                                                      */
      __IOM uint32_t PNAGA      : 1;            /*!< Next address generation algorithm of peripheral                           */
      __IOM uint32_t MNAGA      : 1;            /*!< Next address generation algorithm of memory                               */
      __IOM uint32_t PWIDTH     : 2;            /*!< Transfer data size of peripheral                                          */
      __IOM uint32_t MWIDTH     : 2;            /*!< Transfer data size of memory                                              */
      __IOM uint32_t PRIO       : 2;            /*!< Priority Level of this channel                                            */
      __IOM uint32_t M2M        : 1;            /*!< Memory to memory mode                                                     */
            uint32_t            : 17;
    } CH0CTL_b;
  } ;

  union {
    __IOM uint32_t CH0CNT;                      /*!< DMA channel 0 counter register                                            */

    struct {
      __IOM uint32_t CNT        : 16;           /*!< Transfer counter                                                          */
            uint32_t            : 16;
    } CH0CNT_b;
  } ;

  union {
    __IOM uint32_t CH0PADDR;                    /*!< DMA channel 0 peripheral base address register                            */

    struct {
      __IOM uint32_t PADDR      : 32;           /*!< Peripheral base address                                                   */
    } CH0PADDR_b;
  } ;

  union {
    __IOM uint32_t CH0MADDR;                    /*!< DMA channel 0 memory base address register                                */

    struct {
      __IOM uint32_t MADDR      : 32;           /*!< Memory address                                                            */
    } CH0MADDR_b;
  } ;
  __IM  uint32_t  RESERVED;

  union {
    __IOM uint32_t CH1CTL;                      /*!< DMA channel configuration register (DMA_CH1CTL)                           */

    struct {
      __IOM uint32_t CHEN       : 1;            /*!< Channel enable                                                            */
      __IOM uint32_t FTFIE      : 1;            /*!< Full Transfer Finish interrupt enable                                     */
      __IOM uint32_t HTFIE      : 1;            /*!< Half Transfer Finish interrupt enable                                     */
      __IOM uint32_t ERRIE      : 1;            /*!< Error interrupt enable                                                    */
      __IOM uint32_t DIR        : 1;            /*!< Transfer direction                                                        */
      __IOM uint32_t CMEN       : 1;            /*!< Circular mode enable                                                      */
      __IOM uint32_t PNAGA      : 1;            /*!< Next address generation algorithm of peripheral                           */
      __IOM uint32_t MNAGA      : 1;            /*!< Next address generation algorithm of memory                               */
      __IOM uint32_t PWIDTH     : 2;            /*!< Transfer data size of peripheral                                          */
      __IOM uint32_t MWIDTH     : 2;            /*!< Transfer data size of memory                                              */
      __IOM uint32_t PRIO       : 2;            /*!< Priority Level of this channel                                            */
      __IOM uint32_t M2M        : 1;            /*!< Memory to memory mode                                                     */
            uint32_t            : 17;
    } CH1CTL_b;
  } ;

  union {
    __IOM uint32_t CH1CNT;                      /*!< DMA channel 1 counter register                                            */

    struct {
      __IOM uint32_t CNT        : 16;           /*!< Transfer counter                                                          */
            uint32_t            : 16;
    } CH1CNT_b;
  } ;

  union {
    __IOM uint32_t CH1PADDR;                    /*!< DMA channel 1 peripheral base address register                            */

    struct {
      __IOM uint32_t PADDR      : 32;           /*!< Peripheral base address                                                   */
    } CH1PADDR_b;
  } ;

  union {
    __IOM uint32_t CH1MADDR;                    /*!< DMA channel 1 memory base address register                                */

    struct {
      __IOM uint32_t MADDR      : 32;           /*!< Memory address                                                            */
    } CH1MADDR_b;
  } ;
  __IM  uint32_t  RESERVED1;

  union {
    __IOM uint32_t CH2CTL;                      /*!< DMA channel configuration register (DMA_CH2CTL)                           */

    struct {
      __IOM uint32_t CHEN       : 1;            /*!< Channel enable                                                            */
      __IOM uint32_t FTFIE      : 1;            /*!< Full Transfer Finish interrupt enable                                     */
      __IOM uint32_t HTFIE      : 1;            /*!< Half Transfer Finish interrupt enable                                     */
      __IOM uint32_t ERRIE      : 1;            /*!< Error interrupt enable                                                    */
      __IOM uint32_t DIR        : 1;            /*!< Transfer direction                                                        */
      __IOM uint32_t CMEN       : 1;            /*!< Circular mode enable                                                      */
      __IOM uint32_t PNAGA      : 1;            /*!< Next address generation algorithm of peripheral                           */
      __IOM uint32_t MNAGA      : 1;            /*!< Next address generation algorithm of memory                               */
      __IOM uint32_t PWIDTH     : 2;            /*!< Transfer data size of peripheral                                          */
      __IOM uint32_t MWIDTH     : 2;            /*!< Transfer data size of memory                                              */
      __IOM uint32_t PRIO       : 2;            /*!< Priority Level of this channel                                            */
      __IOM uint32_t M2M        : 1;            /*!< Memory to memory mode                                                     */
            uint32_t            : 17;
    } CH2CTL_b;
  } ;

  union {
    __IOM uint32_t CH2CNT;                      /*!< DMA channel 2 counter register                                            */

