RIOT-OS/RIOT/cpu/gd32f3x0/include/gd32f3x0_periph.h
    struct {
      __IOM uint32_t CNT        : 16;           /*!< Transfer counter                                                          */
            uint32_t            : 16;
    } CH2CNT_b;
  } ;

  union {
    __IOM uint32_t CH2PADDR;                    /*!< DMA channel 2 peripheral base address register                            */

    struct {
      __IOM uint32_t PADDR      : 32;           /*!< Peripheral base address                                                   */
    } CH2PADDR_b;
  } ;

  union {
    __IOM uint32_t CH2MADDR;                    /*!< DMA channel 2 memory base address register                                */

    struct {
      __IOM uint32_t MADDR      : 32;           /*!< Memory address                                                            */
    } CH2MADDR_b;
  } ;
  __IM  uint32_t  RESERVED2;

  union {
    __IOM uint32_t CH3CTL;                      /*!< DMA channel configuration register (DMA_CH3CTL)                           */

    struct {
      __IOM uint32_t CHEN       : 1;            /*!< Channel enable                                                            */
      __IOM uint32_t FTFIE      : 1;            /*!< Full Transfer Finish interrupt enable                                     */
      __IOM uint32_t HTFIE      : 1;            /*!< Half Transfer Finish interrupt enable                                     */
      __IOM uint32_t ERRIE      : 1;            /*!< Error interrupt enable                                                    */
      __IOM uint32_t DIR        : 1;            /*!< Transfer direction                                                        */
      __IOM uint32_t CMEN       : 1;            /*!< Circular mode enable                                                      */
      __IOM uint32_t PNAGA      : 1;            /*!< Next address generation algorithm of peripheral                           */
      __IOM uint32_t MNAGA      : 1;            /*!< Next address generation algorithm of memory                               */
      __IOM uint32_t PWIDTH     : 2;            /*!< Transfer data size of peripheral                                          */
      __IOM uint32_t MWIDTH     : 2;            /*!< Transfer data size of memory                                              */
      __IOM uint32_t PRIO       : 2;            /*!< Priority Level of this channel                                            */
      __IOM uint32_t M2M        : 1;            /*!< Memory to memory mode                                                     */
            uint32_t            : 17;
    } CH3CTL_b;
  } ;

  union {
    __IOM uint32_t CH3CNT;                      /*!< DMA channel 3 counter register                                            */

    struct {
      __IOM uint32_t CNT        : 16;           /*!< Transfer counter                                                          */
            uint32_t            : 16;
    } CH3CNT_b;
  } ;

  union {
    __IOM uint32_t CH3PADDR;                    /*!< DMA channel 3 peripheral base address register                            */

    struct {
      __IOM uint32_t PADDR      : 32;           /*!< Peripheral base address                                                   */
    } CH3PADDR_b;
  } ;

  union {
    __IOM uint32_t CH3MADDR;                    /*!< DMA channel 3 memory base address register                                */

    struct {
      __IOM uint32_t MADDR      : 32;           /*!< Memory address                                                            */
    } CH3MADDR_b;
  } ;
  __IM  uint32_t  RESERVED3;

  union {
    __IOM uint32_t CH4CTL;                      /*!< DMA channel configuration register (DMA_CH4CTL)                           */

    struct {
      __IOM uint32_t CHEN       : 1;            /*!< Channel enable                                                            */
      __IOM uint32_t FTFIE      : 1;            /*!< Full Transfer Finish interrupt enable                                     */
      __IOM uint32_t HTFIE      : 1;            /*!< Half Transfer Finish interrupt enable                                     */
      __IOM uint32_t ERRIE      : 1;            /*!< Error interrupt enable                                                    */
      __IOM uint32_t DIR        : 1;            /*!< Transfer direction                                                        */
      __IOM uint32_t CMEN       : 1;            /*!< Circular mode enable                                                      */
      __IOM uint32_t PNAGA      : 1;            /*!< Next address generation algorithm of peripheral                           */
      __IOM uint32_t MNAGA      : 1;            /*!< Next address generation algorithm of memory                               */
      __IOM uint32_t PWIDTH     : 2;            /*!< Transfer data size of peripheral                                          */
      __IOM uint32_t MWIDTH     : 2;            /*!< Transfer data size of memory                                              */
      __IOM uint32_t PRIO       : 2;            /*!< Priority Level of this channel                                            */
      __IOM uint32_t M2M        : 1;            /*!< Memory to memory mode                                                     */
            uint32_t            : 17;
    } CH4CTL_b;
  } ;

  union {
    __IOM uint32_t CH4CNT;                      /*!< DMA channel 4 counter register                                            */

    struct {
      __IOM uint32_t CNT        : 16;           /*!< Transfer counter                                                          */
            uint32_t            : 16;
    } CH4CNT_b;
  } ;

  union {
    __IOM uint32_t CH4PADDR;                    /*!< DMA channel 4 peripheral base address register                            */

    struct {
      __IOM uint32_t PADDR      : 32;           /*!< Peripheral base address                                                   */
    } CH4PADDR_b;
  } ;

  union {
    __IOM uint32_t CH4MADDR;                    /*!< DMA channel 4 memory base address register                                */

