RIOT-OS/RIOT/cpu/gd32f3x0/include/gd32f3x0_periph.h
    struct {
      __IOM uint32_t MADDR      : 32;           /*!< Memory address                                                            */
    } CH4MADDR_b;
  } ;
  __IM  uint32_t  RESERVED4;

  union {
    __IOM uint32_t CH5CTL;                      /*!< DMA channel configuration register (DMA_CH5CTL)                           */

    struct {
      __IOM uint32_t CHEN       : 1;            /*!< Channel enable                                                            */
      __IOM uint32_t FTFIE      : 1;            /*!< Full Transfer Finish interrupt enable                                     */
      __IOM uint32_t HTFIE      : 1;            /*!< Half Transfer Finish interrupt enable                                     */
      __IOM uint32_t ERRIE      : 1;            /*!< Error interrupt enable                                                    */
      __IOM uint32_t DIR        : 1;            /*!< Transfer direction                                                        */
      __IOM uint32_t CMEN       : 1;            /*!< Circular mode enable                                                      */
      __IOM uint32_t PNAGA      : 1;            /*!< Next address generation algorithm of peripheral                           */
      __IOM uint32_t MNAGA      : 1;            /*!< Next address generation algorithm of memory                               */
      __IOM uint32_t PWIDTH     : 2;            /*!< Transfer data size of peripheral                                          */
      __IOM uint32_t MWIDTH     : 2;            /*!< Transfer data size of memory                                              */
      __IOM uint32_t PRIO       : 2;            /*!< Priority Level of this channel                                            */
      __IOM uint32_t M2M        : 1;            /*!< Memory to memory mode                                                     */
            uint32_t            : 17;
    } CH5CTL_b;
  } ;

  union {
    __IOM uint32_t CH5CNT;                      /*!< DMA channel 5 counter register                                            */

    struct {
      __IOM uint32_t CNT        : 16;           /*!< Transfer counter                                                          */
            uint32_t            : 16;
    } CH5CNT_b;
  } ;

  union {
    __IOM uint32_t CH5PADDR;                    /*!< DMA channel 5 peripheral base address register                            */

    struct {
      __IOM uint32_t PADDR      : 32;           /*!< Peripheral base address                                                   */
    } CH5PADDR_b;
  } ;

  union {
    __IOM uint32_t CH5MADDR;                    /*!< DMA channel 5 memory base address register                                */

    struct {
      __IOM uint32_t MADDR      : 32;           /*!< Memory address                                                            */
    } CH5MADDR_b;
  } ;
  __IM  uint32_t  RESERVED5;

  union {
    __IOM uint32_t CH6CTL;                      /*!< DMA channel configuration register (DMA_CH6CTL)                           */

    struct {
      __IOM uint32_t CHEN       : 1;            /*!< Channel enable                                                            */
      __IOM uint32_t FTFIE      : 1;            /*!< Full Transfer Finish interrupt enable                                     */
      __IOM uint32_t HTFIE      : 1;            /*!< Half Transfer Finish interrupt enable                                     */
      __IOM uint32_t ERRIE      : 1;            /*!< Error interrupt enable                                                    */
      __IOM uint32_t DIR        : 1;            /*!< Transfer direction                                                        */
      __IOM uint32_t CMEN       : 1;            /*!< Circular mode enable                                                      */
      __IOM uint32_t PNAGA      : 1;            /*!< Next address generation algorithm of peripheral                           */
      __IOM uint32_t MNAGA      : 1;            /*!< Next address generation algorithm of memory                               */
      __IOM uint32_t PWIDTH     : 2;            /*!< Transfer data size of peripheral                                          */
      __IOM uint32_t MWIDTH     : 2;            /*!< Transfer data size of memory                                              */
      __IOM uint32_t PRIO       : 2;            /*!< Priority Level of this channel                                            */
      __IOM uint32_t M2M        : 1;            /*!< Memory to memory mode                                                     */
            uint32_t            : 17;
    } CH6CTL_b;
  } ;

  union {
    __IOM uint32_t CH6CNT;                      /*!< DMA channel 6 counter register                                            */

    struct {
      __IOM uint32_t CNT        : 16;           /*!< Transfer counter                                                          */
            uint32_t            : 16;
    } CH6CNT_b;
  } ;

  union {
    __IOM uint32_t CH6PADDR;                    /*!< DMA channel 6 peripheral base address register                            */

    struct {
      __IOM uint32_t PADDR      : 32;           /*!< Peripheral base address                                                   */
    } CH6PADDR_b;
  } ;

  union {
    __IOM uint32_t CH6MADDR;                    /*!< DMA channel 6 memory base address register                                */

    struct {
      __IOM uint32_t MADDR      : 32;           /*!< Memory address                                                            */
    } CH6MADDR_b;
  } ;
} DMA_Type;                                     /*!< Size = 144 (0x90)                                                         */



/* =========================================================================================================================== */
/* ================                                           EXTI                                            ================ */
/* =========================================================================================================================== */


/**
  * @brief External interrupt/event
      controller (EXTI)
  */

typedef struct {                                /*!< EXTI Structure                                                            */

  union {
    __IOM uint32_t INTEN;                       /*!< Interrupt enable register (EXTI_INTEN)                                    */

