RIOT-OS/RIOT/cpu/gd32f3x0/include/gd32f3x0_periph.h
    struct {
      __IOM uint32_t INTEN0     : 1;            /*!< Enable Interrupt on line 0                                                */
      __IOM uint32_t INTEN1     : 1;            /*!< Enable Interrupt on line 1                                                */
      __IOM uint32_t INTEN2     : 1;            /*!< Enable Interrupt on line 2                                                */
      __IOM uint32_t INTEN3     : 1;            /*!< Enable Interrupt on line 3                                                */
      __IOM uint32_t INTEN4     : 1;            /*!< Enable Interrupt on line 4                                                */
      __IOM uint32_t INTEN5     : 1;            /*!< Enable Interrupt on line 5                                                */
      __IOM uint32_t INTEN6     : 1;            /*!< Enable Interrupt on line 6                                                */
      __IOM uint32_t INTEN7     : 1;            /*!< Enable Interrupt on line 7                                                */
      __IOM uint32_t INTEN8     : 1;            /*!< Enable Interrupt on line 8                                                */
      __IOM uint32_t INTEN9     : 1;            /*!< Enable Interrupt on line 9                                                */
      __IOM uint32_t INTEN10    : 1;            /*!< Enable Interrupt on line 10                                               */
      __IOM uint32_t INTEN11    : 1;            /*!< Enable Interrupt on line 11                                               */
      __IOM uint32_t INTEN12    : 1;            /*!< Enable Interrupt on line 12                                               */
      __IOM uint32_t INTEN13    : 1;            /*!< Enable Interrupt on line 13                                               */
      __IOM uint32_t INTEN14    : 1;            /*!< Enable Interrupt on line 14                                               */
      __IOM uint32_t INTEN15    : 1;            /*!< Enable Interrupt on line 15                                               */
      __IOM uint32_t INTEN16    : 1;            /*!< Enable Interrupt on line 16                                               */
      __IOM uint32_t INTEN17    : 1;            /*!< Enable Interrupt on line 17                                               */
      __IOM uint32_t INTEN18    : 1;            /*!< Enable Interrupt on line 18                                               */
      __IOM uint32_t INTEN19    : 1;            /*!< Enable Interrupt on line 19                                               */
      __IOM uint32_t INTEN20    : 1;            /*!< Enable Interrupt on line 20                                               */
      __IOM uint32_t INTEN21    : 1;            /*!< Enable Interrupt on line 21                                               */
      __IOM uint32_t INTEN22    : 1;            /*!< Enable Interrupt on line 22                                               */
      __IOM uint32_t INTEN23    : 1;            /*!< Enable Interrupt on line 23                                               */
      __IOM uint32_t INTEN24    : 1;            /*!< Enable Interrupt on line 24                                               */
      __IOM uint32_t INTEN25    : 1;            /*!< Enable Interrupt on line 25                                               */
      __IOM uint32_t INTEN26    : 1;            /*!< Enable Interrupt on line 26                                               */
      __IOM uint32_t INTEN27    : 1;            /*!< Enable Interrupt on line 27                                               */
            uint32_t            : 4;
    } INTEN_b;
  } ;

  union {
    __IOM uint32_t EVEN;                        /*!< Event enable register (EXTI_EVEN)                                         */

    struct {
      __IOM uint32_t EVEN0      : 1;            /*!< Enable Event on line 0                                                    */
      __IOM uint32_t EVEN1      : 1;            /*!< Enable Event on line 1                                                    */
      __IOM uint32_t EVEN2      : 1;            /*!< Enable Event on line 2                                                    */
      __IOM uint32_t EVEN3      : 1;            /*!< Enable Event on line 3                                                    */
      __IOM uint32_t EVEN4      : 1;            /*!< Enable Event on line 4                                                    */
      __IOM uint32_t EVEN5      : 1;            /*!< Enable Event on line 5                                                    */
      __IOM uint32_t EVEN6      : 1;            /*!< Enable Event on line 6                                                    */
      __IOM uint32_t EVEN7      : 1;            /*!< Enable Event on line 7                                                    */
      __IOM uint32_t EVEN8      : 1;            /*!< Enable Event on line 8                                                    */
      __IOM uint32_t EVEN9      : 1;            /*!< Enable Event on line 9                                                    */
      __IOM uint32_t EVEN10     : 1;            /*!< Enable Event on line 10                                                   */
      __IOM uint32_t EVEN11     : 1;            /*!< Enable Event on line 11                                                   */
      __IOM uint32_t EVEN12     : 1;            /*!< Enable Event on line 12                                                   */
      __IOM uint32_t EVEN13     : 1;            /*!< Enable Event on line 13                                                   */
      __IOM uint32_t EVEN14     : 1;            /*!< Enable Event on line 14                                                   */
      __IOM uint32_t EVEN15     : 1;            /*!< Enable Event on line 15                                                   */
      __IOM uint32_t EVEN16     : 1;            /*!< Enable Event on line 16                                                   */
      __IOM uint32_t EVEN17     : 1;            /*!< Enable Event on line 17                                                   */
      __IOM uint32_t EVEN18     : 1;            /*!< Enable Event on line 18                                                   */
      __IOM uint32_t EVEN19     : 1;            /*!< Enable Event on line 19                                                   */
      __IOM uint32_t EVEN20     : 1;            /*!< Enable Event on line 20                                                   */
      __IOM uint32_t EVEN21     : 1;            /*!< Enable Event on line 21                                                   */
      __IOM uint32_t EVEN22     : 1;            /*!< Enable Event on line 22                                                   */
      __IOM uint32_t EVEN23     : 1;            /*!< Enable Event on line 23                                                   */
      __IOM uint32_t EVEN24     : 1;            /*!< Enable Event on line 24                                                   */
      __IOM uint32_t EVEN25     : 1;            /*!< Enable Event on line 25                                                   */
      __IOM uint32_t EVEN26     : 1;            /*!< Enable Event on line 26                                                   */
      __IOM uint32_t EVEN27     : 1;            /*!< Enable Event on line 27                                                   */
            uint32_t            : 4;
    } EVEN_b;
  } ;

  union {
    __IOM uint32_t RTEN;                        /*!< Rising Edge Trigger Enable register (EXTI_RTEN)                           */

