RIOT-OS/RIOT/cpu/gd32f3x0/include/gd32f3x0_periph.h
    struct {
      __IOM uint32_t RTEN0      : 1;            /*!< Rising trigger event configuration of line 0                              */
      __IOM uint32_t RTEN1      : 1;            /*!< Rising trigger event configuration of line 1                              */
      __IOM uint32_t RTEN2      : 1;            /*!< Rising trigger event configuration of line 2                              */
      __IOM uint32_t RTEN3      : 1;            /*!< Rising trigger event configuration of line 3                              */
      __IOM uint32_t RTEN4      : 1;            /*!< Rising trigger event configuration of line 4                              */
      __IOM uint32_t RTEN5      : 1;            /*!< Rising trigger event configuration of line 5                              */
      __IOM uint32_t RTEN6      : 1;            /*!< Rising trigger event configuration of line 6                              */
      __IOM uint32_t RTEN7      : 1;            /*!< Rising trigger event configuration of line 7                              */
      __IOM uint32_t RTEN8      : 1;            /*!< Rising trigger event configuration of line 8                              */
      __IOM uint32_t RTEN9      : 1;            /*!< Rising trigger event configuration of line 9                              */
      __IOM uint32_t RTEN10     : 1;            /*!< Rising trigger event configuration of line 10                             */
      __IOM uint32_t RTEN11     : 1;            /*!< Rising trigger event configuration of line 11                             */
      __IOM uint32_t RTEN12     : 1;            /*!< Rising trigger event configuration of line 12                             */
      __IOM uint32_t RTEN13     : 1;            /*!< Rising trigger event configuration of line 13                             */
      __IOM uint32_t RTEN14     : 1;            /*!< Rising trigger event configuration of line 14                             */
      __IOM uint32_t RTEN15     : 1;            /*!< Rising trigger event configuration of line 15                             */
      __IOM uint32_t RTEN16     : 1;            /*!< Rising trigger event configuration of line 16                             */
      __IOM uint32_t RTEN17     : 1;            /*!< Rising trigger event configuration of line 17                             */
      __IOM uint32_t RTEN18     : 1;            /*!< Rising trigger event configuration of line 18                             */
      __IOM uint32_t RTEN19     : 1;            /*!< Rising trigger event configuration of line 19                             */
            uint32_t            : 1;
      __IOM uint32_t RTEN21     : 1;            /*!< Rising trigger event configuration of line 21                             */
      __IOM uint32_t RTEN22     : 1;            /*!< Rising trigger event configuration of line 22                             */
            uint32_t            : 9;
    } RTEN_b;
  } ;

  union {
    __IOM uint32_t FTEN;                        /*!< Falling Egde Trigger Enable register (EXTI_FTEN)                          */

    struct {
      __IOM uint32_t FTEN0      : 1;            /*!< Falling trigger event configuration of line 0                             */
      __IOM uint32_t FTEN1      : 1;            /*!< Falling trigger event configuration of line 1                             */
      __IOM uint32_t FTEN2      : 1;            /*!< Falling trigger event configuration of line 2                             */
      __IOM uint32_t FTEN3      : 1;            /*!< Falling trigger event configuration of line 3                             */
      __IOM uint32_t FTEN4      : 1;            /*!< Falling trigger event configuration of line 4                             */
      __IOM uint32_t FTEN5      : 1;            /*!< Falling trigger event configuration of line 5                             */
      __IOM uint32_t FTEN6      : 1;            /*!< Falling trigger event configuration of line 6                             */
      __IOM uint32_t FTEN7      : 1;            /*!< Falling trigger event configuration of line 7                             */
      __IOM uint32_t FTEN8      : 1;            /*!< Falling trigger event configuration of line 8                             */
      __IOM uint32_t FTEN9      : 1;            /*!< Falling trigger event configuration of line 9                             */
      __IOM uint32_t FTEN10     : 1;            /*!< Falling trigger event configuration of line 10                            */
      __IOM uint32_t FTEN11     : 1;            /*!< Falling trigger event configuration of line 11                            */
      __IOM uint32_t FTEN12     : 1;            /*!< Falling trigger event configuration of line 12                            */
      __IOM uint32_t FTEN13     : 1;            /*!< Falling trigger event configuration of line 13                            */
      __IOM uint32_t FTEN14     : 1;            /*!< Falling trigger event configuration of line 14                            */
      __IOM uint32_t FTEN15     : 1;            /*!< Falling trigger event configuration of line 15                            */
      __IOM uint32_t FTEN16     : 1;            /*!< Falling trigger event configuration of line 16                            */
      __IOM uint32_t FTEN17     : 1;            /*!< Falling trigger event configuration of line 17                            */
      __IOM uint32_t FTEN18     : 1;            /*!< Falling trigger event configuration of line 18                            */
      __IOM uint32_t FTEN19     : 1;            /*!< Falling trigger event configuration of line 19                            */
            uint32_t            : 1;
      __IOM uint32_t FTEN21     : 1;            /*!< Falling trigger event configuration of line 21                            */
      __IOM uint32_t FTEN22     : 1;            /*!< Falling trigger event configuration of line 22                            */
            uint32_t            : 9;
    } FTEN_b;
  } ;

  union {
    __IOM uint32_t SWIEV;                       /*!< Software interrupt event register (EXTI_SWIEV)                            */

