RIOT-OS/RIOT/cpu/gd32f3x0/include/gd32f3x0_periph.h
    struct {
      __IOM uint32_t SWIEV0     : 1;            /*!< Software Interrupt on line 0                                              */
      __IOM uint32_t SWIEV1     : 1;            /*!< Software Interrupt on line 1                                              */
      __IOM uint32_t SWIEV2     : 1;            /*!< Software Interrupt on line 2                                              */
      __IOM uint32_t SWIEV3     : 1;            /*!< Software Interrupt on line 3                                              */
      __IOM uint32_t SWIEV4     : 1;            /*!< Software Interrupt on line 4                                              */
      __IOM uint32_t SWIEV5     : 1;            /*!< Software Interrupt on line 5                                              */
      __IOM uint32_t SWIEV6     : 1;            /*!< Software Interrupt on line 6                                              */
      __IOM uint32_t SWIEV7     : 1;            /*!< Software Interrupt on line 7                                              */
      __IOM uint32_t SWIEV8     : 1;            /*!< Software Interrupt on line 8                                              */
      __IOM uint32_t SWIEV9     : 1;            /*!< Software Interrupt on line 9                                              */
      __IOM uint32_t SWIEV10    : 1;            /*!< Software Interrupt on line 10                                             */
      __IOM uint32_t SWIEV11    : 1;            /*!< Software Interrupt on line 11                                             */
      __IOM uint32_t SWIEV12    : 1;            /*!< Software Interrupt on line 12                                             */
      __IOM uint32_t SWIEV13    : 1;            /*!< Software Interrupt on line 13                                             */
      __IOM uint32_t SWIEV14    : 1;            /*!< Software Interrupt on line 14                                             */
      __IOM uint32_t SWIEV15    : 1;            /*!< Software Interrupt on line 15                                             */
      __IOM uint32_t SWIEV16    : 1;            /*!< Software Interrupt on line 16                                             */
      __IOM uint32_t SWIEV17    : 1;            /*!< Software Interrupt on line 17                                             */
      __IOM uint32_t SWIEV18    : 1;            /*!< Software Interrupt on line 18                                             */
      __IOM uint32_t SWIEV19    : 1;            /*!< Software Interrupt on line 19                                             */
            uint32_t            : 1;
      __IOM uint32_t SWIEV21    : 1;            /*!< Software Interrupt on line 21                                             */
      __IOM uint32_t SWIEV22    : 1;            /*!< Software Interrupt on line 22                                             */
            uint32_t            : 9;
    } SWIEV_b;
  } ;

  union {
    __IOM uint32_t PD;                          /*!< Pending register (EXTI_PD)                                                */

    struct {
      __IOM uint32_t PD0        : 1;            /*!< Pending bit 0                                                             */
      __IOM uint32_t PD1        : 1;            /*!< Pending bit 1                                                             */
      __IOM uint32_t PD2        : 1;            /*!< Pending bit 2                                                             */
      __IOM uint32_t PD3        : 1;            /*!< Pending bit 3                                                             */
      __IOM uint32_t PD4        : 1;            /*!< Pending bit 4                                                             */
      __IOM uint32_t PD5        : 1;            /*!< Pending bit 5                                                             */
      __IOM uint32_t PD6        : 1;            /*!< Pending bit 6                                                             */
      __IOM uint32_t PD7        : 1;            /*!< Pending bit 7                                                             */
      __IOM uint32_t PD8        : 1;            /*!< Pending bit 8                                                             */
      __IOM uint32_t PD9        : 1;            /*!< Pending bit 9                                                             */
      __IOM uint32_t PD10       : 1;            /*!< Pending bit 10                                                            */
      __IOM uint32_t PD11       : 1;            /*!< Pending bit 11                                                            */
      __IOM uint32_t PD12       : 1;            /*!< Pending bit 12                                                            */
      __IOM uint32_t PD13       : 1;            /*!< Pending bit 13                                                            */
      __IOM uint32_t PD14       : 1;            /*!< Pending bit 14                                                            */
      __IOM uint32_t PD15       : 1;            /*!< Pending bit 15                                                            */
      __IOM uint32_t PD16       : 1;            /*!< Pending bit 16                                                            */
      __IOM uint32_t PD17       : 1;            /*!< Pending bit 17                                                            */
      __IOM uint32_t PD18       : 1;            /*!< Pending bit 18                                                            */
      __IOM uint32_t PD19       : 1;            /*!< Pending bit 19                                                            */
            uint32_t            : 1;
      __IOM uint32_t PD21       : 1;            /*!< Pending bit 21                                                            */
      __IOM uint32_t PD22       : 1;            /*!< Pending bit 22                                                            */
            uint32_t            : 9;
    } PD_b;
  } ;
} EXTI_Type;                                    /*!< Size = 24 (0x18)                                                          */



/* =========================================================================================================================== */
/* ================                                            FMC                                            ================ */
/* =========================================================================================================================== */


/**
  * @brief FMC (FMC)
  */

