RIOT-OS/RIOT/cpu/gd32f3x0/include/gd32f3x0_periph.h
typedef struct {                                /*!< FMC Structure                                                             */

  union {
    __IOM uint32_t WS;                          /*!< Wait state register                                                       */

    struct {
      __IOM uint32_t WSCNT      : 3;            /*!< WSCNT                                                                     */
            uint32_t            : 29;
    } WS_b;
  } ;

  union {
    __OM  uint32_t KEY;                         /*!< Flash unlock key register                                                 */

    struct {
      __OM  uint32_t KEY        : 32;           /*!< FMC_CTL unlock register                                                   */
    } KEY_b;
  } ;

  union {
    __OM  uint32_t OBKEY;                       /*!< Flash option byte unlock key register                                     */

    struct {
      __OM  uint32_t OBKEY      : 32;           /*!< Option byte key                                                           */
    } OBKEY_b;
  } ;

  union {
    __IOM uint32_t STAT;                        /*!< Flash status register                                                     */

    struct {
      __IM  uint32_t BUSY       : 1;            /*!< Busy                                                                      */
            uint32_t            : 1;
      __IOM uint32_t PGERR      : 1;            /*!< Program error flag bit                                                    */
            uint32_t            : 1;
      __IOM uint32_t WPERR      : 1;            /*!< Erase/Program protection error flag bit                                   */
      __IOM uint32_t ENDF       : 1;            /*!< End of operation flag bit                                                 */
            uint32_t            : 26;
    } STAT_b;
  } ;

  union {
    __IOM uint32_t CTL;                         /*!< Flash control register                                                    */

    struct {
      __IOM uint32_t PG         : 1;            /*!< Programming                                                               */
      __IOM uint32_t PER        : 1;            /*!< Main flash page erase command bit                                         */
      __IOM uint32_t MER        : 1;            /*!< Main flash mass erase command bit                                         */
            uint32_t            : 1;
      __IOM uint32_t OBPG       : 1;            /*!< Option byte programming                                                   */
      __IOM uint32_t OBER       : 1;            /*!< Option byte erase                                                         */
      __IOM uint32_t START      : 1;            /*!< Start                                                                     */
      __IOM uint32_t LK         : 1;            /*!< Lock                                                                      */
            uint32_t            : 1;
      __IOM uint32_t OBWEN      : 1;            /*!< Option bytes write enable                                                 */
      __IOM uint32_t ERRIE      : 1;            /*!< Error interrupt enable                                                    */
            uint32_t            : 1;
      __IOM uint32_t ENDIE      : 1;            /*!< End of operation interrupt enable                                         */
      __IOM uint32_t OBRLD      : 1;            /*!< Option byte reload bit                                                    */
            uint32_t            : 18;
    } CTL_b;
  } ;

  union {
    __IOM uint32_t ADDR;                        /*!< Flash address register                                                    */

    struct {
      __IOM uint32_t ADDR       : 32;           /*!< Flash command address                                                     */
    } ADDR_b;
  } ;
  __IM  uint32_t  RESERVED;

  union {
    __IM  uint32_t OBSTAT;                      /*!< Option byte status register                                               */

    struct {
      __IM  uint32_t OBERR      : 1;            /*!< Option byte error                                                         */
      __IM  uint32_t PLEVEL     : 2;            /*!< PLEVEL                                                                    */
            uint32_t            : 5;
      __IM  uint32_t OB_USER    : 8;            /*!< OB_USER                                                                   */
      __IM  uint32_t OB_DATA    : 16;           /*!< OB_DATA                                                                   */
    } OBSTAT_b;
  } ;

  union {
    __IM  uint32_t WP;                          /*!< Write protection register                                                 */

    struct {
      __IM  uint32_t OB_WP      : 16;           /*!< Write protect                                                             */
            uint32_t            : 16;
    } WP_b;
  } ;
  __IM  uint32_t  RESERVED1[54];

  union {
    __IM  uint32_t WSEN;                        /*!< Flash wait state control register                                         */

    struct {
      __IM  uint32_t WSEN       : 1;            /*!< FMC wait state enable register                                            */
      __IM  uint32_t BPEN       : 1;            /*!< FMC bit program enable register                                           */
            uint32_t            : 30;
    } WSEN_b;
  } ;

  union {
    __IM  uint32_t PID;                         /*!< Flash Product ID register                                                 */

    struct {
      __IM  uint32_t PID        : 32;           /*!< Product reserved ID code register1                                        */
    } PID_b;
  } ;
} FMC_Type;                                     /*!< Size = 260 (0x104)                                                        */



/* =========================================================================================================================== */
/* ================                                           FWDGT                                           ================ */
/* =========================================================================================================================== */


/**
  * @brief free watchdog timer (FWDGT)
  */

