RIOT-OS/RIOT/cpu/gd32f3x0/include/gd32f3x0_periph.h
typedef struct {                                /*!< FWDGT Structure                                                           */

  union {
    __OM  uint32_t CTL;                         /*!< Control register                                                          */

    struct {
      __OM  uint32_t CMD        : 16;           /*!< Key value                                                                 */
            uint32_t            : 16;
    } CTL_b;
  } ;

  union {
    __IOM uint32_t PSC;                         /*!< Prescaler register                                                        */

    struct {
      __IOM uint32_t PSC        : 3;            /*!< Prescaler divider                                                         */
            uint32_t            : 29;
    } PSC_b;
  } ;

  union {
    __IOM uint32_t RLD;                         /*!< Reload register                                                           */

    struct {
      __IOM uint32_t RLD        : 12;           /*!< Watchdog counter reload value                                             */
            uint32_t            : 20;
    } RLD_b;
  } ;

  union {
    __IM  uint32_t STAT;                        /*!< Status register                                                           */

    struct {
      __IM  uint32_t PUD        : 1;            /*!< Watchdog prescaler value update                                           */
      __IM  uint32_t RUD        : 1;            /*!< Watchdog counter reload value update                                      */
      __IM  uint32_t WUD        : 1;            /*!< Watchdog counter window value update                                      */
            uint32_t            : 29;
    } STAT_b;
  } ;

  union {
    __IM  uint32_t WND;                         /*!< Window register                                                           */

    struct {
      __IM  uint32_t WND        : 12;           /*!< Watchdog counter window value                                             */
            uint32_t            : 20;
    } WND_b;
  } ;
} FWDGT_Type;                                   /*!< Size = 20 (0x14)                                                          */



/* =========================================================================================================================== */
/* ================                                           GPIOA                                           ================ */
/* =========================================================================================================================== */


/**
  * @brief General-purpose I/Os (GPIOA)
  */

typedef struct {                                /*!< GPIOA Structure                                                           */

  union {
    __IOM uint32_t CTL;                         /*!< GPIO port control register                                                */

    struct {
      __IOM uint32_t CTL0       : 2;            /*!< Port x configuration bits (y = 0..15)                                     */
      __IOM uint32_t CTL1       : 2;            /*!< Port x configuration bits (y = 0..15)                                     */
      __IOM uint32_t CTL2       : 2;            /*!< Port x configuration bits (y = 0..15)                                     */
      __IOM uint32_t CTL3       : 2;            /*!< Port x configuration bits (y = 0..15)                                     */
      __IOM uint32_t CTL4       : 2;            /*!< Port x configuration bits (y = 0..15)                                     */
      __IOM uint32_t CTL5       : 2;            /*!< Port x configuration bits (y = 0..15)                                     */
      __IOM uint32_t CTL6       : 2;            /*!< Port x configuration bits (y = 0..15)                                     */
      __IOM uint32_t CTL7       : 2;            /*!< Port x configuration bits (y = 0..15)                                     */
      __IOM uint32_t CTL8       : 2;            /*!< Port x configuration bits (y = 0..15)                                     */
      __IOM uint32_t CTL9       : 2;            /*!< Port x configuration bits (y = 0..15)                                     */
      __IOM uint32_t CTL10      : 2;            /*!< Port x configuration bits (y = 0..15)                                     */
      __IOM uint32_t CTL11      : 2;            /*!< Port x configuration bits (y = 0..15)                                     */
      __IOM uint32_t CTL12      : 2;            /*!< Port x configuration bits (y = 0..15)                                     */
      __IOM uint32_t CTL13      : 2;            /*!< Port x configuration bits (y = 0..15)                                     */
      __IOM uint32_t CTL14      : 2;            /*!< Port x configuration bits (y = 0..15)                                     */
      __IOM uint32_t CTL15      : 2;            /*!< Port x configuration bits (y = 0..15)                                     */
    } CTL_b;
  } ;

  union {
    __IOM uint32_t OMODE;                       /*!< GPIO port output type register                                            */

    struct {
      __IOM uint32_t OM0        : 1;            /*!< Port x configuration bit 0                                                */
      __IOM uint32_t OM1        : 1;            /*!< Port x configuration bit 1                                                */
      __IOM uint32_t OM2        : 1;            /*!< Port x configuration bit 2                                                */
      __IOM uint32_t OM3        : 1;            /*!< Port x configuration bit 3                                                */
      __IOM uint32_t OM4        : 1;            /*!< Port x configuration bit 4                                                */
      __IOM uint32_t OM5        : 1;            /*!< Port x configuration bit 5                                                */
      __IOM uint32_t OM6        : 1;            /*!< Port x configuration bit 6                                                */
      __IOM uint32_t OM7        : 1;            /*!< Port x configuration bit 7                                                */
      __IOM uint32_t OM8        : 1;            /*!< Port x configuration bit 8                                                */
      __IOM uint32_t OM9        : 1;            /*!< Port x configuration bit 9                                                */
      __IOM uint32_t OM10       : 1;            /*!< Port x configuration bit 10                                               */
      __IOM uint32_t OM11       : 1;            /*!< Port x configuration bit 11                                               */
      __IOM uint32_t OM12       : 1;            /*!< Port x configuration bit 12                                               */
      __IOM uint32_t OM13       : 1;            /*!< Port x configuration bit 13                                               */
      __IOM uint32_t OM14       : 1;            /*!< Port x configuration bit 14                                               */
      __IOM uint32_t OM15       : 1;            /*!< Port x configuration bit 15                                               */
            uint32_t            : 16;
    } OMODE_b;
  } ;

  union {
    __IOM uint32_t OSPD0;                       /*!< GPIO port output speed register 0                                         */

