RIOT-OS/RIOT/cpu/gd32f3x0/include/gd32f3x0_periph.h
    struct {
      __OM  uint32_t TG0        : 1;            /*!< Port toggle bit                                                           */
      __OM  uint32_t TG1        : 1;            /*!< Port toggle bit                                                           */
      __OM  uint32_t TG2        : 1;            /*!< Port toggle bit                                                           */
      __OM  uint32_t TG3        : 1;            /*!< Port toggle bit                                                           */
      __OM  uint32_t TG4        : 1;            /*!< Port toggle bit                                                           */
      __OM  uint32_t TG5        : 1;            /*!< Port toggle bit                                                           */
      __OM  uint32_t TG6        : 1;            /*!< Port toggle bit                                                           */
      __OM  uint32_t TG7        : 1;            /*!< Port toggle bit                                                           */
      __OM  uint32_t TG8        : 1;            /*!< Port toggle bit                                                           */
      __OM  uint32_t TG9        : 1;            /*!< Port toggle bit                                                           */
      __OM  uint32_t TG10       : 1;            /*!< Port toggle bit                                                           */
      __OM  uint32_t TG11       : 1;            /*!< Port toggle bit                                                           */
      __OM  uint32_t TG12       : 1;            /*!< Port toggle bit                                                           */
      __OM  uint32_t TG13       : 1;            /*!< Port toggle bit                                                           */
      __OM  uint32_t TG14       : 1;            /*!< Port toggle bit                                                           */
      __OM  uint32_t TG15       : 1;            /*!< Port toggle bit                                                           */
            uint32_t            : 16;
    } TG_b;
  } ;
  __IM  uint32_t  RESERVED[3];

  union {
    __IOM uint32_t OSPD1;                       /*!< Port output speed register 1                                              */

    struct {
      __IOM uint32_t SPD0       : 1;            /*!< Set Very High output speed when OSPDy(y=0..15) is 0b11                    */
      __IOM uint32_t SPD1       : 1;            /*!< Set Very High output speed when OSPDy(y=0..15) is 0b11                    */
      __IOM uint32_t SPD2       : 1;            /*!< Set Very High output speed when OSPDy(y=0..15) is 0b11                    */
      __IOM uint32_t SPD3       : 1;            /*!< Set Very High output speed when OSPDy(y=0..15) is 0b11                    */
      __IOM uint32_t SPD4       : 1;            /*!< Set Very High output speed when OSPDy(y=0..15) is 0b11                    */
      __IOM uint32_t SPD5       : 1;            /*!< Set Very High output speed when OSPDy(y=0..15) is 0b11                    */
      __IOM uint32_t SPD6       : 1;            /*!< Set Very High output speed when OSPDy(y=0..15) is 0b11                    */
      __IOM uint32_t SPD7       : 1;            /*!< Set Very High output speed when OSPDy(y=0..15) is 0b11                    */
      __IOM uint32_t SPD8       : 1;            /*!< Set Very High output speed when OSPDy(y=0..15) is 0b11                    */
      __IOM uint32_t SPD9       : 1;            /*!< Set Very High output speed when OSPDy(y=0..15) is 0b11                    */
      __IOM uint32_t SPD10      : 1;            /*!< Set Very High output speed when OSPDy(y=0..15) is 0b11                    */
      __IOM uint32_t SPD11      : 1;            /*!< Set Very High output speed when OSPDy(y=0..15) is 0b11                    */
      __IOM uint32_t SPD12      : 1;            /*!< Set Very High output speed when OSPDy(y=0..15) is 0b11                    */
      __IOM uint32_t SPD13      : 1;            /*!< Set Very High output speed when OSPDy(y=0..15) is 0b11                    */
      __IOM uint32_t SPD14      : 1;            /*!< Set Very High output speed when OSPDy(y=0..15) is 0b11                    */
      __IOM uint32_t SPD15      : 1;            /*!< Set Very High output speed when OSPDy(y=0..15) is 0b11                    */
            uint32_t            : 16;
    } OSPD1_b;
  } ;
} GPIO_Type;                                   /*!< Size = 64 (0x40)                                                          */



/* =========================================================================================================================== */
/* ================                                           GPIOB                                           ================ */
/* =========================================================================================================================== */


/**
  * @brief General-purpose I/Os (GPIOB)
  */

typedef struct {                                /*!< GPIOB Structure                                                           */

  union {
    __IOM uint32_t CTL;                         /*!< GPIO port control register                                                */

    struct {
      __IOM uint32_t CTL0       : 2;            /*!< Port x configuration bits (y = 0..15)                                     */
      __IOM uint32_t CTL1       : 2;            /*!< Port x configuration bits (y = 0..15)                                     */
      __IOM uint32_t CTL2       : 2;            /*!< Port x configuration bits (y = 0..15)                                     */
      __IOM uint32_t CTL3       : 2;            /*!< Port x configuration bits (y = 0..15)                                     */
      __IOM uint32_t CTL4       : 2;            /*!< Port x configuration bits (y = 0..15)                                     */
      __IOM uint32_t CTL5       : 2;            /*!< Port x configuration bits (y = 0..15)                                     */
      __IOM uint32_t CTL6       : 2;            /*!< Port x configuration bits (y = 0..15)                                     */
      __IOM uint32_t CTL7       : 2;            /*!< Port x configuration bits (y = 0..15)                                     */
      __IOM uint32_t CTL8       : 2;            /*!< Port x configuration bits (y = 0..15)                                     */
      __IOM uint32_t CTL9       : 2;            /*!< Port x configuration bits (y = 0..15)                                     */
      __IOM uint32_t CTL10      : 2;            /*!< Port x configuration bits (y = 0..15)                                     */
      __IOM uint32_t CTL11      : 2;            /*!< Port x configuration bits (y = 0..15)                                     */
      __IOM uint32_t CTL12      : 2;            /*!< Port x configuration bits (y = 0..15)                                     */
      __IOM uint32_t CTL13      : 2;            /*!< Port x configuration bits (y = 0..15)                                     */
      __IOM uint32_t CTL14      : 2;            /*!< Port x configuration bits (y = 0..15)                                     */
      __IOM uint32_t CTL15      : 2;            /*!< Port x configuration bits (y = 0..15)                                     */
    } CTL_b;
  } ;

  union {
    __IOM uint32_t OMODE;                       /*!< GPIO port output type register                                            */

