RIOT-OS/RIOT/cpu/gd32f3x0/include/gd32f3x0_periph.h
    struct {
      __IM  uint32_t ISTAT0     : 1;            /*!< Port input data (y = 0..15)                                               */
      __IM  uint32_t ISTAT1     : 1;            /*!< Port input data (y = 0..15)                                               */
      __IM  uint32_t ISTAT2     : 1;            /*!< Port input data (y = 0..15)                                               */
      __IM  uint32_t ISTAT3     : 1;            /*!< Port input data (y = 0..15)                                               */
      __IM  uint32_t ISTAT4     : 1;            /*!< Port input data (y = 0..15)                                               */
      __IM  uint32_t ISTAT5     : 1;            /*!< Port input data (y = 0..15)                                               */
      __IM  uint32_t ISTAT6     : 1;            /*!< Port input data (y = 0..15)                                               */
      __IM  uint32_t ISTAT7     : 1;            /*!< Port input data (y = 0..15)                                               */
      __IM  uint32_t ISTAT8     : 1;            /*!< Port input data (y = 0..15)                                               */
      __IM  uint32_t ISTAT9     : 1;            /*!< Port input data (y = 0..15)                                               */
      __IM  uint32_t ISTAT10    : 1;            /*!< Port input data (y = 0..15)                                               */
      __IM  uint32_t ISTAT11    : 1;            /*!< Port input data (y = 0..15)                                               */
      __IM  uint32_t ISTAT12    : 1;            /*!< Port input data (y = 0..15)                                               */
      __IM  uint32_t ISTAT13    : 1;            /*!< Port input data (y = 0..15)                                               */
      __IM  uint32_t ISTAT14    : 1;            /*!< Port input data (y = 0..15)                                               */
      __IM  uint32_t ISTAT15    : 1;            /*!< Port input data (y = 0..15)                                               */
            uint32_t            : 16;
    } ISTAT_b;
  } ;

  union {
    __IOM uint32_t OCTL;                        /*!< GPIO port output data register                                            */

    struct {
      __IOM uint32_t OCTL0      : 1;            /*!< Port output data (y = 0..15)                                              */
      __IOM uint32_t OCTL1      : 1;            /*!< Port output data (y = 0..15)                                              */
      __IOM uint32_t OCTL2      : 1;            /*!< Port output data (y = 0..15)                                              */
      __IOM uint32_t OCTL3      : 1;            /*!< Port output data (y = 0..15)                                              */
      __IOM uint32_t OCTL4      : 1;            /*!< Port output data (y = 0..15)                                              */
      __IOM uint32_t OCTL5      : 1;            /*!< Port output data (y = 0..15)                                              */
      __IOM uint32_t OCTL6      : 1;            /*!< Port output data (y = 0..15)                                              */
      __IOM uint32_t OCTL7      : 1;            /*!< Port output data (y = 0..15)                                              */
      __IOM uint32_t OCTL8      : 1;            /*!< Port output data (y = 0..15)                                              */
      __IOM uint32_t OCTL9      : 1;            /*!< Port output data (y = 0..15)                                              */
      __IOM uint32_t OCTL10     : 1;            /*!< Port output data (y = 0..15)                                              */
      __IOM uint32_t OCTL11     : 1;            /*!< Port output data (y = 0..15)                                              */
      __IOM uint32_t OCTL12     : 1;            /*!< Port output data (y = 0..15)                                              */
      __IOM uint32_t OCTL13     : 1;            /*!< Port output data (y = 0..15)                                              */
      __IOM uint32_t OCTL14     : 1;            /*!< Port output data (y = 0..15)                                              */
      __IOM uint32_t OCTL15     : 1;            /*!< Port output data (y = 0..15)                                              */
            uint32_t            : 16;
    } OCTL_b;
  } ;

  union {
    __OM  uint32_t BOP;                         /*!< GPIO port bit set/reset register                                          */

    struct {
      __OM  uint32_t BOP0       : 1;            /*!< Port x set bit y (y= 0..15)                                               */
      __OM  uint32_t BOP1       : 1;            /*!< Port x set bit y (y= 0..15)                                               */
      __OM  uint32_t BOP2       : 1;            /*!< Port x set bit y (y= 0..15)                                               */
      __OM  uint32_t BOP3       : 1;            /*!< Port x set bit y (y= 0..15)                                               */
      __OM  uint32_t BOP4       : 1;            /*!< Port x set bit y (y= 0..15)                                               */
      __OM  uint32_t BOP5       : 1;            /*!< Port x set bit y (y= 0..15)                                               */
      __OM  uint32_t BOP6       : 1;            /*!< Port x set bit y (y= 0..15)                                               */
      __OM  uint32_t BOP7       : 1;            /*!< Port x set bit y (y= 0..15)                                               */
      __OM  uint32_t BOP8       : 1;            /*!< Port x set bit y (y= 0..15)                                               */
      __OM  uint32_t BOP9       : 1;            /*!< Port x set bit y (y= 0..15)                                               */
      __OM  uint32_t BOP10      : 1;            /*!< Port x set bit y (y= 0..15)                                               */
      __OM  uint32_t BOP11      : 1;            /*!< Port x set bit y (y= 0..15)                                               */
      __OM  uint32_t BOP12      : 1;            /*!< Port x set bit y (y= 0..15)                                               */
      __OM  uint32_t BOP13      : 1;            /*!< Port x set bit y (y= 0..15)                                               */
      __OM  uint32_t BOP14      : 1;            /*!< Port x set bit y (y= 0..15)                                               */
      __OM  uint32_t BOP15      : 1;            /*!< Port x set bit y (y= 0..15)                                               */
      __OM  uint32_t CR0        : 1;            /*!< Port x reset bit y (y= 0..15)                                             */
      __OM  uint32_t CR1        : 1;            /*!< Port x reset bit y (y = 0..15)                                            */
      __OM  uint32_t CR2        : 1;            /*!< Port x reset bit y (y = 0..15)                                            */
      __OM  uint32_t CR3        : 1;            /*!< Port x reset bit y (y = 0..15)                                            */
      __OM  uint32_t CR4        : 1;            /*!< Port x reset bit y (y = 0..15)                                            */
      __OM  uint32_t CR5        : 1;            /*!< Port x reset bit y (y = 0..15)                                            */
      __OM  uint32_t CR6        : 1;            /*!< Port x reset bit y (y = 0..15)                                            */
      __OM  uint32_t CR7        : 1;            /*!< Port x reset bit y (y = 0..15)                                            */
      __OM  uint32_t CR8        : 1;            /*!< Port x reset bit y (y = 0..15)                                            */
      __OM  uint32_t CR9        : 1;            /*!< Port x reset bit y (y = 0..15)                                            */
      __OM  uint32_t CR10       : 1;            /*!< Port x reset bit y (y = 0..15)                                            */
      __OM  uint32_t CR11       : 1;            /*!< Port x reset bit y (y = 0..15)                                            */
      __OM  uint32_t CR12       : 1;            /*!< Port x reset bit y (y = 0..15)                                            */
      __OM  uint32_t CR13       : 1;            /*!< Port x reset bit y (y = 0..15)                                            */
      __OM  uint32_t CR14       : 1;            /*!< Port x reset bit y (y = 0..15)                                            */
      __OM  uint32_t CR15       : 1;            /*!< Port x reset bit y (y = 0..15)                                            */
    } BOP_b;
  } ;
  __IM  uint32_t  RESERVED;

  union {
    __IOM uint32_t AFSEL0;                      /*!< GPIO alternate function low register                                      */

