RIOT-OS/RIOT/cpu/gd32f3x0/include/gd32f3x0_periph.h
    struct {
      __OM  uint32_t CR0        : 1;            /*!< Port cleat bit                                                            */
      __OM  uint32_t CR1        : 1;            /*!< Port cleat bit                                                            */
      __OM  uint32_t CR2        : 1;            /*!< Port cleat bit                                                            */
      __OM  uint32_t CR3        : 1;            /*!< Port cleat bit                                                            */
      __OM  uint32_t CR4        : 1;            /*!< Port cleat bit                                                            */
      __OM  uint32_t CR5        : 1;            /*!< Port cleat bit                                                            */
      __OM  uint32_t CR6        : 1;            /*!< Port cleat bit                                                            */
      __OM  uint32_t CR7        : 1;            /*!< Port cleat bit                                                            */
      __OM  uint32_t CR8        : 1;            /*!< Port cleat bit                                                            */
      __OM  uint32_t CR9        : 1;            /*!< Port cleat bit                                                            */
      __OM  uint32_t CR10       : 1;            /*!< Port cleat bit                                                            */
      __OM  uint32_t CR11       : 1;            /*!< Port cleat bit                                                            */
      __OM  uint32_t CR12       : 1;            /*!< Port cleat bit                                                            */
      __OM  uint32_t CR13       : 1;            /*!< Port cleat bit                                                            */
      __OM  uint32_t CR14       : 1;            /*!< Port cleat bit                                                            */
      __OM  uint32_t CR15       : 1;            /*!< Port cleat bit                                                            */
            uint32_t            : 16;
    } BC_b;
  } ;

  union {
    __OM  uint32_t TG;                          /*!< Port bit toggle register                                                  */

    struct {
      __OM  uint32_t TG0        : 1;            /*!< Port toggle bit                                                           */
      __OM  uint32_t TG1        : 1;            /*!< Port toggle bit                                                           */
      __OM  uint32_t TG2        : 1;            /*!< Port toggle bit                                                           */
      __OM  uint32_t TG3        : 1;            /*!< Port toggle bit                                                           */
      __OM  uint32_t TG4        : 1;            /*!< Port toggle bit                                                           */
      __OM  uint32_t TG5        : 1;            /*!< Port toggle bit                                                           */
      __OM  uint32_t TG6        : 1;            /*!< Port toggle bit                                                           */
      __OM  uint32_t TG7        : 1;            /*!< Port toggle bit                                                           */
      __OM  uint32_t TG8        : 1;            /*!< Port toggle bit                                                           */
      __OM  uint32_t TG9        : 1;            /*!< Port toggle bit                                                           */
      __OM  uint32_t TG10       : 1;            /*!< Port toggle bit                                                           */
      __OM  uint32_t TG11       : 1;            /*!< Port toggle bit                                                           */
      __OM  uint32_t TG12       : 1;            /*!< Port toggle bit                                                           */
      __OM  uint32_t TG13       : 1;            /*!< Port toggle bit                                                           */
      __OM  uint32_t TG14       : 1;            /*!< Port toggle bit                                                           */
      __OM  uint32_t TG15       : 1;            /*!< Port toggle bit                                                           */
            uint32_t            : 16;
    } TG_b;
  } ;
  __IM  uint32_t  RESERVED1[3];

  union {
    __IOM uint32_t OSPD1;                       /*!< Port output speed register 1                                              */

    struct {
      __IOM uint32_t SPD0       : 1;            /*!< Set Very High output speed when OSPDy(y=0..15) is 0b11                    */
      __IOM uint32_t SPD1       : 1;            /*!< Set Very High output speed when OSPDy(y=0..15) is 0b11                    */
      __IOM uint32_t SPD2       : 1;            /*!< Set Very High output speed when OSPDy(y=0..15) is 0b11                    */
      __IOM uint32_t SPD3       : 1;            /*!< Set Very High output speed when OSPDy(y=0..15) is 0b11                    */
      __IOM uint32_t SPD4       : 1;            /*!< Set Very High output speed when OSPDy(y=0..15) is 0b11                    */
      __IOM uint32_t SPD5       : 1;            /*!< Set Very High output speed when OSPDy(y=0..15) is 0b11                    */
      __IOM uint32_t SPD6       : 1;            /*!< Set Very High output speed when OSPDy(y=0..15) is 0b11                    */
      __IOM uint32_t SPD7       : 1;            /*!< Set Very High output speed when OSPDy(y=0..15) is 0b11                    */
      __IOM uint32_t SPD8       : 1;            /*!< Set Very High output speed when OSPDy(y=0..15) is 0b11                    */
      __IOM uint32_t SPD9       : 1;            /*!< Set Very High output speed when OSPDy(y=0..15) is 0b11                    */
      __IOM uint32_t SPD10      : 1;            /*!< Set Very High output speed when OSPDy(y=0..15) is 0b11                    */
      __IOM uint32_t SPD11      : 1;            /*!< Set Very High output speed when OSPDy(y=0..15) is 0b11                    */
      __IOM uint32_t SPD12      : 1;            /*!< Set Very High output speed when OSPDy(y=0..15) is 0b11                    */
      __IOM uint32_t SPD13      : 1;            /*!< Set Very High output speed when OSPDy(y=0..15) is 0b11                    */
      __IOM uint32_t SPD14      : 1;            /*!< Set Very High output speed when OSPDy(y=0..15) is 0b11                    */
      __IOM uint32_t SPD15      : 1;            /*!< Set Very High output speed when OSPDy(y=0..15) is 0b11                    */
            uint32_t            : 16;
    } OSPD1_b;
  } ;
} GPIOD_Type;                                   /*!< Size = 64 (0x40)                                                          */



/* =========================================================================================================================== */
/* ================                                           GPIOF                                           ================ */
/* =========================================================================================================================== */


/**
  * @brief General-purpose I/Os (GPIOF)
  */

