RIOT-OS/RIOT/cpu/gd32f3x0/include/gd32f3x0_periph.h
typedef struct {                                /*!< GPIOF Structure                                                           */

  union {
    __IOM uint32_t CTL;                         /*!< GPIOF port control register                                               */

    struct {
      __IOM uint32_t CTL0       : 2;            /*!< Port x configuration bits (y = 0..15)                                     */
      __IOM uint32_t CTL1       : 2;            /*!< Port x configuration bits (y = 0..15)                                     */
      __IOM uint32_t CTL2       : 2;            /*!< Port x configuration bits (y = 0..15)                                     */
      __IOM uint32_t CTL3       : 2;            /*!< Port x configuration bits (y = 0..15)                                     */
      __IOM uint32_t CTL4       : 2;            /*!< Port x configuration bits (y = 0..15)                                     */
      __IOM uint32_t CTL5       : 2;            /*!< Port x configuration bits (y = 0..15)                                     */
      __IOM uint32_t CTL6       : 2;            /*!< Port x configuration bits (y = 0..15)                                     */
      __IOM uint32_t CTL7       : 2;            /*!< Port x configuration bits (y = 0..15)                                     */
      __IOM uint32_t CTL8       : 2;            /*!< Port x configuration bits (y = 0..15)                                     */
      __IOM uint32_t CTL9       : 2;            /*!< Port x configuration bits (y = 0..15)                                     */
      __IOM uint32_t CTL10      : 2;            /*!< Port x configuration bits (y = 0..15)                                     */
      __IOM uint32_t CTL11      : 2;            /*!< Port x configuration bits (y = 0..15)                                     */
      __IOM uint32_t CTL12      : 2;            /*!< Port x configuration bits (y = 0..15)                                     */
      __IOM uint32_t CTL13      : 2;            /*!< Port x configuration bits (y = 0..15)                                     */
      __IOM uint32_t CTL14      : 2;            /*!< Port x configuration bits (y = 0..15)                                     */
      __IOM uint32_t CTL15      : 2;            /*!< Port x configuration bits (y = 0..15)                                     */
    } CTL_b;
  } ;

  union {
    __IOM uint32_t OMODE;                       /*!< GPIO port output type register                                            */

    struct {
      __IOM uint32_t OM0        : 1;            /*!< Port x configuration bit 0                                                */
      __IOM uint32_t OM1        : 1;            /*!< Port x configuration bit 1                                                */
      __IOM uint32_t OM2        : 1;            /*!< Port x configuration bit 2                                                */
      __IOM uint32_t OM3        : 1;            /*!< Port x configuration bit 3                                                */
      __IOM uint32_t OM4        : 1;            /*!< Port x configuration bit 4                                                */
      __IOM uint32_t OM5        : 1;            /*!< Port x configuration bit 5                                                */
      __IOM uint32_t OM6        : 1;            /*!< Port x configuration bit 6                                                */
      __IOM uint32_t OM7        : 1;            /*!< Port x configuration bit 7                                                */
      __IOM uint32_t OM8        : 1;            /*!< Port x configuration bit 8                                                */
      __IOM uint32_t OM9        : 1;            /*!< Port x configuration bit 9                                                */
      __IOM uint32_t OM10       : 1;            /*!< Port x configuration bit 10                                               */
      __IOM uint32_t OM11       : 1;            /*!< Port x configuration bit 11                                               */
      __IOM uint32_t OM12       : 1;            /*!< Port x configuration bit 12                                               */
      __IOM uint32_t OM13       : 1;            /*!< Port x configuration bit 13                                               */
      __IOM uint32_t OM14       : 1;            /*!< Port x configuration bit 14                                               */
      __IOM uint32_t OM15       : 1;            /*!< Port x configuration bit 15                                               */
            uint32_t            : 16;
    } OMODE_b;
  } ;

  union {
    __IOM uint32_t OSPD0;                       /*!< GPIO port output speed register 0                                         */

    struct {
      __IOM uint32_t OSPD0      : 2;            /*!< Port x configuration bits (y = 0..15)                                     */
      __IOM uint32_t OSPD1      : 2;            /*!< Port x configuration bits (y = 0..15)                                     */
      __IOM uint32_t OSPD2      : 2;            /*!< Port x configuration bits (y = 0..15)                                     */
      __IOM uint32_t OSPD3      : 2;            /*!< Port x configuration bits (y = 0..15)                                     */
      __IOM uint32_t OSPD4      : 2;            /*!< Port x configuration bits (y = 0..15)                                     */
      __IOM uint32_t OSPD5      : 2;            /*!< Port x configuration bits (y = 0..15)                                     */
      __IOM uint32_t OSPD6      : 2;            /*!< Port x configuration bits (y = 0..15)                                     */
      __IOM uint32_t OSPD7      : 2;            /*!< Port x configuration bits (y = 0..15)                                     */
      __IOM uint32_t OSPD8      : 2;            /*!< Port x configuration bits (y = 0..15)                                     */
      __IOM uint32_t OSPD9      : 2;            /*!< Port x configuration bits (y = 0..15)                                     */
      __IOM uint32_t OSPD10     : 2;            /*!< Port x configuration bits (y = 0..15)                                     */
      __IOM uint32_t OSPD11     : 2;            /*!< Port x configuration bits (y = 0..15)                                     */
      __IOM uint32_t OSPD12     : 2;            /*!< Port x configuration bits (y = 0..15)                                     */
      __IOM uint32_t OSPD13     : 2;            /*!< Port x configuration bits (y = 0..15)                                     */
      __IOM uint32_t OSPD14     : 2;            /*!< Port x configuration bits (y = 0..15)                                     */
      __IOM uint32_t OSPD15     : 2;            /*!< Port x configuration bits (y = 0..15)                                     */
    } OSPD0_b;
  } ;

  union {
    __IOM uint32_t PUD;                         /*!< GPIO port pull-up/pull-down register                                      */

