RIOT-OS/RIOT/cpu/gd32f3x0/include/gd32f3x0_periph.h
    struct {
      __OM  uint32_t BOP0       : 1;            /*!< Port x set bit y (y= 0..15)                                               */
      __OM  uint32_t BOP1       : 1;            /*!< Port x set bit y (y= 0..15)                                               */
      __OM  uint32_t BOP2       : 1;            /*!< Port x set bit y (y= 0..15)                                               */
      __OM  uint32_t BOP3       : 1;            /*!< Port x set bit y (y= 0..15)                                               */
      __OM  uint32_t BOP4       : 1;            /*!< Port x set bit y (y= 0..15)                                               */
      __OM  uint32_t BOP5       : 1;            /*!< Port x set bit y (y= 0..15)                                               */
      __OM  uint32_t BOP6       : 1;            /*!< Port x set bit y (y= 0..15)                                               */
      __OM  uint32_t BOP7       : 1;            /*!< Port x set bit y (y= 0..15)                                               */
      __OM  uint32_t BOP8       : 1;            /*!< Port x set bit y (y= 0..15)                                               */
      __OM  uint32_t BOP9       : 1;            /*!< Port x set bit y (y= 0..15)                                               */
      __OM  uint32_t BOP10      : 1;            /*!< Port x set bit y (y= 0..15)                                               */
      __OM  uint32_t BOP11      : 1;            /*!< Port x set bit y (y= 0..15)                                               */
      __OM  uint32_t BOP12      : 1;            /*!< Port x set bit y (y= 0..15)                                               */
      __OM  uint32_t BOP13      : 1;            /*!< Port x set bit y (y= 0..15)                                               */
      __OM  uint32_t BOP14      : 1;            /*!< Port x set bit y (y= 0..15)                                               */
      __OM  uint32_t BOP15      : 1;            /*!< Port x set bit y (y= 0..15)                                               */
      __OM  uint32_t CR0        : 1;            /*!< Port x set bit y (y= 0..15)                                               */
      __OM  uint32_t CR1        : 1;            /*!< Port x reset bit y (y = 0..15)                                            */
      __OM  uint32_t CR2        : 1;            /*!< Port x reset bit y (y = 0..15)                                            */
      __OM  uint32_t CR3        : 1;            /*!< Port x reset bit y (y = 0..15)                                            */
      __OM  uint32_t CR4        : 1;            /*!< Port x reset bit y (y = 0..15)                                            */
      __OM  uint32_t CR5        : 1;            /*!< Port x reset bit y (y = 0..15)                                            */
      __OM  uint32_t CR6        : 1;            /*!< Port x reset bit y (y = 0..15)                                            */
      __OM  uint32_t CR7        : 1;            /*!< Port x reset bit y (y = 0..15)                                            */
      __OM  uint32_t CR8        : 1;            /*!< Port x reset bit y (y = 0..15)                                            */
      __OM  uint32_t CR9        : 1;            /*!< Port x reset bit y (y = 0..15)                                            */
      __OM  uint32_t CR10       : 1;            /*!< Port x reset bit y (y = 0..15)                                            */
      __OM  uint32_t CR11       : 1;            /*!< Port x reset bit y (y = 0..15)                                            */
      __OM  uint32_t CR12       : 1;            /*!< Port x reset bit y (y = 0..15)                                            */
      __OM  uint32_t CR13       : 1;            /*!< Port x reset bit y (y = 0..15)                                            */
      __OM  uint32_t CR14       : 1;            /*!< Port x reset bit y (y = 0..15)                                            */
      __OM  uint32_t CR15       : 1;            /*!< Port x reset bit y (y = 0..15)                                            */
    } BOP_b;
  } ;
  __IM  uint32_t  RESERVED[3];

  union {
    __OM  uint32_t BC;                          /*!< Port bit reset register                                                   */

    struct {
      __OM  uint32_t CR0        : 1;            /*!< Port x Reset bit y                                                        */
      __OM  uint32_t CR1        : 1;            /*!< Port x Reset bit y                                                        */
      __OM  uint32_t CR2        : 1;            /*!< Port x Reset bit y                                                        */
      __OM  uint32_t CR3        : 1;            /*!< Port x Reset bit y                                                        */
      __OM  uint32_t CR4        : 1;            /*!< Port x Reset bit y                                                        */
      __OM  uint32_t CR5        : 1;            /*!< Port x Reset bit y                                                        */
      __OM  uint32_t CR6        : 1;            /*!< Port x Reset bit y                                                        */
      __OM  uint32_t CR7        : 1;            /*!< Port x Reset bit y                                                        */
      __OM  uint32_t CR8        : 1;            /*!< Port x Reset bit y                                                        */
      __OM  uint32_t CR9        : 1;            /*!< Port x Reset bit y                                                        */
      __OM  uint32_t CR10       : 1;            /*!< Port x Reset bit y                                                        */
      __OM  uint32_t CR11       : 1;            /*!< Port x Reset bit y                                                        */
      __OM  uint32_t CR12       : 1;            /*!< Port x Reset bit y                                                        */
      __OM  uint32_t CR13       : 1;            /*!< Port x Reset bit y                                                        */
      __OM  uint32_t CR14       : 1;            /*!< Port x Reset bit y                                                        */
      __OM  uint32_t CR15       : 1;            /*!< Port x Reset bit y                                                        */
            uint32_t            : 16;
    } BC_b;
  } ;

  union {
    __OM  uint32_t TG;                          /*!< Port bit toggle register                                                  */

