RIOT-OS/RIOT/cpu/gd32f3x0/include/gd32f3x0_periph.h
    struct {
      __OM  uint32_t TG0        : 1;            /*!< Port toggle bit                                                           */
      __OM  uint32_t TG1        : 1;            /*!< Port toggle bit                                                           */
      __OM  uint32_t TG2        : 1;            /*!< Port toggle bit                                                           */
      __OM  uint32_t TG3        : 1;            /*!< Port toggle bit                                                           */
      __OM  uint32_t TG4        : 1;            /*!< Port toggle bit                                                           */
      __OM  uint32_t TG5        : 1;            /*!< Port toggle bit                                                           */
      __OM  uint32_t TG6        : 1;            /*!< Port toggle bit                                                           */
      __OM  uint32_t TG7        : 1;            /*!< Port toggle bit                                                           */
      __OM  uint32_t TG8        : 1;            /*!< Port toggle bit                                                           */
      __OM  uint32_t TG9        : 1;            /*!< Port toggle bit                                                           */
      __OM  uint32_t TG10       : 1;            /*!< Port toggle bit                                                           */
      __OM  uint32_t TG11       : 1;            /*!< Port toggle bit                                                           */
      __OM  uint32_t TG12       : 1;            /*!< Port toggle bit                                                           */
      __OM  uint32_t TG13       : 1;            /*!< Port toggle bit                                                           */
      __OM  uint32_t TG14       : 1;            /*!< Port toggle bit                                                           */
      __OM  uint32_t TG15       : 1;            /*!< Port toggle bit                                                           */
            uint32_t            : 16;
    } TG_b;
  } ;
  __IM  uint32_t  RESERVED1[3];

  union {
    __IOM uint32_t OSPD1;                       /*!< Port output speed register 1                                              */

    struct {
      __IOM uint32_t SPD0       : 1;            /*!< Set Very High output speed when OSPDy(y=0..15) is 0b11                    */
      __IOM uint32_t SPD1       : 1;            /*!< Set Very High output speed when OSPDy(y=0..15) is 0b11                    */
      __IOM uint32_t SPD2       : 1;            /*!< Set Very High output speed when OSPDy(y=0..15) is 0b11                    */
      __IOM uint32_t SPD3       : 1;            /*!< Set Very High output speed when OSPDy(y=0..15) is 0b11                    */
      __IOM uint32_t SPD4       : 1;            /*!< Set Very High output speed when OSPDy(y=0..15) is 0b11                    */
      __IOM uint32_t SPD5       : 1;            /*!< Set Very High output speed when OSPDy(y=0..15) is 0b11                    */
      __IOM uint32_t SPD6       : 1;            /*!< Set Very High output speed when OSPDy(y=0..15) is 0b11                    */
      __IOM uint32_t SPD7       : 1;            /*!< Set Very High output speed when OSPDy(y=0..15) is 0b11                    */
      __IOM uint32_t SPD8       : 1;            /*!< Set Very High output speed when OSPDy(y=0..15) is 0b11                    */
      __IOM uint32_t SPD9       : 1;            /*!< Set Very High output speed when OSPDy(y=0..15) is 0b11                    */
      __IOM uint32_t SPD10      : 1;            /*!< Set Very High output speed when OSPDy(y=0..15) is 0b11                    */
      __IOM uint32_t SPD11      : 1;            /*!< Set Very High output speed when OSPDy(y=0..15) is 0b11                    */
      __IOM uint32_t SPD12      : 1;            /*!< Set Very High output speed when OSPDy(y=0..15) is 0b11                    */
      __IOM uint32_t SPD13      : 1;            /*!< Set Very High output speed when OSPDy(y=0..15) is 0b11                    */
      __IOM uint32_t SPD14      : 1;            /*!< Set Very High output speed when OSPDy(y=0..15) is 0b11                    */
      __IOM uint32_t SPD15      : 1;            /*!< Set Very High output speed when OSPDy(y=0..15) is 0b11                    */
            uint32_t            : 16;
    } OSPD1_b;
  } ;
} GPIOF_Type;                                   /*!< Size = 64 (0x40)                                                          */



/* =========================================================================================================================== */
/* ================                                           I2C0                                            ================ */
/* =========================================================================================================================== */


/**
  * @brief Inter integrated circuit (I2C0)
  */

typedef struct {                                /*!< I2C0 Structure                                                            */

  union {
    __IOM uint32_t CTL0;                        /*!< Control register 0                                                        */

    struct {
      __IOM uint32_t I2CEN      : 1;            /*!< Peripheral enable                                                         */
      __IOM uint32_t SMBEN      : 1;            /*!< SMBus mode                                                                */
            uint32_t            : 1;
      __IOM uint32_t SMBSEL     : 1;            /*!< SMBus type                                                                */
      __IOM uint32_t ARPEN      : 1;            /*!< ARP enable                                                                */
      __IOM uint32_t PECEN      : 1;            /*!< PEC enable                                                                */
      __IOM uint32_t GCEN       : 1;            /*!< General call enable                                                       */
      __IOM uint32_t SS         : 1;            /*!< Clock stretching disable (Slave mode)                                     */
      __IOM uint32_t START      : 1;            /*!< Start generation                                                          */
      __IOM uint32_t STOP       : 1;            /*!< Stop condition                                                            */
      __IOM uint32_t ACKEN      : 1;            /*!< Acknowledge enable                                                        */
      __IOM uint32_t POAP       : 1;            /*!< Acknowledge/PEC Position (for data reception)                             */
      __IOM uint32_t PECTRANS   : 1;            /*!< Packet error checking                                                     */
      __IOM uint32_t SALT       : 1;            /*!< SMBus alert                                                               */
            uint32_t            : 1;
      __IOM uint32_t SRESET     : 1;            /*!< Software reset                                                            */
            uint32_t            : 16;
    } CTL0_b;
  } ;

  union {
    __IOM uint32_t CTL1;                        /*!< Control register 1                                                        */

