RIOT-OS/RIOT/cpu/gd32f3x0/include/gd32f3x0_periph.h
    struct {
      __IOM uint32_t I2CCLK     : 6;            /*!< Peripheral clock frequency                                                */
            uint32_t            : 2;
      __IOM uint32_t ERRIE      : 1;            /*!< Error interrupt enable                                                    */
      __IOM uint32_t EVIE       : 1;            /*!< Event interrupt enable                                                    */
      __IOM uint32_t BUFIE      : 1;            /*!< Buffer interrupt enable                                                   */
      __IOM uint32_t DMAON      : 1;            /*!< DMA mode switch                                                           */
      __IOM uint32_t DMALST     : 1;            /*!< Flag indicating DMA last transfer                                         */
            uint32_t            : 19;
    } CTL1_b;
  } ;

  union {
    __IOM uint32_t SADDR0;                      /*!< Own address register 0                                                    */

    struct {
      __IOM uint32_t ADDRESS    : 10;           /*!< Interface address                                                         */
            uint32_t            : 5;
      __IOM uint32_t ADDFORMAT  : 1;            /*!< Addressing mode (slave mode)                                              */
            uint32_t            : 16;
    } SADDR0_b;
  } ;

  union {
    __IOM uint32_t SADDR1;                      /*!< Own address register 1                                                    */

    struct {
      __IOM uint32_t DUADEN     : 1;            /*!< Dual addressing mode enable                                               */
      __IOM uint32_t ADDRESS2   : 7;            /*!< Interface address                                                         */
            uint32_t            : 24;
    } SADDR1_b;
  } ;

  union {
    __IOM uint32_t DATA;                        /*!< Data register                                                             */

    struct {
      __IOM uint32_t TRB        : 8;            /*!< Transmission or reception data buffer                                     */
            uint32_t            : 24;
    } DATA_b;
  } ;

  union {
    __IOM uint32_t STAT0;                       /*!< Transfer status register 0                                                */

    struct {
      __IM  uint32_t SBSEND     : 1;            /*!< Start bit (Master mode)                                                   */
      __IM  uint32_t ADDSEND    : 1;            /*!< Address sent (master mode)/matched (slave mode)                           */
      __IM  uint32_t BTC        : 1;            /*!< Byte transmission completed                                               */
      __IM  uint32_t ADD10SEND  : 1;            /*!< Header of 10-bit address is sent in master mode                           */
      __IM  uint32_t STPDET     : 1;            /*!< Stop detection (slave mode)                                               */
            uint32_t            : 1;
      __IM  uint32_t RBNE       : 1;            /*!< I2C_DATA is not Empty during receiving                                    */
      __IM  uint32_t TBE        : 1;            /*!< I2C_DATA is Empty during transmitting                                     */
      __IOM uint32_t BERR       : 1;            /*!< Bus error                                                                 */
      __IOM uint32_t LOSTARB    : 1;            /*!< Arbitration lost (master mode)                                            */
      __IOM uint32_t AERR       : 1;            /*!< Acknowledge error                                                         */
      __IOM uint32_t OUERR      : 1;            /*!< Overrun/Underrun occurs in slave mode                                     */
      __IOM uint32_t PECERR     : 1;            /*!< PEC error when receiving data                                             */
            uint32_t            : 1;
      __IOM uint32_t SMBTO      : 1;            /*!< Timeout signal in SMBus mode                                              */
      __IOM uint32_t SMBALT     : 1;            /*!< SMBus alert                                                               */
            uint32_t            : 16;
    } STAT0_b;
  } ;

  union {
    __IM  uint32_t STAT1;                       /*!< Transfer status register 1                                                */

    struct {
      __IM  uint32_t MASTER     : 1;            /*!< Master/slave                                                              */
      __IM  uint32_t I2CBSY     : 1;            /*!< Bus busy                                                                  */
      __IM  uint32_t TR         : 1;            /*!< Transmitter/receiver                                                      */
            uint32_t            : 1;
      __IM  uint32_t RXGC       : 1;            /*!< General call address (Slave mode)                                         */
      __IM  uint32_t DEFSMB     : 1;            /*!< SMBus device default address (Slave mode)                                 */
      __IM  uint32_t HSTSMB     : 1;            /*!< SMBus host header (Slave mode)                                            */
      __IM  uint32_t DUMODF     : 1;            /*!< Dual flag (Slave mode)                                                    */
      __IM  uint32_t PECV       : 8;            /*!< Packet error checking register                                            */
            uint32_t            : 16;
    } STAT1_b;
  } ;

  union {
    __IOM uint32_t CKCFG;                       /*!< Clock configure register                                                  */

    struct {
      __IOM uint32_t CLKC       : 12;           /*!< Clock control register in Fast/Standard mode (Master mode)                */
            uint32_t            : 2;
      __IOM uint32_t DTCY       : 1;            /*!< Fast mode duty cycle                                                      */
      __IOM uint32_t FAST       : 1;            /*!< I2C master mode selection                                                 */
            uint32_t            : 16;
    } CKCFG_b;
  } ;

  union {
    __IOM uint32_t RT;                          /*!< Rise time register                                                        */

