RIOT-OS/RIOT/cpu/gd32f3x0/include/gd32f3x0_periph.h
    struct {
      __IOM uint32_t RISETIME   : 6;            /*!< Maximum rise time in master mode                                          */
            uint32_t            : 26;
    } RT_b;
  } ;
  __IM  uint32_t  RESERVED[27];

  union {
    __IOM uint32_t FMPCFG;                      /*!< Fast-mode-plus configure register                                         */

    struct {
      __IOM uint32_t FMPEN      : 1;            /*!< Fast-mode-plus enable                                                     */
            uint32_t            : 31;
    } FMPCFG_b;
  } ;
} I2C_Type;                                    /*!< Size = 148 (0x94)                                                         */



// /* =========================================================================================================================== */
// /* ================                                           NVIC                                            ================ */
// /* =========================================================================================================================== */


// /**
//   * @brief Nested Vectored Interrupt
//       Controller (NVIC)
//   */

// typedef struct {                                /*!< NVIC Structure                                                            */

//   union {
//     __IOM uint32_t ISER;                        /*!< Interrupt Set Enable Register                                             */

//     struct {
//       __IOM uint32_t SETENA     : 32;           /*!< SETENA                                                                    */
//     } ISER_b;
//   } ;
//   __IM  uint32_t  RESERVED[31];

//   union {
//     __IOM uint32_t ICER;                        /*!< Interrupt Clear Enable Register                                           */

//     struct {
//       __IOM uint32_t CLRENA     : 32;           /*!< CLRENA                                                                    */
//     } ICER_b;
//   } ;
//   __IM  uint32_t  RESERVED1[31];

//   union {
//     __IOM uint32_t ISPR;                        /*!< Interrupt Set-Pending Register                                            */

//     struct {
//       __IOM uint32_t SETPEND    : 32;           /*!< SETPEND                                                                   */
//     } ISPR_b;
//   } ;
//   __IM  uint32_t  RESERVED2[31];

//   union {
//     __IOM uint32_t ICPR;                        /*!< Interrupt Clear-Pending Register                                          */

//     struct {
//       __IOM uint32_t CLRPEND    : 32;           /*!< CLRPEND                                                                   */
//     } ICPR_b;
//   } ;
//   __IM  uint32_t  RESERVED3[31];

//   union {
//     __IOM uint32_t IABR;                        /*!< Interrupt Active bit Register                                             */

//     struct {
//       __IOM uint32_t IABR       : 32;           /*!< IABR                                                                      */
//     } IABR_b;
//   } ;
//   __IM  uint32_t  RESERVED4[63];

//   union {
//     __IOM uint8_t IPR0;                         /*!< Interrupt Priority Register 0                                             */

//     struct {
//       __IOM uint8_t PRI_00      : 8;            /*!< PRI_00                                                                    */
//     } IPR0_b;
//   } ;

//   union {
//     __IOM uint8_t IPR1;                         /*!< Interrupt Priority Register 1                                             */

//     struct {
//       __IOM uint8_t PRI_01      : 8;            /*!< PRI_01                                                                    */
//     } IPR1_b;
//   } ;

//   union {
//     __IOM uint8_t IPR2;                         /*!< Interrupt Priority Register 2                                             */

//     struct {
//       __IOM uint8_t PRI_02      : 8;            /*!< PRI_02                                                                    */
//     } IPR2_b;
//   } ;

//   union {
//     __IOM uint8_t IPR3;                         /*!< Interrupt Priority Register 3                                             */

//     struct {
//       __IOM uint8_t PRI_03      : 8;            /*!< PRI_03                                                                    */
//     } IPR3_b;
//   } ;

//   union {
//     __IOM uint8_t IPR4;                         /*!< Interrupt Priority Register 4                                             */

//     struct {
//       __IOM uint8_t PRI_04      : 8;            /*!< PRI_04                                                                    */
//     } IPR4_b;
//   } ;

//   union {
//     __IOM uint8_t IPR5;                         /*!< Interrupt Priority Register 5                                             */

//     struct {
//       __IOM uint8_t PRI_05      : 8;            /*!< PRI_05                                                                    */
//     } IPR5_b;
//   } ;

//   union {
//     __IOM uint8_t IPR6;                         /*!< Interrupt Priority Register 6                                             */

//     struct {
//       __IOM uint8_t PRI_06      : 8;            /*!< PRI_06                                                                    */
//     } IPR6_b;
//   } ;

//   union {
//     __IOM uint8_t IPR7;                         /*!< Interrupt Priority Register 7                                             */

//     struct {
//       __IOM uint8_t PRI_07      : 8;            /*!< PRI_07                                                                    */
//     } IPR7_b;
//   } ;

//   union {
//     __IOM uint8_t IPR8;                         /*!< Interrupt Priority Register 8                                             */

//     struct {
//       __IOM uint8_t PRI_08      : 8;            /*!< PRI_08                                                                    */
//     } IPR8_b;
//   } ;

//   union {
//     __IOM uint8_t IPR9;                         /*!< Interrupt Priority Register 9                                             */

//     struct {
//       __IOM uint8_t PRI_09      : 8;            /*!< PRI_09                                                                    */
//     } IPR9_b;
//   } ;

//   union {
//     __IOM uint8_t IPR10;                        /*!< Interrupt Priority Register 10                                            */

//     struct {
//       __IOM uint8_t PRI_10      : 8;            /*!< PRI_10                                                                    */
//     } IPR10_b;
//   } ;

//   union {
//     __IOM uint8_t IPR11;                        /*!< Interrupt Priority Register 11                                            */

//     struct {
//       __IOM uint8_t PRI_11      : 8;            /*!< PRI_11                                                                    */
//     } IPR11_b;
//   } ;

//   union {
//     __IOM uint8_t IPR12;                        /*!< Interrupt Priority Register 12                                            */

//     struct {
//       __IOM uint8_t PRI_12      : 8;            /*!< PRI_12                                                                    */
//     } IPR12_b;
//   } ;

//   union {
//     __IOM uint8_t IPR13;                        /*!< Interrupt Priority Register 13                                            */

//     struct {
//       __IOM uint8_t PRI_13      : 8;            /*!< PRI_13                                                                    */
//     } IPR13_b;
//   } ;

//   union {
//     __IOM uint8_t IPR14;                        /*!< Interrupt Priority Register 14                                            */

//     struct {
//       __IOM uint8_t PRI_14      : 8;            /*!< PRI_14                                                                    */
//     } IPR14_b;
//   } ;

//   union {
//     __IOM uint8_t IPR15;                        /*!< Interrupt Priority Register 15                                            */

//     struct {
//       __IOM uint8_t PRI_15      : 8;            /*!< PRI_15                                                                    */
//     } IPR15_b;
//   } ;

//   union {
//     __IOM uint8_t IPR16;                        /*!< Interrupt Priority Register 16                                            */

//     struct {
//       __IOM uint8_t PRI_16      : 8;            /*!< PRI_16                                                                    */
//     } IPR16_b;
//   } ;

//   union {
//     __IOM uint8_t IPR17;                        /*!< Interrupt Priority Register 17                                            */

//     struct {
//       __IOM uint8_t PRI_17      : 8;            /*!< PRI_17                                                                    */
//     } IPR17_b;
//   } ;

//   union {
//     __IOM uint8_t IPR18;                        /*!< Interrupt Priority Register 18                                            */

//     struct {
//       __IOM uint8_t PRI_18      : 8;            /*!< PRI_18                                                                    */
//     } IPR18_b;
//   } ;

//   union {
//     __IOM uint8_t IPR19;                        /*!< Interrupt Priority Register 19                                            */

//     struct {
//       __IOM uint8_t PRI_19      : 8;            /*!< PRI_19                                                                    */
//     } IPR19_b;
//   } ;

//   union {
//     __IOM uint8_t IPR20;                        /*!< Interrupt Priority Register 20                                            */

//     struct {
//       __IOM uint8_t PRI_20      : 8;            /*!< PRI_20                                                                    */
//     } IPR20_b;
//   } ;

//   union {
//     __IOM uint8_t IPR21;                        /*!< Interrupt Priority Register 21                                            */

//     struct {
//       __IOM uint8_t PRI_21      : 8;            /*!< PRI_21                                                                    */
//     } IPR21_b;
//   } ;

//   union {
//     __IOM uint8_t IPR22;                        /*!< Interrupt Priority Register 22                                            */

//     struct {
//       __IOM uint8_t PRI_22      : 8;            /*!< PRI_22                                                                    */
//     } IPR22_b;
//   } ;

//   union {
//     __IOM uint8_t IPR23;                        /*!< Interrupt Priority Register 23                                            */

//     struct {
//       __IOM uint8_t PRI_23      : 8;            /*!< PRI_23                                                                    */
//     } IPR23_b;
//   } ;

//   union {
//     __IOM uint8_t IPR24;                        /*!< Interrupt Priority Register 24                                            */

//     struct {
//       __IOM uint8_t PRI_24      : 8;            /*!< PRI_24                                                                    */
//     } IPR24_b;
//   } ;

//   union {
//     __IOM uint8_t IPR25;                        /*!< Interrupt Priority Register 25                                            */

//     struct {
//       __IOM uint8_t PRI_25      : 8;            /*!< PRI_25                                                                    */
//     } IPR25_b;
//   } ;

//   union {
//     __IOM uint8_t IPR26;                        /*!< Interrupt Priority Register 26                                            */

//     struct {
//       __IOM uint8_t PRI_26      : 8;            /*!< PRI_26                                                                    */
//     } IPR26_b;
//   } ;

//   union {
//     __IOM uint8_t IPR27;                        /*!< Interrupt Priority Register 27                                            */

//     struct {
//       __IOM uint8_t PRI_27      : 8;            /*!< PRI_27                                                                    */
//     } IPR27_b;
//   } ;

//   union {
//     __IOM uint8_t IPR28;                        /*!< Interrupt Priority Register 28                                            */

//     struct {
//       __IOM uint8_t PRI_28      : 8;            /*!< PRI_28                                                                    */
//     } IPR28_b;
//   } ;

//   union {
//     __IOM uint8_t IPR29;                        /*!< Interrupt Priority Register 29                                            */

//     struct {
//       __IOM uint8_t PRI_29      : 8;            /*!< PRI_29                                                                    */
//     } IPR29_b;
//   } ;

//   union {
//     __IOM uint8_t IPR30;                        /*!< Interrupt Priority Register 30                                            */

//     struct {
//       __IOM uint8_t PRI_30      : 8;            /*!< PRI_30                                                                    */
//     } IPR30_b;
//   } ;

//   union {
//     __IOM uint8_t IPR31;                        /*!< Interrupt Priority Register 31                                            */

//     struct {
//       __IOM uint8_t PRI_31      : 8;            /*!< PRI_31                                                                    */
//     } IPR31_b;
//   } ;

//   union {
//     __IOM uint8_t IPR32;                        /*!< Interrupt Priority Register 32                                            */

//     struct {
//       __IOM uint8_t PRI_32      : 8;            /*!< PRI_32                                                                    */
//     } IPR32_b;
//   } ;

//   union {
//     __IOM uint8_t IPR33;                        /*!< Interrupt Priority Register 33                                            */

//     struct {
//       __IOM uint8_t PRI_33      : 8;            /*!< PRI_33                                                                    */
//     } IPR33_b;
//   } ;

//   union {
//     __IOM uint8_t IPR34;                        /*!< Interrupt Priority Register 34                                            */

//     struct {
//       __IOM uint8_t PRI_34      : 8;            /*!< PRI_34                                                                    */
//     } IPR34_b;
//   } ;

//   union {
//     __IOM uint8_t IPR35;                        /*!< Interrupt Priority Register 35                                            */

//     struct {
//       __IOM uint8_t PRI_35      : 8;            /*!< PRI_35                                                                    */
//     } IPR35_b;
//   } ;

//   union {
//     __IOM uint8_t IPR36;                        /*!< Interrupt Priority Register 36                                            */

//     struct {
//       __IOM uint8_t PRI_36      : 8;            /*!< PRI_36                                                                    */
//     } IPR36_b;
//   } ;

//   union {
//     __IOM uint8_t IPR37;                        /*!< Interrupt Priority Register 37                                            */

//     struct {
//       __IOM uint8_t PRI_37      : 8;            /*!< PRI_37                                                                    */
//     } IPR37_b;
//   } ;

//   union {
//     __IOM uint8_t IPR38;                        /*!< Interrupt Priority Register 38                                            */

//     struct {
//       __IOM uint8_t PRI_38      : 8;            /*!< PRI_38                                                                    */
//     } IPR38_b;
//   } ;

//   union {
//     __IOM uint8_t IPR39;                        /*!< Interrupt Priority Register 39                                            */

//     struct {
//       __IOM uint8_t PRI_39      : 8;            /*!< PRI_39                                                                    */
//     } IPR39_b;
//   } ;

//   union {
//     __IOM uint8_t IPR40;                        /*!< Interrupt Priority Register 40                                            */

//     struct {
//       __IOM uint8_t PRI_40      : 8;            /*!< PRI_40                                                                    */
//     } IPR40_b;
//   } ;

//   union {
//     __IOM uint8_t IPR41;                        /*!< Interrupt Priority Register 41                                            */

//     struct {
//       __IOM uint8_t PRI_41      : 8;            /*!< PRI_41                                                                    */
//     } IPR41_b;
//   } ;

//   union {
//     __IOM uint8_t IPR42;                        /*!< Interrupt Priority Register 42                                            */

//     struct {
//       __IOM uint8_t PRI_42      : 8;            /*!< PRI_42                                                                    */
//     } IPR42_b;
//   } ;

//   union {
//     __IOM uint8_t IPR43;                        /*!< Interrupt Priority Register 43                                            */

//     struct {
//       __IOM uint8_t PRI_43      : 8;            /*!< PRI_43                                                                    */
//     } IPR43_b;
//   } ;

//   union {
//     __IOM uint8_t IPR44;                        /*!< Interrupt Priority Register 44                                            */

//     struct {
//       __IOM uint8_t PRI_44      : 8;            /*!< PRI_44                                                                    */
//     } IPR44_b;
//   } ;

//   union {
//     __IOM uint8_t IPR45;                        /*!< Interrupt Priority Register 45                                            */

//     struct {
//       __IOM uint8_t PRI_45      : 8;            /*!< PRI_45                                                                    */
//     } IPR45_b;
//   } ;

//   union {
//     __IOM uint8_t IPR46;                        /*!< Interrupt Priority Register 46                                            */

//     struct {
//       __IOM uint8_t PRI_46      : 8;            /*!< PRI_46                                                                    */
//     } IPR46_b;
//   } ;

//   union {
//     __IOM uint8_t IPR47;                        /*!< Interrupt Priority Register 47                                            */

//     struct {
//       __IOM uint8_t PRI_47      : 8;            /*!< PRI_47                                                                    */
//     } IPR47_b;
//   } ;

//   union {
//     __IOM uint8_t IPR48;                        /*!< Interrupt Priority Register 48                                            */

//     struct {
//       __IOM uint8_t PRI_48      : 8;            /*!< PRI_48                                                                    */
//     } IPR48_b;
//   } ;

//   union {
//     __IOM uint8_t IPR49;                        /*!< Interrupt Priority Register 49                                            */

//     struct {
//       __IOM uint8_t PRI_49      : 8;            /*!< PRI_49                                                                    */
//     } IPR49_b;
//   } ;

//   union {
//     __IOM uint8_t IPR50;                        /*!< Interrupt Priority Register 50                                            */

//     struct {
//       __IOM uint8_t PRI_50      : 8;            /*!< PRI_50                                                                    */
//     } IPR50_b;
//   } ;

//   union {
//     __IOM uint8_t IPR51;                        /*!< Interrupt Priority Register 51                                            */

//     struct {
//       __IOM uint8_t PRI_51      : 8;            /*!< PRI_51                                                                    */
//     } IPR51_b;
//   } ;

//   union {
//     __IOM uint8_t IPR52;                        /*!< Interrupt Priority Register 52                                            */

//     struct {
//       __IOM uint8_t PRI_52      : 8;            /*!< PRI_52                                                                    */
//     } IPR52_b;
//   } ;

//   union {
//     __IOM uint8_t IPR53;                        /*!< Interrupt Priority Register 53                                            */

//     struct {
//       __IOM uint8_t PRI_53      : 8;            /*!< PRI_53                                                                    */
//     } IPR53_b;
//   } ;

//   union {
//     __IOM uint8_t IPR54;                        /*!< Interrupt Priority Register 54                                            */

//     struct {
//       __IOM uint8_t PRI_54      : 8;            /*!< PRI_54                                                                    */
//     } IPR54_b;
//   } ;

//   union {
//     __IOM uint8_t IPR55;                        /*!< Interrupt Priority Register 55                                            */

//     struct {
//       __IOM uint8_t PRI_55      : 8;            /*!< PRI_55                                                                    */
//     } IPR55_b;
//   } ;

//   union {
//     __IOM uint8_t IPR56;                        /*!< Interrupt Priority Register 56                                            */

//     struct {
//       __IOM uint8_t PRI_56      : 8;            /*!< PRI_56                                                                    */
//     } IPR56_b;
//   } ;

//   union {
//     __IOM uint8_t IPR57;                        /*!< Interrupt Priority Register 57                                            */

//     struct {
//       __IOM uint8_t PRI_57      : 8;            /*!< PRI_57                                                                    */
//     } IPR57_b;
//   } ;

//   union {
//     __IOM uint8_t IPR58;                        /*!< Interrupt Priority Register 58                                            */

//     struct {
//       __IOM uint8_t PRI_58      : 8;            /*!< PRI_58                                                                    */
//     } IPR58_b;
//   } ;

//   union {
//     __IOM uint8_t IPR59;                        /*!< Interrupt Priority Register 59                                            */

//     struct {
//       __IOM uint8_t PRI_59      : 8;            /*!< PRI_59                                                                    */
//     } IPR59_b;
//   } ;

//   union {
//     __IOM uint8_t IPR60;                        /*!< Interrupt Priority Register 60                                            */

//     struct {
//       __IOM uint8_t PRI_60      : 8;            /*!< PRI_60                                                                    */
//     } IPR60_b;
//   } ;

//   union {
//     __IOM uint8_t IPR61;                        /*!< Interrupt Priority Register 61                                            */

//     struct {
//       __IOM uint8_t PRI_61      : 8;            /*!< PRI_61                                                                    */
//     } IPR61_b;
//   } ;

//   union {
//     __IOM uint8_t IPR62;                        /*!< Interrupt Priority Register 62                                            */

//     struct {
//       __IOM uint8_t PRI_62      : 8;            /*!< PRI_62                                                                    */
//     } IPR62_b;
//   } ;

//   union {
//     __IOM uint8_t IPR63;                        /*!< Interrupt Priority Register 63                                            */

//     struct {
//       __IOM uint8_t PRI_63      : 8;            /*!< PRI_63                                                                    */
//     } IPR63_b;
//   } ;

//   union {
//     __IOM uint8_t IPR64;                        /*!< Interrupt Priority Register 64                                            */

