RIOT-OS/RIOT/cpu/gd32f3x0/include/gd32f3x0_periph.h
//     struct {
//       __IOM uint8_t PRI_64      : 8;            /*!< PRI_64                                                                    */
//     } IPR64_b;
//   } ;

//   union {
//     __IOM uint8_t IPR65;                        /*!< Interrupt Priority Register 65                                            */

//     struct {
//       __IOM uint8_t PRI_65      : 8;            /*!< PRI_65                                                                    */
//     } IPR65_b;
//   } ;

//   union {
//     __IOM uint8_t IPR66;                        /*!< Interrupt Priority Register 66                                            */

//     struct {
//       __IOM uint8_t PRI_66      : 8;            /*!< PRI_66                                                                    */
//     } IPR66_b;
//   } ;

//   union {
//     __IOM uint8_t IPR67;                        /*!< Interrupt Priority Register 67                                            */

//     struct {
//       __IOM uint8_t PRI_67      : 8;            /*!< PRI_67                                                                    */
//     } IPR67_b;
//   } ;

//   union {
//     __IOM uint8_t IPR68;                        /*!< Interrupt Priority Register 68                                            */

//     struct {
//       __IOM uint8_t PRI_68      : 8;            /*!< PRI_68                                                                    */
//     } IPR68_b;
//   } ;

//   union {
//     __IOM uint8_t IPR69;                        /*!< Interrupt Priority Register 69                                            */

//     struct {
//       __IOM uint8_t PRI_69      : 8;            /*!< PRI_69                                                                    */
//     } IPR69_b;
//   } ;

//   union {
//     __IOM uint8_t IPR70;                        /*!< Interrupt Priority Register 70                                            */

//     struct {
//       __IOM uint8_t PRI_70      : 8;            /*!< PRI_70                                                                    */
//     } IPR70_b;
//   } ;

//   union {
//     __IOM uint8_t IPR71;                        /*!< Interrupt Priority Register 71                                            */

//     struct {
//       __IOM uint8_t PRI_71      : 8;            /*!< PRI_71                                                                    */
//     } IPR71_b;
//   } ;

//   union {
//     __IOM uint8_t IPR72;                        /*!< Interrupt Priority Register 72                                            */

//     struct {
//       __IOM uint8_t PRI_72      : 8;            /*!< PRI_72                                                                    */
//     } IPR72_b;
//   } ;

//   union {
//     __IOM uint8_t IPR73;                        /*!< Interrupt Priority Register 73                                            */

//     struct {
//       __IOM uint8_t PRI_73      : 8;            /*!< PRI_73                                                                    */
//     } IPR73_b;
//   } ;
//   __IM  uint16_t  RESERVED5;
//   __IM  uint32_t  RESERVED6[685];

//   union {
//     __OM  uint32_t STIR;                        /*!< Software Trigger Interrupt Register                                       */

//     struct {
//       __OM  uint32_t STIR       : 32;           /*!< STIR                                                                      */
//     } STIR_b;
//   } ;
// } NVIC_Type;                                    /*!< Size = 3588 (0xe04)                                                       */



/* =========================================================================================================================== */
/* ================                                            PMU                                            ================ */
/* =========================================================================================================================== */


/**
  * @brief Power management unit (PMU)
  */

typedef struct {                                /*!< PMU Structure                                                             */

  union {
    __IOM uint32_t CTL;                         /*!< power control register                                                    */

    struct {
      __IOM uint32_t LDOLP      : 1;            /*!< LDO Low Power Mode                                                        */
      __IOM uint32_t STBMOD     : 1;            /*!< Standby Mode                                                              */
      __IOM uint32_t WURST      : 1;            /*!< Wakeup Flag Reset                                                         */
      __IOM uint32_t STBRST     : 1;            /*!< Standby Flag Reset                                                        */
      __IOM uint32_t LVDEN      : 1;            /*!< Low Voltage Detector Enable                                               */
      __IOM uint32_t LVDT       : 3;            /*!< Low Voltage Detector Threshold                                            */
      __IOM uint32_t BKPWEN     : 1;            /*!< Backup Domain Write Enable                                                */
            uint32_t            : 1;
      __IOM uint32_t LDLP       : 1;            /*!< Low-driver mode when use low power LDO                                    */
      __IOM uint32_t LDNP       : 1;            /*!< Low-driver mode when use normal power LDO                                 */
            uint32_t            : 2;
      __IOM uint32_t LDOVS      : 2;            /*!< LDO output voltage select                                                 */
      __IOM uint32_t HDEN       : 1;            /*!< High-driver mode enable                                                   */
      __IOM uint32_t HDS        : 1;            /*!< High-driver mode switch                                                   */
      __IOM uint32_t LDEN       : 2;            /*!< Low-driver mode enable in Deep-sleep mode                                 */
            uint32_t            : 12;
    } CTL_b;
  } ;

  union {
    __IOM uint32_t CS;                          /*!< power control/status register                                             */

