RIOT-OS/RIOT/cpu/gd32f3x0/include/gd32f3x0_periph.h
    struct {
      __IM  uint32_t WUF        : 1;            /*!< Wakeup flag                                                               */
      __IM  uint32_t STBF       : 1;            /*!< Standby flag                                                              */
      __IM  uint32_t LVDF       : 1;            /*!< Low Voltage Detector Status Flag                                          */
            uint32_t            : 5;
      __IOM uint32_t WUPEN0     : 1;            /*!< WKUP pin0 Enable                                                          */
      __IOM uint32_t WUPEN1     : 1;            /*!< WKUP pin1 Enable                                                          */
            uint32_t            : 2;
      __IOM uint32_t WUPEN4     : 1;            /*!< WKUP pin4 Enable                                                          */
      __IOM uint32_t WUPEN5     : 1;            /*!< WKUP pin5 Enable                                                          */
      __IOM uint32_t WUPEN6     : 1;            /*!< WKUP pin6 Enable                                                          */
      __IOM uint32_t LDOVSRF    : 1;            /*!< LDO voltage select ready flag                                             */
      __IOM uint32_t HDRF       : 1;            /*!< High-driver ready flag                                                    */
      __IOM uint32_t HDSRF      : 1;            /*!< High-driver switch ready flag                                             */
      __IOM uint32_t LDRF       : 2;            /*!< Low-driver mode ready flag                                                */
            uint32_t            : 12;
    } CS_b;
  } ;
} PMU_Type;                                     /*!< Size = 8 (0x8)                                                            */



/* =========================================================================================================================== */
/* ================                                            RCU                                            ================ */
/* =========================================================================================================================== */


/**
  * @brief Reset and clock unit (RCU)
  */

typedef struct {                                /*!< RCU Structure                                                             */

  union {
    __IOM uint32_t CTL0;                        /*!< Control register 0                                                        */

    struct {
      __IOM uint32_t IRC8MEN    : 1;            /*!< Internal High Speed oscillator Enable                                     */
      __IM  uint32_t IRC8MSTB   : 1;            /*!< IRC8M High Speed Internal Oscillator stabilization Flag                   */
            uint32_t            : 1;
      __IOM uint32_t IRC8MADJ   : 5;            /*!< High Speed Internal Oscillator clock trim adjust value                    */
      __IM  uint32_t IRC8MCALIB : 8;            /*!< High Speed Internal Oscillator calibration value register                 */
      __IOM uint32_t HXTALEN    : 1;            /*!< External High Speed oscillator Enable                                     */
      __IM  uint32_t HXTALSTB   : 1;            /*!< External crystal oscillator (HXTAL) clock stabilization flag              */
      __IOM uint32_t HXTALBPS   : 1;            /*!< External crystal oscillator (HXTAL) clock bypass mode enable              */
      __IOM uint32_t CKMEN      : 1;            /*!< HXTAL Clock Monitor Enable                                                */
            uint32_t            : 4;
      __IOM uint32_t PLLEN      : 1;            /*!< PLL enable                                                                */
      __IM  uint32_t PLLSTB     : 1;            /*!< PLL Clock Stabilization Flag                                              */
            uint32_t            : 6;
    } CTL0_b;
  } ;

  union {
    __IOM uint32_t CFG0;                        /*!< Clock configuration register 0 (RCU_CFG0)                                 */

    struct {
      __IOM uint32_t SCS        : 2;            /*!< System clock switch                                                       */
      __IM  uint32_t SCSS       : 2;            /*!< System clock switch status                                                */
      __IOM uint32_t AHBPSC     : 4;            /*!< AHB prescaler selection                                                   */
      __IOM uint32_t APB1PSC    : 3;            /*!< APB1 prescaler selection                                                  */
      __IOM uint32_t APB2PSC    : 3;            /*!< APB2 prescaler selection                                                  */
      __IOM uint32_t ADCPSC     : 2;            /*!< ADC clock prescaler selection                                             */
      __IOM uint32_t PLLSEL     : 1;            /*!< PLL Clock Source Selection                                                */
      __IOM uint32_t PLLPREDV   : 1;            /*!< HXTAL divider for PLL source clock selection.                             */
      __IOM uint32_t PLLMF      : 4;            /*!< PLL multiply factor                                                       */
      __IOM uint32_t USBFSPSC   : 2;            /*!< USBFS clock prescaler selection                                           */
      __IOM uint32_t CKOUTSEL   : 3;            /*!< CK_OUT Clock Source Selection                                             */
      __IOM uint32_t PLLMF_MSB  : 1;            /*!< Bit 4 of PLLMF register                                                   */
      __IOM uint32_t CKOUTDIV   : 3;            /*!< The CK_OUT divider which the CK_OUT frequency can be reduced              */
      __IOM uint32_t PLLDV      : 1;            /*!< The CK_PLL divide by 1 or 2 for CK_OUT                                    */
    } CFG0_b;
  } ;

  union {
    __IOM uint32_t INT;                         /*!< Clock interrupt register (RCU_INT)                                        */

