RIOT-OS/RIOT/cpu/gd32f3x0/include/gd32f3x0_periph.h
    struct {
      __IOM uint32_t IRC40KEN   : 1;            /*!< IRC40K enable                                                             */
      __IM  uint32_t IRC40KSTB  : 1;            /*!< IRC40K stabilization                                                      */
            uint32_t            : 21;
      __IOM uint32_t V12RSTF    : 1;            /*!< V12 domain Power reset flag                                               */
      __IOM uint32_t RSTFC      : 1;            /*!< Reset flag clear                                                          */
      __IOM uint32_t OBLRSTF    : 1;            /*!< Option byte loader reset flag                                             */
      __IOM uint32_t EPRSTF     : 1;            /*!< External PIN reset flag                                                   */
      __IOM uint32_t PORRSTF    : 1;            /*!< Power reset flag                                                          */
      __IOM uint32_t SWRSTF     : 1;            /*!< Software reset flag                                                       */
      __IOM uint32_t FWDGTRSTF  : 1;            /*!< Free Watchdog timer reset flag                                            */
      __IOM uint32_t WWDGTRSTF  : 1;            /*!< Window watchdog timer reset flag                                          */
      __IOM uint32_t LPRSTF     : 1;            /*!< Low-power reset flag                                                      */
    } RSTSCK_b;
  } ;

  union {
    __IOM uint32_t AHBRST;                      /*!< AHB reset register                                                        */

    struct {
            uint32_t            : 12;
      __IOM uint32_t USBFSRST   : 1;            /*!< USBFS unit reset                                                          */
            uint32_t            : 4;
      __IOM uint32_t PARST      : 1;            /*!< GPIO port A reset                                                         */
      __IOM uint32_t PBRST      : 1;            /*!< GPIO port B reset                                                         */
      __IOM uint32_t PCRST      : 1;            /*!< GPIO port C reset                                                         */
      __IOM uint32_t PDRST      : 1;            /*!< GPIO port D reset                                                         */
            uint32_t            : 1;
      __IOM uint32_t PFRST      : 1;            /*!< GPIO port F reset                                                         */
            uint32_t            : 1;
      __IOM uint32_t TSIRST     : 1;            /*!< TSI unit reset                                                            */
            uint32_t            : 7;
    } AHBRST_b;
  } ;

  union {
    __IOM uint32_t CFG1;                        /*!< Configuration register 1                                                  */

    struct {
      __IOM uint32_t PREDV      : 4;            /*!< CK_HXTAL or CK_IRC48M divider previous PLL                                */
            uint32_t            : 26;
      __IOM uint32_t PLLPRESEL  : 1;            /*!< PLL clock source preselection                                             */
      __IOM uint32_t PLLMF      : 1;            /*!< Bit 5 of PLLMF                                                            */
    } CFG1_b;
  } ;

  union {
    __IOM uint32_t CFG2;                        /*!< Configuration register 2                                                  */

    struct {
      __IOM uint32_t USART0SEL  : 2;            /*!< CK_USART0 clock source selection                                          */
            uint32_t            : 4;
      __IOM uint32_t CECSEL     : 1;            /*!< CK_CEC clock source selection                                             */
            uint32_t            : 1;
      __IOM uint32_t ADCSEL     : 1;            /*!< CK_ADC clock source selection                                             */
            uint32_t            : 7;
      __IOM uint32_t IRC28MDIV  : 1;            /*!< CK_IRC28M divider 2 or not                                                */
            uint32_t            : 13;
      __IOM uint32_t USBFSPSC   : 1;            /*!< Bit 2 of USBFSPSC                                                         */
      __IOM uint32_t ADCPSC     : 1;            /*!< Bit 2 of ADCPSC                                                           */
    } CFG2_b;
  } ;

  union {
    __IOM uint32_t CTL1;                        /*!< Control register 1                                                        */

    struct {
      __IOM uint32_t IRC28MEN   : 1;            /*!< IRC28M Internal 28M RC oscillator Enable                                  */
      __IM  uint32_t IRC28MSTB  : 1;            /*!< IRC28M Internal 28M RC Oscillator stabilization Flag                      */
            uint32_t            : 1;
      __IOM uint32_t IRC28MADJ  : 5;            /*!< Internal 28M RC Oscillator clock trim adjust value                        */
      __IM  uint32_t IRC28MCALIB : 8;           /*!< Internal 28M RC Oscillator calibration value register                     */
            uint32_t            : 16;
    } CTL1_b;
  } ;
  __IM  uint32_t  RESERVED[34];

  union {
    __IOM uint32_t ADDCTL;                      /*!< Additional clock control register                                         */

    struct {
      __IOM uint32_t CK48MSEL   : 1;            /*!< 48MHz clock selection                                                     */
            uint32_t            : 15;
      __IOM uint32_t IRC48MEN   : 1;            /*!< Internal 48MHz RC oscillator enable                                       */
      __IOM uint32_t IRC48MSTB  : 1;            /*!< Internal 48MHz RC oscillator clock stabilization Flag                     */
            uint32_t            : 6;
      __IOM uint32_t IRC48MCALIB : 8;           /*!< Internal 48MHz RC oscillator calibration value register                   */
    } ADDCTL_b;
  } ;
  __IM  uint32_t  RESERVED1[2];

  union {
    __IOM uint32_t ADDINT;                      /*!< Additional clock interrupt register                                       */

