RIOT-OS/RIOT/cpu/gd32f3x0/include/gd32f3x0_periph.h
    struct {
            uint32_t            : 6;
      __IM  uint32_t IRC48MSTBIF : 1;           /*!< IRC48M stabilization interrupt flag                                       */
            uint32_t            : 7;
      __IOM uint32_t IRC48MSTBIE : 1;           /*!< Internal 48 MHz RC oscillator Stabilization Interrupt Enable              */
            uint32_t            : 7;
      __IOM uint32_t IRC48MSTBIC : 1;           /*!< Internal 48 MHz RC oscillator Stabilization Interrupt Clear               */
            uint32_t            : 9;
    } ADDINT_b;
  } ;
  __IM  uint32_t  RESERVED2[10];

  union {
    __IOM uint32_t ADDAPB1EN;                   /*!< APB1 additional enable register                                           */

    struct {
            uint32_t            : 27;
      __IOM uint32_t CTCEN      : 1;            /*!< CTC clock enable                                                          */
            uint32_t            : 4;
    } ADDAPB1EN_b;
  } ;

  union {
    __IOM uint32_t ADDAPB1RST;                  /*!< APB1 additional reset register                                            */

    struct {
            uint32_t            : 27;
      __IOM uint32_t CTCRST     : 1;            /*!< CTC reset                                                                 */
            uint32_t            : 4;
    } ADDAPB1RST_b;
  } ;

  union {
    __IOM uint32_t VKEY;                        /*!< Voltage key register                                                      */

    struct {
      __IOM uint32_t KEY        : 32;           /*!< The key of RCU_DSV register                                               */
    } VKEY_b;
  } ;
  __IM  uint32_t  RESERVED3[12];

  union {
    __IOM uint32_t DSV;                         /*!< Deep-sleep mode voltage register                                          */

    struct {
      __IOM uint32_t DSLPVS     : 2;            /*!< Deep-sleep mode voltage select                                            */
            uint32_t            : 30;
    } DSV_b;
  } ;
} RCU_Type;                                     /*!< Size = 312 (0x138)                                                        */



/* =========================================================================================================================== */
/* ================                                            RTC                                            ================ */
/* =========================================================================================================================== */


/**
  * @brief Real-time clock (RTC)
  */

typedef struct {                                /*!< RTC Structure                                                             */

  union {
    __IOM uint32_t TIME;                        /*!< time register                                                             */

    struct {
      __IOM uint32_t SCU        : 4;            /*!< Second units in BCD code                                                  */
      __IOM uint32_t SCT        : 3;            /*!< Second tens in BCD code                                                   */
            uint32_t            : 1;
      __IOM uint32_t MNU        : 4;            /*!< Minute units in BCD code                                                  */
      __IOM uint32_t MNT        : 3;            /*!< Minute tens in BCD code                                                   */
            uint32_t            : 1;
      __IOM uint32_t HRU        : 4;            /*!< Hour units in BCD format                                                  */
      __IOM uint32_t HRT        : 2;            /*!< Hour tens in BCD code                                                     */
      __IOM uint32_t PM         : 1;            /*!< AM/PM mark                                                                */
            uint32_t            : 9;
    } TIME_b;
  } ;

  union {
    __IOM uint32_t DATE;                        /*!< date register                                                             */

    struct {
      __IOM uint32_t DAYU       : 4;            /*!< Date units in BCD code                                                    */
      __IOM uint32_t DAYT       : 2;            /*!< Date tens in BCD code                                                     */
            uint32_t            : 2;
      __IOM uint32_t MONU       : 4;            /*!< Month units in BCD code                                                   */
      __IOM uint32_t MONT       : 1;            /*!< Month tens in BCD code                                                    */
      __IOM uint32_t DOW        : 3;            /*!< Days of the week                                                          */
      __IOM uint32_t YRU        : 4;            /*!< Year units in BCD code                                                    */
      __IOM uint32_t YRT        : 4;            /*!< Year tens in BCD code                                                     */
            uint32_t            : 8;
    } DATE_b;
  } ;

  union {
    __IOM uint32_t CTL;                         /*!< control register                                                          */

    struct {
            uint32_t            : 3;
      __IOM uint32_t TSEG       : 1;            /*!< Time-stamp event active edge                                              */
      __IOM uint32_t REFEN      : 1;            /*!< RTC_REFIN reference clock detection enable (50 or 60 Hz)                  */
      __IOM uint32_t BPSHAD     : 1;            /*!< Bypass the shadow registers                                               */
      __IOM uint32_t CS         : 1;            /*!< Hour format                                                               */
            uint32_t            : 1;
      __IOM uint32_t ALRM0EN    : 1;            /*!< Alarm A enable                                                            */
            uint32_t            : 2;
      __IOM uint32_t TSEN       : 1;            /*!< timestamp enable                                                          */
      __IOM uint32_t ALRM0IE    : 1;            /*!< Alarm A interrupt enable                                                  */
            uint32_t            : 2;
      __IOM uint32_t TSIE       : 1;            /*!< Time-stamp interrupt enable                                               */
      __OM  uint32_t A1H        : 1;            /*!< Add 1 hour (summer time change)                                           */
      __OM  uint32_t S1H        : 1;            /*!< Subtract 1 hour (winter time change)                                      */
      __IOM uint32_t DSM        : 1;            /*!< Backup                                                                    */
      __IOM uint32_t COS        : 1;            /*!< Calibration output selection                                              */
      __IOM uint32_t OPOL       : 1;            /*!< Output polarity                                                           */
      __IOM uint32_t OS         : 2;            /*!< Output selection                                                          */
      __IOM uint32_t COEN       : 1;            /*!< Calibration output enable                                                 */
            uint32_t            : 8;
    } CTL_b;
  } ;

  union {
    __IOM uint32_t STAT;                        /*!< initialization and status register                                        */

