RIOT-OS/RIOT/cpu/gd32f3x0/include/gd32f3x0_periph.h
    struct {
      __IM  uint32_t ALRM0WF    : 1;            /*!< Alarm A write flag                                                        */
            uint32_t            : 2;
      __IOM uint32_t SOPF       : 1;            /*!< Shift operation pending                                                   */
      __IM  uint32_t YCM        : 1;            /*!< Initialization status flag                                                */
      __IOM uint32_t RSYNF      : 1;            /*!< Registers synchronization flag                                            */
      __IM  uint32_t INITF      : 1;            /*!< Initialization flag                                                       */
      __IOM uint32_t INITM      : 1;            /*!< Initialization mode                                                       */
      __IOM uint32_t ALRM0F     : 1;            /*!< Alarm A flag                                                              */
            uint32_t            : 2;
      __IOM uint32_t TSF        : 1;            /*!< Time-stamp flag                                                           */
      __IOM uint32_t TSOVRF     : 1;            /*!< Time-stamp overflow flag                                                  */
      __IOM uint32_t TP0F       : 1;            /*!< RTC_TAMP0 detection flag                                                  */
      __IOM uint32_t TP1F       : 1;            /*!< RTC_TAMP1 detection flag                                                  */
            uint32_t            : 1;
      __IM  uint32_t SCPF       : 1;            /*!< Recalibration pending Flag                                                */
            uint32_t            : 15;
    } STAT_b;
  } ;

  union {
    __IOM uint32_t PSC;                         /*!< prescaler register                                                        */

    struct {
      __IOM uint32_t FACTOR_S   : 15;           /*!< Synchronous prescaler factor                                              */
            uint32_t            : 1;
      __IOM uint32_t FACTOR_A   : 7;            /*!< Asynchronous prescaler factor                                             */
            uint32_t            : 9;
    } PSC_b;
  } ;
  __IM  uint32_t  RESERVED[2];

  union {
    __IOM uint32_t ALRM0TD;                     /*!< alarm A register                                                          */

    struct {
      __IOM uint32_t SCU        : 4;            /*!< Second units in BCD format.                                               */
      __IOM uint32_t SCT        : 3;            /*!< Second tens in BCD format.                                                */
      __IOM uint32_t MSKS       : 1;            /*!< Alarm seconds mask                                                        */
      __IOM uint32_t MNU        : 4;            /*!< Minute units in BCD format.                                               */
      __IOM uint32_t MNT        : 3;            /*!< Minute tens in BCD format.                                                */
      __IOM uint32_t MSKM       : 1;            /*!< Alarm minutes mask                                                        */
      __IOM uint32_t HRU        : 4;            /*!< Hour units in BCD format.                                                 */
      __IOM uint32_t HRT        : 2;            /*!< Hour tens in BCD format.                                                  */
      __IOM uint32_t PM         : 1;            /*!< AM/PM notation                                                            */
      __IOM uint32_t MSKH       : 1;            /*!< Alarm hours mask                                                          */
      __IOM uint32_t DAYU       : 4;            /*!< Date units or day in BCD format.                                          */
      __IOM uint32_t DAYT       : 2;            /*!< Date tens in BCD format.                                                  */
      __IOM uint32_t DOWS       : 1;            /*!< Week day selection                                                        */
      __IOM uint32_t MSKD       : 1;            /*!< Alarm date mask                                                           */
    } ALRM0TD_b;
  } ;
  __IM  uint32_t  RESERVED1;

  union {
    __OM  uint32_t WPK;                         /*!< write protection register                                                 */

    struct {
      __OM  uint32_t WPK        : 8;            /*!< Write protection key                                                      */
            uint32_t            : 24;
    } WPK_b;
  } ;

  union {
    __IM  uint32_t SS;                          /*!< sub second register                                                       */

    struct {
      __IM  uint32_t SSC        : 16;           /*!< Sub second value                                                          */
            uint32_t            : 16;
    } SS_b;
  } ;

  union {
    __OM  uint32_t SHIFTCTL;                    /*!< shift control register                                                    */

    struct {
      __OM  uint32_t SFS        : 15;           /*!< Subtract a fraction of a second                                           */
            uint32_t            : 16;
      __OM  uint32_t A1S        : 1;            /*!< One second add                                                            */
    } SHIFTCTL_b;
  } ;

  union {
    __IM  uint32_t TTS;                         /*!< timestamp time register                                                   */

    struct {
      __IM  uint32_t SCU        : 4;            /*!< Second units in BCD code                                                  */
      __IM  uint32_t SCT        : 3;            /*!< Second tens in BCD code                                                   */
            uint32_t            : 1;
      __IM  uint32_t MNU        : 4;            /*!< Minute units in BCD code                                                  */
      __IM  uint32_t MNT        : 3;            /*!< Minute tens in BCD code                                                   */
            uint32_t            : 1;
      __IM  uint32_t HRU        : 4;            /*!< Hour units in BCD code                                                    */
      __IM  uint32_t HRT        : 2;            /*!< Hour tens in BCD code                                                     */
      __IM  uint32_t PM         : 1;            /*!< AM/PM mark                                                                */
            uint32_t            : 9;
    } TTS_b;
  } ;

  union {
    __IM  uint32_t DTS;                         /*!< Date of time stamp register                                               */

