RIOT-OS/RIOT/cpu/gd32f3x0/include/gd32f3x0_periph.h
    struct {
      __IOM uint32_t DATA       : 32;           /*!< BKP data                                                                  */
    } BKP4_b;
  } ;
} RTC_Type;                                     /*!< Size = 100 (0x64)                                                         */



/* =========================================================================================================================== */
/* ================                                           SPI0                                            ================ */
/* =========================================================================================================================== */


/**
  * @brief Serial peripheral interface (SPI0)
  */

typedef struct {                                /*!< SPI0 Structure                                                            */

  union {
    __IOM uint32_t CTL0;                        /*!< control register 0                                                        */

    struct {
      __IOM uint32_t CKPH       : 1;            /*!< Clock Phase Selection                                                     */
      __IOM uint32_t CKPL       : 1;            /*!< Clock Polarity Selection                                                  */
      __IOM uint32_t MSTMOD     : 1;            /*!< Master Mode Enable                                                        */
      __IOM uint32_t PSC        : 3;            /*!< Master Clock Prescaler Selection                                          */
      __IOM uint32_t SPIEN      : 1;            /*!< SPI enable                                                                */
      __IOM uint32_t LF         : 1;            /*!< LSB First Mode                                                            */
      __IOM uint32_t SWNSS      : 1;            /*!< NSS Pin Selection In NSS Software Mode                                    */
      __IOM uint32_t SWNSSEN    : 1;            /*!< NSS Software Mode Selection                                               */
      __IOM uint32_t RO         : 1;            /*!< Receive only                                                              */
      __IOM uint32_t FF16       : 1;            /*!< Data frame format                                                         */
      __IOM uint32_t CRCNT      : 1;            /*!< CRC transfer next                                                         */
      __IOM uint32_t CRCEN      : 1;            /*!< Hardware CRC calculation enable                                           */
      __IOM uint32_t BDOEN      : 1;            /*!< Bidirectional Transmit output enable                                      */
      __IOM uint32_t BDEN       : 1;            /*!< Bidirectional enable                                                      */
            uint32_t            : 16;
    } CTL0_b;
  } ;

  union {
    __IOM uint32_t CTL1;                        /*!< control register 1                                                        */

    struct {
      __IOM uint32_t DMAREN     : 1;            /*!< Rx buffer DMA enable                                                      */
      __IOM uint32_t DMATEN     : 1;            /*!< Tx buffer DMA enable                                                      */
      __IOM uint32_t NSSDRV     : 1;            /*!< NSS output enable                                                         */
      __IOM uint32_t NSSP       : 1;            /*!< SPI NSS Pulse Mode Enable                                                 */
      __IOM uint32_t TMOD       : 1;            /*!< SPI TI Mode Enable                                                        */
      __IOM uint32_t ERRIE      : 1;            /*!< Error interrupt enable                                                    */
      __IOM uint32_t RBNEIE     : 1;            /*!< Receive Buffer Not Empty Interrupt Enable                                 */
      __IOM uint32_t TBEIE      : 1;            /*!< Transmit Buffer Empty Interrupt Enable                                    */
            uint32_t            : 24;
    } CTL1_b;
  } ;

  union {
    __IOM uint32_t STAT;                        /*!< status register                                                           */

    struct {
      __IM  uint32_t RBNE       : 1;            /*!< Receive Buffer Not Empty                                                  */
      __IM  uint32_t TBE        : 1;            /*!< Transmit Buffer Empty                                                     */
      __IM  uint32_t I2SCH      : 1;            /*!< I2S channel side                                                          */
      __IM  uint32_t TXURERR    : 1;            /*!< Transmission underrun error bit                                           */
      __IOM uint32_t CRCERR     : 1;            /*!< SPI CRC Error Bit                                                         */
      __IM  uint32_t CONFERR    : 1;            /*!< SPI Configuration error                                                   */
      __IM  uint32_t RXORERR    : 1;            /*!< Reception Overrun Error Bit                                               */
      __IM  uint32_t TRANS      : 1;            /*!< Transmitting On-going Bit                                                 */
      __IM  uint32_t FERR       : 1;            /*!< Format Error                                                              */
            uint32_t            : 23;
    } STAT_b;
  } ;

  union {
    __IOM uint32_t DATA;                        /*!< data register                                                             */

    struct {
      __IOM uint32_t DATA       : 16;           /*!< Data register                                                             */
            uint32_t            : 16;
    } DATA_b;
  } ;

  union {
    __IOM uint32_t CPCPOLY;                     /*!< CRC polynomial register                                                   */

