RIOT-OS/RIOT/cpu/gd32f3x0/include/gd32f3x0_periph.h
    struct {
      __IOM uint32_t CPR        : 16;           /*!< CRC polynomial register                                                   */
            uint32_t            : 16;
    } CPCPOLY_b;
  } ;

  union {
    __IM  uint32_t RCRC;                        /*!< RX CRC register                                                           */

    struct {
      __IM  uint32_t RCR        : 16;           /*!< RX RCR register                                                           */
            uint32_t            : 16;
    } RCRC_b;
  } ;

  union {
    __IM  uint32_t TCRC;                        /*!< TX CRC register                                                           */

    struct {
      __IM  uint32_t TCR        : 16;           /*!< Tx CRC register                                                           */
            uint32_t            : 16;
    } TCRC_b;
  } ;

  union {
    __IOM uint32_t I2SCTL;                      /*!< I2S configuration register                                                */

    struct {
      __IOM uint32_t CHLEN      : 1;            /*!< Channel length (number of bits per audio channel)                         */
      __IOM uint32_t DTLEN      : 2;            /*!< Data length to be transferred                                             */
      __IOM uint32_t CKPL       : 1;            /*!< Idle state clock polarity                                                 */
      __IOM uint32_t I2SSTD     : 2;            /*!< I2S standard selection                                                    */
            uint32_t            : 1;
      __IOM uint32_t PCMSMOD    : 1;            /*!< PCM frame synchronization                                                 */
      __IOM uint32_t I2SOPMOD   : 2;            /*!< I2S configuration mode                                                    */
      __IOM uint32_t I2SEN      : 1;            /*!< I2S Enable                                                                */
      __IOM uint32_t I2SSEL     : 1;            /*!< I2S mode selection                                                        */
            uint32_t            : 20;
    } I2SCTL_b;
  } ;

  union {
    __IOM uint32_t I2SPSC;                      /*!< I2S prescaler register                                                    */

    struct {
      __IOM uint32_t DIV        : 8;            /*!< Dividing factor for the prescaler                                         */
      __IOM uint32_t OF         : 1;            /*!< Odd factor for the prescaler                                              */
      __IOM uint32_t MCKOEN     : 1;            /*!< I2S_MCK output enable                                                     */
            uint32_t            : 22;
    } I2SPSC_b;
  } ;
  __IM  uint32_t  RESERVED[23];

  union {
    __IOM uint32_t QCTL;                        /*!< SPI quad wird control register                                            */

    struct {
      __IOM uint32_t QMOD       : 1;            /*!< Quad wire mode enable                                                     */
      __IOM uint32_t QRD        : 1;            /*!< Quad wire read select                                                     */
      __IOM uint32_t IO23_DRV   : 1;            /*!< Drive IO2 and IO3 enable                                                  */
            uint32_t            : 29;
    } QCTL_b;
  } ;
} SPI_Type;                                    /*!< Size = 132 (0x84)                                                         */



/* =========================================================================================================================== */
/* ================                                          SYSCFG                                           ================ */
/* =========================================================================================================================== */


/**
  * @brief System configuration controller (SYSCFG)
  */

typedef struct {                                /*!< SYSCFG Structure                                                          */

  union {
    __IOM uint32_t CFG0;                        /*!< System configuration register 0                                           */

    struct {
      __IM  uint32_t BOOT_MODE  : 2;            /*!< Boot mode                                                                 */
            uint32_t            : 6;
      __IOM uint32_t ADC_DMA_RMP : 1;           /*!< ADC DMA request remapping enable                                          */
      __IOM uint32_t USART0_TX_DMA_RMP : 1;     /*!< USART0_TX DMA request remapping enable                                    */
      __IOM uint32_t USART0_RX_DMA_RMP : 1;     /*!< USART0_RX DMA request remapping enable                                    */
      __IOM uint32_t TIMER15_DMA_RMP : 1;       /*!< Timer 15 DMA request remapping enable                                     */
      __IOM uint32_t TIMER16_DMA_RMP : 1;       /*!< Timer 16 DMA request remapping enable                                     */
            uint32_t            : 6;
      __IOM uint32_t PB9_HCCE   : 1;            /*!< PB9 pin high current capability enable                                    */
            uint32_t            : 12;
    } CFG0_b;
  } ;
  __IM  uint32_t  RESERVED;

  union {
    __IOM uint32_t EXTISS0;                     /*!< EXTI sources selection register 0                                         */

    struct {
      __IOM uint32_t EXTI0_SS   : 4;            /*!< EXTI 0 sources selection                                                  */
      __IOM uint32_t EXTI1_SS   : 4;            /*!< EXTI 1 sources selection                                                  */
      __IOM uint32_t EXTI2_SS   : 4;            /*!< EXTI 2 sources selection                                                  */
      __IOM uint32_t EXTI3_SS   : 4;            /*!< EXTI 3 sources selection                                                  */
            uint32_t            : 16;
    } EXTISS0_b;
  } ;

  union {
    __IOM uint32_t EXTISS1;                     /*!< EXTI sources selection register 1                                         */

