RIOT-OS/RIOT/cpu/gd32f3x0/include/gd32f3x0_periph.h
    struct {
      __IOM uint32_t EXTI4_SS   : 4;            /*!< EXTI 4 sources selection                                                  */
      __IOM uint32_t EXTI5_SS   : 4;            /*!< EXTI 5 sources selection                                                  */
      __IOM uint32_t EXTI6_SS   : 4;            /*!< EXTI 6 sources selection                                                  */
      __IOM uint32_t EXTI7_SS   : 4;            /*!< EXTI 7 sources selection                                                  */
            uint32_t            : 16;
    } EXTISS1_b;
  } ;

  union {
    __IOM uint32_t EXTISS2;                     /*!< EXTI sources selection register 2                                         */

    struct {
      __IOM uint32_t EXTI8_SS   : 4;            /*!< EXTI 8 sources selection                                                  */
      __IOM uint32_t EXTI9_SS   : 4;            /*!< EXTI 9 sources selection                                                  */
      __IOM uint32_t EXTI10_SS  : 4;            /*!< EXTI 10 sources selection                                                 */
      __IOM uint32_t EXTI11_SS  : 4;            /*!< EXTI 11 sources selection                                                 */
            uint32_t            : 16;
    } EXTISS2_b;
  } ;

  union {
    __IOM uint32_t EXTISS3;                     /*!< EXTI sources selection register 3                                         */

    struct {
      __IOM uint32_t EXTI12_SS  : 4;            /*!< EXTI 12 sources selection                                                 */
      __IOM uint32_t EXTI13_SS  : 4;            /*!< EXTI 13 sources selection                                                 */
      __IOM uint32_t EXTI14_SS  : 4;            /*!< EXTI 14 sources selection                                                 */
      __IOM uint32_t EXTI15_SS  : 4;            /*!< EXTI 15 sources selection                                                 */
            uint32_t            : 16;
    } EXTISS3_b;
  } ;

  union {
    __IOM uint32_t CFG2;                        /*!< System configuration register 2                                           */

    struct {
      __IOM uint32_t LOCKUP_LOCK : 1;           /*!< Cortex-M4 LOCKUP output lock                                              */
      __IOM uint32_t SRAM_PARITY_ERROR_LOCK : 1;/*!< SRAM parity check error lock                                              */
      __IOM uint32_t LVD_LOCK   : 1;            /*!< LVD lock                                                                  */
            uint32_t            : 5;
      __IOM uint32_t SRAM_PCEF  : 1;            /*!< SRAM parity check error flag                                              */
            uint32_t            : 23;
    } CFG2_b;
  } ;
  __IM  uint32_t  RESERVED1;

  union {
    __IOM uint32_t CPSCTL;                      /*!< I/O compensation control register                                         */

    struct {
      __IOM uint32_t CPS_EN     : 1;            /*!< I/O compensation cell enable                                              */
            uint32_t            : 7;
      __IOM uint32_t CPS_RDY    : 1;            /*!< I/O compensation cell is ready                                            */
            uint32_t            : 23;
    } CPSCTL_b;
  } ;
} SYSCFG_Type;                                  /*!< Size = 36 (0x24)                                                          */



/* =========================================================================================================================== */
/* ================                                          TIMER0                                           ================ */
/* =========================================================================================================================== */


/**
  * @brief Advanced-timers (TIMER0)
  */

typedef struct {                                /*!< TIMER0 Structure                                                          */

  union {
    __IOM uint32_t CTL0;                        /*!< control register 0                                                        */

    struct {
      __IOM uint32_t CEN        : 1;            /*!< Counter enable                                                            */
      __IOM uint32_t UPDIS      : 1;            /*!< Update disable                                                            */
      __IOM uint32_t UPS        : 1;            /*!< Update request source                                                     */
      __IOM uint32_t SPM        : 1;            /*!< One-pulse mode                                                            */
      __IOM uint32_t DIR        : 1;            /*!< Direction                                                                 */
      __IOM uint32_t CAM        : 2;            /*!< Center-aligned mode selection                                             */
      __IOM uint32_t ARSE       : 1;            /*!< Auto-reload preload enable                                                */
      __IOM uint32_t CKDIV      : 2;            /*!< Clock division                                                            */
            uint32_t            : 22;
    } CTL0_b;
  } ;

  union {
    __IOM uint32_t CTL1;                        /*!< control register 1                                                        */

    struct {
      __IOM uint32_t CCSE       : 1;            /*!< Commutation control shadow enable                                         */
            uint32_t            : 1;
      __IOM uint32_t CCUC       : 1;            /*!< Commutation control shadow register update control                        */
      __IOM uint32_t DMAS       : 1;            /*!< DMA request source selection                                              */
      __IOM uint32_t MMC        : 3;            /*!< Master mode control                                                       */
      __IOM uint32_t TI0S       : 1;            /*!< Channel 0 trigger input selection                                         */
      __IOM uint32_t ISO0       : 1;            /*!< Idle state of channel 0 output                                            */
      __IOM uint32_t ISO0N      : 1;            /*!< Idle state of channel 0 complementary output                              */
      __IOM uint32_t ISO1       : 1;            /*!< Idle state of channel 1 output                                            */
      __IOM uint32_t ISO1N      : 1;            /*!< Idle state of channel 1 complementary output                              */
      __IOM uint32_t ISO2       : 1;            /*!< Idle state of channel 2 output                                            */
      __IOM uint32_t ISO2N      : 1;            /*!< Idle state of channel 2 complementary output                              */
      __IOM uint32_t ISO3       : 1;            /*!< Idle state of channel 3 output                                            */
            uint32_t            : 17;
    } CTL1_b;
  } ;

  union {
    __IOM uint32_t SMCFG;                       /*!< slave mode configuration register                                         */

