RIOT-OS/RIOT/cpu/gd32f3x0/include/gd32f3x0_periph.h
    struct {
      __IOM uint32_t SMC        : 3;            /*!< Slave mode selection                                                      */
      __IOM uint32_t OCRC       : 1;            /*!< Trigger selection                                                         */
      __IOM uint32_t TRGS       : 3;            /*!< Trigger selection                                                         */
      __IOM uint32_t MSM        : 1;            /*!< Master/Slave mode                                                         */
      __IOM uint32_t ETFC       : 4;            /*!< External trigger filter                                                   */
      __IOM uint32_t ETPSC      : 2;            /*!< External trigger prescaler                                                */
      __IOM uint32_t SMC1       : 1;            /*!< Part of SMC for enable External clock mode1                               */
      __IOM uint32_t ETP        : 1;            /*!< External trigger polarity                                                 */
            uint32_t            : 16;
    } SMCFG_b;
  } ;

  union {
    __IOM uint32_t DMAINTEN;                    /*!< DMA/Interrupt enable register                                             */

    struct {
      __IOM uint32_t UPIE       : 1;            /*!< Update interrupt enable                                                   */
      __IOM uint32_t CH0IE      : 1;            /*!< Capture/Compare 0 interrupt enable                                        */
      __IOM uint32_t CH1IE      : 1;            /*!< Capture/Compare 1 interrupt enable                                        */
      __IOM uint32_t CH2IE      : 1;            /*!< Capture/Compare 2 interrupt enable                                        */
      __IOM uint32_t CH3IE      : 1;            /*!< Capture/Compare 3 interrupt enable                                        */
      __IOM uint32_t CMTIE      : 1;            /*!< COM interrupt enable                                                      */
      __IOM uint32_t TRGIE      : 1;            /*!< Trigger interrupt enable                                                  */
      __IOM uint32_t BRKIE      : 1;            /*!< Break interrupt enable                                                    */
      __IOM uint32_t UPDEN      : 1;            /*!< Update DMA request enable                                                 */
      __IOM uint32_t CH0DEN     : 1;            /*!< Capture/Compare 0 DMA request enable                                      */
      __IOM uint32_t CH1DEN     : 1;            /*!< Capture/Compare 1 DMA request enable                                      */
      __IOM uint32_t CH2DEN     : 1;            /*!< Capture/Compare 2 DMA request enable                                      */
      __IOM uint32_t CH3DEN     : 1;            /*!< Capture/Compare 3 DMA request enable                                      */
      __IOM uint32_t CMTDEN     : 1;            /*!< Reserved                                                                  */
      __IOM uint32_t TRGDEN     : 1;            /*!< Trigger DMA request enable                                                */
            uint32_t            : 17;
    } DMAINTEN_b;
  } ;

  union {
    __IOM uint32_t INTF;                        /*!< status register                                                           */

    struct {
      __IOM uint32_t UPIF       : 1;            /*!< Update interrupt flag                                                     */
      __IOM uint32_t CH0IF      : 1;            /*!< Capture/compare 0 interrupt flag                                          */
      __IOM uint32_t CH1IF      : 1;            /*!< Capture/Compare 1 interrupt flag                                          */
      __IOM uint32_t CH2IF      : 1;            /*!< Capture/Compare 2 interrupt flag                                          */
      __IOM uint32_t CH3IF      : 1;            /*!< Capture/Compare 3 interrupt flag                                          */
      __IOM uint32_t CMTIF      : 1;            /*!< COM interrupt flag                                                        */
      __IOM uint32_t TRGIF      : 1;            /*!< Trigger interrupt flag                                                    */
      __IOM uint32_t BRKIF      : 1;            /*!< Break interrupt flag                                                      */
            uint32_t            : 1;
      __IOM uint32_t CH0OF      : 1;            /*!< Channel 0 over capture flag                                               */
      __IOM uint32_t CH1OF      : 1;            /*!< Channel 1 over capture flag                                               */
      __IOM uint32_t CH2OF      : 1;            /*!< Channel 2 over capture flag                                               */
      __IOM uint32_t CH3OF      : 1;            /*!< Channel 3 over capture flag                                               */
            uint32_t            : 19;
    } INTF_b;
  } ;

  union {
    __OM  uint32_t SWEVG;                       /*!< Software event generation register                                        */

    struct {
      __OM  uint32_t UPG        : 1;            /*!< Update event generation                                                   */
      __OM  uint32_t CH0G       : 1;            /*!< Channel 0's capture or compare event generation                           */
      __OM  uint32_t CH1G       : 1;            /*!< Channel 1's capture or compare event generation                           */
      __OM  uint32_t CH2G       : 1;            /*!< Channel 2's capture or compare event generation                           */
      __OM  uint32_t CH3G       : 1;            /*!< Channel 3's capture or compare event generation                           */
      __OM  uint32_t CMTG       : 1;            /*!< Channel commutation event generation                                      */
      __OM  uint32_t TRGG       : 1;            /*!< Trigger event generation                                                  */
      __OM  uint32_t BRKG       : 1;            /*!< Break event generation                                                    */
            uint32_t            : 24;
    } SWEVG_b;
  } ;

  union {
    union {
      __IOM uint32_t CHCTL0_Output;             /*!< capture/compare mode register (output mode)                               */

