RIOT-OS/RIOT/cpu/gd32f3x0/include/gd32f3x0_periph.h
      struct {
        __IOM uint32_t CH0MS    : 2;            /*!< Channel 0 I/O mode selection                                              */
        __IOM uint32_t CH0COMFEN : 1;           /*!< Channel 0 output compare fast enable                                      */
        __IOM uint32_t CH0COMSEN : 1;           /*!< Channel 0 compare output shadow enable                                    */
        __IOM uint32_t CH0COMCTL : 3;           /*!< Channel 0 compare output control                                          */
        __IOM uint32_t CH0COMCEN : 1;           /*!< Channel 0 output compare clear enable                                     */
        __IOM uint32_t CH1MS    : 2;            /*!< Channel 1 mode selection                                                  */
        __IOM uint32_t CH1COMFEN : 1;           /*!< Channel 1 output compare fast enable                                      */
        __IOM uint32_t CH1COMSEN : 1;           /*!< Channel 1 output compare shadow enable                                    */
        __IOM uint32_t CH1COMCTL : 3;           /*!< Channel 1 compare output control                                          */
        __IOM uint32_t CH1COMCEN : 1;           /*!< Channel 1 output compare clear enable                                     */
              uint32_t          : 16;
      } CHCTL0_Output_b;
    } ;

    union {
      __IOM uint32_t CHCTL0_Input;              /*!< capture/compare mode register 0 (input mode)                              */

      struct {
        __IOM uint32_t CH0MS    : 2;            /*!< Channel 0 mode selection                                                  */
        __IOM uint32_t CH0CAPPSC : 2;           /*!< Channel 0 input capture prescaler                                         */
        __IOM uint32_t CH0CAPFLT : 4;           /*!< Channel 0 input capture filter control                                    */
        __IOM uint32_t CH1MS    : 2;            /*!< Channel 1 mode selection                                                  */
        __IOM uint32_t CH1CAPPSC : 2;           /*!< Channel 1 input capture prescaler                                         */
        __IOM uint32_t CH1CAPFLT : 4;           /*!< Channel 1 input capture filter control                                    */
              uint32_t          : 16;
      } CHCTL0_Input_b;
    } ;
  };

  union {
    union {
      __IOM uint32_t CHCTL1_Output;             /*!< capture/compare mode register (output mode)                               */

      struct {
        __IOM uint32_t CH2MS    : 2;            /*!< Channel 2 I/O mode selection                                              */
        __IOM uint32_t CH2COMFEN : 1;           /*!< Channel 2 output compare fast enable                                      */
        __IOM uint32_t CH2COMSEN : 1;           /*!< Channel 2 compare output shadow enable                                    */
        __IOM uint32_t CH2COMCTL : 3;           /*!< Channel 2 compare output control                                          */
        __IOM uint32_t CH2COMCEN : 1;           /*!< Channel 2 output compare clear enable                                     */
        __IOM uint32_t CH3MS    : 2;            /*!< Channel 3 mode selection                                                  */
        __IOM uint32_t CH3COMFEN : 1;           /*!< Channel 3 output compare fast enable                                      */
        __IOM uint32_t CH3COMSEN : 1;           /*!< Channel 3 output compare shadow enable                                    */
        __IOM uint32_t CH3COMCTL : 3;           /*!< Channel 3 compare output control                                          */
        __IOM uint32_t CH3COMCEN : 1;           /*!< Channel 3 output compare clear enable                                     */
              uint32_t          : 16;
      } CHCTL1_Output_b;
    } ;

    union {
      __IOM uint32_t CHCTL1_Input;              /*!< capture/compare mode register 1 (input mode)                              */

      struct {
        __IOM uint32_t CH2MS    : 2;            /*!< Capture/compare 2 selection                                               */
        __IOM uint32_t CH2CAPPSC : 2;           /*!< Input capture 2 prescaler                                                 */
        __IOM uint32_t CH2CAPFLT : 4;           /*!< Input capture 2 filter                                                    */
        __IOM uint32_t CH3MS    : 2;            /*!< Channel 3 mode selection                                                  */
        __IOM uint32_t CH3CAPPSC : 2;           /*!< Channel 3 input capture prescaler                                         */
        __IOM uint32_t CH3CAPFLT : 4;           /*!< Channel 3 input capture filter control                                    */
              uint32_t          : 16;
      } CHCTL1_Input_b;
    } ;
  };

  union {
    __IOM uint32_t CHCTL2;                      /*!< capture/compare enable register                                           */

    struct {
      __IOM uint32_t CH0EN      : 1;            /*!< Capture/Compare 1 output enable                                           */
      __IOM uint32_t CH0P       : 1;            /*!< Capture/Compare 0 output Polarity                                         */
      __IOM uint32_t CH0NEN     : 1;            /*!< Capture/Compare 0 complementary output enable                             */
      __IOM uint32_t CH0NP      : 1;            /*!< Capture/Compare 0 output Polarity                                         */
      __IOM uint32_t CH1EN      : 1;            /*!< Capture/Compare 1 output enable                                           */
      __IOM uint32_t CH1P       : 1;            /*!< Capture/Compare 1 output Polarity                                         */
      __IOM uint32_t CH1NEN     : 1;            /*!< Capture/Compare 1 complementary output enable                             */
      __IOM uint32_t CH1NP      : 1;            /*!< Capture/Compare 1 output Polarity                                         */
      __IOM uint32_t CH2EN      : 1;            /*!< Capture/Compare 2 output enable                                           */
      __IOM uint32_t CH2P       : 1;            /*!< Capture/Compare 2 output Polarity                                         */
      __IOM uint32_t CH2NEN     : 1;            /*!< Capture/Compare 2 complementary output enable                             */
      __IOM uint32_t CH2NP      : 1;            /*!< Capture/Compare 2 output Polarity                                         */
      __IOM uint32_t CH3EN      : 1;            /*!< Capture/Compare 3 output enable                                           */
      __IOM uint32_t CH3P       : 1;            /*!< Capture/Compare 3 output Polarity                                         */
            uint32_t            : 18;
    } CHCTL2_b;
  } ;

  union {
    __IOM uint32_t CNT;                         /*!< counter                                                                   */

