RIOT-OS/RIOT/cpu/gd32f3x0/include/gd32f3x0_periph.h
    struct {
      __IOM uint32_t CNT        : 16;           /*!< counter value                                                             */
            uint32_t            : 16;
    } CNT_b;
  } ;

  union {
    __IOM uint32_t PSC;                         /*!< prescaler                                                                 */

    struct {
      __IOM uint32_t PSC        : 16;           /*!< Prescaler value                                                           */
            uint32_t            : 16;
    } PSC_b;
  } ;

  union {
    __IOM uint32_t CAR;                         /*!< auto-reload register                                                      */

    struct {
      __IOM uint32_t CARL       : 16;           /*!< Counter auto reload value                                                 */
            uint32_t            : 16;
    } CAR_b;
  } ;

  union {
    __IOM uint32_t CREP;                        /*!< repetition counter register                                               */

    struct {
      __IOM uint32_t CREP       : 8;            /*!< Repetition counter value                                                  */
            uint32_t            : 24;
    } CREP_b;
  } ;

  union {
    __IOM uint32_t CH0CV;                       /*!< capture/compare register 0                                                */

    struct {
      __IOM uint32_t CH0VAL     : 16;           /*!< Capture/Compare 0 value                                                   */
            uint32_t            : 16;
    } CH0CV_b;
  } ;

  union {
    __IOM uint32_t CH1CV;                       /*!< capture/compare register 1                                                */

    struct {
      __IOM uint32_t CH1VAL     : 16;           /*!< Capture/Compare 1 value                                                   */
            uint32_t            : 16;
    } CH1CV_b;
  } ;

  union {
    __IOM uint32_t CH2CV;                       /*!< capture/compare register 2                                                */

    struct {
      __IOM uint32_t CH2VAL     : 16;           /*!< Capture/Compare 2 value                                                   */
            uint32_t            : 16;
    } CH2CV_b;
  } ;

  union {
    __IOM uint32_t CH3CV;                       /*!< capture/compare register 3                                                */

    struct {
      __IOM uint32_t CH3VAL     : 16;           /*!< Capture/Compare 3 value                                                   */
            uint32_t            : 16;
    } CH3CV_b;
  } ;

  union {
    __IOM uint32_t CCHP;                        /*!< channel complementary protection register                                 */

    struct {
      __IOM uint32_t DTCFG      : 8;            /*!< Dead-time generator setup                                                 */
      __IOM uint32_t PROT       : 2;            /*!< Lock configuration                                                        */
      __IOM uint32_t IOS        : 1;            /*!< Off-state selection for Idle mode                                         */
      __IOM uint32_t ROS        : 1;            /*!< Off-state selection for Run mode                                          */
      __IOM uint32_t BRKEN      : 1;            /*!< Break enable                                                              */
      __IOM uint32_t BRKP       : 1;            /*!< Break polarity                                                            */
      __IOM uint32_t OAEN       : 1;            /*!< Automatic output enable                                                   */
      __IOM uint32_t POEN       : 1;            /*!< Main output enable                                                        */
            uint32_t            : 16;
    } CCHP_b;
  } ;

  union {
    __IOM uint32_t DMACFG;                      /*!< DMA configuration register                                                */

    struct {
      __IOM uint32_t DMATA      : 5;            /*!< DMA transfer access start address                                         */
            uint32_t            : 3;
      __IOM uint32_t DMATC      : 5;            /*!< DMA transfer count                                                        */
            uint32_t            : 19;
    } DMACFG_b;
  } ;

  union {
    __IOM uint32_t DMATB;                       /*!< DMA address for full transfer                                             */

    struct {
      __IOM uint32_t DMATB      : 16;           /*!< DMA register for burst accesses                                           */
            uint32_t            : 16;
    } DMATB_b;
  } ;
  __IM  uint32_t  RESERVED[43];

  union {
    __IOM uint32_t CFG;                         /*!< Configuration register                                                    */

    struct {
      __IOM uint32_t OUTSEL     : 1;            /*!< The output value selection                                                */
      __IOM uint32_t CHVSEL     : 1;            /*!< Write CHxVAL register selection                                           */
            uint32_t            : 30;
    } CFG_b;
  } ;
} TIMER_Type;                                  /*!< Size = 256 (0x100)                                                        */



/* =========================================================================================================================== */
/* ================                                          TIMER1                                           ================ */
/* =========================================================================================================================== */


/**
  * @brief General-purpose-timers (TIMER1)
  */

typedef struct {                                /*!< TIMER1 Structure                                                          */

  union {
    __IOM uint32_t CTL0;                        /*!< control register 0                                                        */

