RIOT-OS/RIOT/cpu/gd32f3x0/include/gd32f3x0_periph.h
    struct {
      __IOM uint32_t CH0EN      : 1;            /*!< Capture/Compare 0 output enable                                           */
      __IOM uint32_t CH0P       : 1;            /*!< Capture/Compare 0 output Polarity                                         */
            uint32_t            : 1;
      __IOM uint32_t CH0NP      : 1;            /*!< Capture/Compare 0 output Polarity                                         */
      __IOM uint32_t CH1EN      : 1;            /*!< Capture/Compare 1 output enable                                           */
      __IOM uint32_t CH1P       : 1;            /*!< Capture/Compare 1 output Polarity                                         */
            uint32_t            : 1;
      __IOM uint32_t CH1NP      : 1;            /*!< Capture/Compare 1 output Polarity                                         */
      __IOM uint32_t CH2EN      : 1;            /*!< Capture/Compare 2 output enable                                           */
      __IOM uint32_t CH2P       : 1;            /*!< Capture/Compare 2 output Polarity                                         */
            uint32_t            : 1;
      __IOM uint32_t CH2NP      : 1;            /*!< Capture/Compare 2 output Polarity                                         */
      __IOM uint32_t CH3EN      : 1;            /*!< Capture/Compare 3 output enable                                           */
      __IOM uint32_t CH3P       : 1;            /*!< Capture/Compare 3 output Polarity                                         */
            uint32_t            : 1;
      __IOM uint32_t CH3NP      : 1;            /*!< Capture/Compare 3 output Polarity                                         */
            uint32_t            : 16;
    } CHCTL2_b;
  } ;

  union {
    __IOM uint32_t CNT;                         /*!< counter                                                                   */

    struct {
      __IOM uint32_t CNT        : 32;           /*!< counter value                                                             */
    } CNT_b;
  } ;

  union {
    __IOM uint32_t PSC;                         /*!< prescaler                                                                 */

    struct {
      __IOM uint32_t PSC        : 16;           /*!< Prescaler value                                                           */
            uint32_t            : 16;
    } PSC_b;
  } ;

  union {
    __IOM uint32_t CAR;                         /*!< auto-reload register                                                      */

    struct {
      __IOM uint32_t CARL       : 32;           /*!< Low Auto-reload value                                                     */
    } CAR_b;
  } ;
  __IM  uint32_t  RESERVED;

  union {
    __IOM uint32_t CH0CV;                       /*!< capture/compare register 1                                                */

    struct {
      __IOM uint32_t CH0VAL     : 32;           /*!< Low Capture/Compare 1 value                                               */
    } CH0CV_b;
  } ;

  union {
    __IOM uint32_t CH1CV;                       /*!< capture/compare register 2                                                */

    struct {
      __IOM uint32_t CH1VAL     : 32;           /*!< Low Capture/Compare 2 value                                               */
    } CH1CV_b;
  } ;

  union {
    __IOM uint32_t CH2CV;                       /*!< capture/compare register 2                                                */

    struct {
      __IOM uint32_t CH2VAL     : 32;           /*!< High Capture/Compare value (TIM2 only)                                    */
    } CH2CV_b;
  } ;

  union {
    __IOM uint32_t CH3CV;                       /*!< capture/compare register 3                                                */

    struct {
      __IOM uint32_t CH3VAL     : 32;           /*!< High Capture/Compare value (TIM2 only)                                    */
    } CH3CV_b;
  } ;
  __IM  uint32_t  RESERVED1;

  union {
    __IOM uint32_t DMACFG;                      /*!< DMA control register                                                      */

    struct {
      __IOM uint32_t DMATA      : 5;            /*!< DMA base address                                                          */
            uint32_t            : 3;
      __IOM uint32_t DMATC      : 5;            /*!< DMA burst length                                                          */
            uint32_t            : 19;
    } DMACFG_b;
  } ;

  union {
    __IOM uint32_t DMATB;                       /*!< DMA address for full transfer                                             */

    struct {
      __IOM uint32_t DMATB      : 16;           /*!< DMA register for burst accesses                                           */
            uint32_t            : 16;
    } DMATB_b;
  } ;
  __IM  uint32_t  RESERVED2[43];

  union {
    __IOM uint32_t CFG;                         /*!< Configuration                                                             */

    struct {
            uint32_t            : 1;
      __IOM uint32_t CHVSEL     : 1;            /*!< Write CHxVAL register selection                                           */
            uint32_t            : 30;
    } CFG_b;
  } ;
} TIMER1_Type;                                  /*!< Size = 256 (0x100)                                                        */



/* =========================================================================================================================== */
/* ================                                          TIMER5                                           ================ */
/* =========================================================================================================================== */


/**
  * @brief Basic-timers (TIMER5)
  */

typedef struct {                                /*!< TIMER5 Structure                                                          */

  union {
    __IOM uint32_t CTL0;                        /*!< control register 0                                                        */

