RIOT-OS/RIOT/cpu/gd32f3x0/include/gd32f3x0_periph.h
    struct {
      __IOM uint32_t CEN        : 1;            /*!< Counter enable                                                            */
      __IOM uint32_t UPDIS      : 1;            /*!< Update disable                                                            */
      __IOM uint32_t UPS        : 1;            /*!< Update request source                                                     */
      __IOM uint32_t SPM        : 1;            /*!< One-pulse mode                                                            */
            uint32_t            : 3;
      __IOM uint32_t ARSE       : 1;            /*!< Auto-reload preload enable                                                */
            uint32_t            : 24;
    } CTL0_b;
  } ;

  union {
    __IOM uint32_t CTL1;                        /*!< control register 1                                                        */

    struct {
            uint32_t            : 4;
      __IOM uint32_t MMC        : 3;            /*!< Master mode selection                                                     */
            uint32_t            : 25;
    } CTL1_b;
  } ;
  __IM  uint32_t  RESERVED;

  union {
    __IOM uint32_t DMAINTEN;                    /*!< DMA/Interrupt enable register                                             */

    struct {
      __IOM uint32_t UPIE       : 1;            /*!< Update interrupt enable                                                   */
            uint32_t            : 7;
      __IOM uint32_t UPDEN      : 1;            /*!< Update DMA request enable                                                 */
            uint32_t            : 23;
    } DMAINTEN_b;
  } ;

  union {
    __IOM uint32_t INTF;                        /*!< status register                                                           */

    struct {
      __IOM uint32_t UPIF       : 1;            /*!< Update interrupt flag                                                     */
            uint32_t            : 31;
    } INTF_b;
  } ;

  union {
    __OM  uint32_t SWEVG;                       /*!< event generation register                                                 */

    struct {
      __OM  uint32_t UPG        : 1;            /*!< Update generation                                                         */
            uint32_t            : 31;
    } SWEVG_b;
  } ;
  __IM  uint32_t  RESERVED1[3];

  union {
    __IOM uint32_t CNT;                         /*!< counter                                                                   */

    struct {
      __IOM uint32_t CNT        : 16;           /*!< Low counter value                                                         */
            uint32_t            : 16;
    } CNT_b;
  } ;

  union {
    __IOM uint32_t PSC;                         /*!< prescaler                                                                 */

    struct {
      __IOM uint32_t PSC        : 16;           /*!< Prescaler value                                                           */
            uint32_t            : 16;
    } PSC_b;
  } ;

  union {
    __IOM uint32_t CAR;                         /*!< auto-reload register                                                      */

    struct {
      __IOM uint32_t CARL       : 16;           /*!< Low Auto-reload value                                                     */
            uint32_t            : 16;
    } CAR_b;
  } ;
} TIMER5_Type;                                  /*!< Size = 48 (0x30)                                                          */



/* =========================================================================================================================== */
/* ================                                          TIMER13                                          ================ */
/* =========================================================================================================================== */


/**
  * @brief General-purpose-timers (TIMER13)
  */

typedef struct {                                /*!< TIMER13 Structure                                                         */

  union {
    __IOM uint32_t CTL0;                        /*!< control register 1                                                        */

    struct {
      __IOM uint32_t CEN        : 1;            /*!< Counter enable                                                            */
      __IOM uint32_t UPDIS      : 1;            /*!< Update disable                                                            */
      __IOM uint32_t UPS        : 1;            /*!< Update request source                                                     */
            uint32_t            : 4;
      __IOM uint32_t ARSE       : 1;            /*!< Auto-reload preload enable                                                */
      __IOM uint32_t CKDIV      : 2;            /*!< Clock division                                                            */
            uint32_t            : 22;
    } CTL0_b;
  } ;
  __IM  uint32_t  RESERVED[2];

  union {
    __IOM uint32_t DMAINTEN;                    /*!< DMA/Interrupt enable register                                             */

    struct {
      __IOM uint32_t UPIE       : 1;            /*!< Update interrupt enable                                                   */
      __IOM uint32_t CH0IE      : 1;            /*!< Capture/Compare 0 interrupt enable                                        */
            uint32_t            : 30;
    } DMAINTEN_b;
  } ;

  union {
    __IOM uint32_t INTF;                        /*!< interrupt flag register                                                   */

    struct {
      __IOM uint32_t UPIF       : 1;            /*!< Update interrupt flag                                                     */
      __IOM uint32_t CH0IF      : 1;            /*!< Capture/compare 0 interrupt flag                                          */
            uint32_t            : 7;
      __IOM uint32_t CH0OF      : 1;            /*!< Capture/Compare 0 overcapture flag                                        */
            uint32_t            : 22;
    } INTF_b;
  } ;

  union {
    __OM  uint32_t SWEVG;                       /*!< event generation register                                                 */

