RIOT-OS/RIOT/cpu/gd32f3x0/include/gd32f3x0_periph.h
    struct {
      __IOM uint32_t CCSE       : 1;            /*!< Capture/compare preloaded control                                         */
            uint32_t            : 1;
      __IOM uint32_t CCUC       : 1;            /*!< Capture/compare control update selection                                  */
      __IOM uint32_t DMAS       : 1;            /*!< Capture/compare DMA selection                                             */
      __IOM uint32_t MMC        : 3;            /*!< Master mode selection                                                     */
            uint32_t            : 1;
      __IOM uint32_t ISO0       : 1;            /*!< Output Idle state 0                                                       */
      __IOM uint32_t ISO0N      : 1;            /*!< Output Idle state 0                                                       */
      __IOM uint32_t ISO1       : 1;            /*!< Output Idle state 1                                                       */
            uint32_t            : 21;
    } CTL1_b;
  } ;

  union {
    __IOM uint32_t SMCFG;                       /*!< slave mode configuration register                                         */

    struct {
      __IOM uint32_t SMC        : 3;            /*!< Slave mode selection                                                      */
            uint32_t            : 1;
      __IOM uint32_t TRGS       : 3;            /*!< Trigger selection                                                         */
      __IOM uint32_t MSM        : 1;            /*!< Master/Slave mode                                                         */
            uint32_t            : 24;
    } SMCFG_b;
  } ;

  union {
    __IOM uint32_t DMAINTEN;                    /*!< DMA/Interrupt enable register                                             */

    struct {
      __IOM uint32_t UPIE       : 1;            /*!< Update interrupt enable                                                   */
      __IOM uint32_t CH0IE      : 1;            /*!< Capture/Compare 1 interrupt enable                                        */
      __IOM uint32_t CH1IE      : 1;            /*!< Capture/Compare 2 interrupt enable                                        */
            uint32_t            : 2;
      __IOM uint32_t CMTIE      : 1;            /*!< COM interrupt enable                                                      */
      __IOM uint32_t TRGIE      : 1;            /*!< Trigger interrupt enable                                                  */
      __IOM uint32_t BRKIE      : 1;            /*!< Break interrupt enable                                                    */
      __IOM uint32_t UPDEN      : 1;            /*!< Update DMA request enable                                                 */
      __IOM uint32_t CH0DEN     : 1;            /*!< Capture/Compare 0 DMA request enable                                      */
      __IOM uint32_t CH1DEN     : 1;            /*!< Capture/Compare 1 DMA request enable                                      */
            uint32_t            : 2;
      __IOM uint32_t CMTDEN     : 1;            /*!< Commutation DMA request enable                                            */
      __IOM uint32_t TRGDEN     : 1;            /*!< Trigger DMA request enable                                                */
            uint32_t            : 17;
    } DMAINTEN_b;
  } ;

  union {
    __IOM uint32_t INTF;                        /*!< interrupt flag register                                                   */

    struct {
      __IOM uint32_t UPIF       : 1;            /*!< Update interrupt flag                                                     */
      __IOM uint32_t CH0IF      : 1;            /*!< Capture/compare 0 interrupt flag                                          */
      __IOM uint32_t CH1IF      : 1;            /*!< Capture/Compare 1 interrupt flag                                          */
            uint32_t            : 2;
      __IOM uint32_t CMTIF      : 1;            /*!< COM interrupt flag                                                        */
      __IOM uint32_t TRGIF      : 1;            /*!< Trigger interrupt flag                                                    */
      __IOM uint32_t BRKIF      : 1;            /*!< Break interrupt flag                                                      */
            uint32_t            : 1;
      __IOM uint32_t CH0OF      : 1;            /*!< Capture/Compare 0 overcapture flag                                        */
      __IOM uint32_t CH1OF      : 1;            /*!< Capture/compare 1 overcapture flag                                        */
            uint32_t            : 21;
    } INTF_b;
  } ;

  union {
    __OM  uint32_t SWEVG;                       /*!< event generation register                                                 */

    struct {
      __OM  uint32_t UPG        : 1;            /*!< Update generation                                                         */
      __OM  uint32_t CH0G       : 1;            /*!< Capture/compare 0 generation                                              */
      __OM  uint32_t CH1G       : 1;            /*!< Capture/compare 1 generation                                              */
            uint32_t            : 2;
      __OM  uint32_t CMTG       : 1;            /*!< Capture/Compare control update generation                                 */
      __OM  uint32_t TRGG       : 1;            /*!< Trigger generation                                                        */
      __OM  uint32_t BRKG       : 1;            /*!< Break generation                                                          */
            uint32_t            : 24;
    } SWEVG_b;
  } ;

  union {
    union {
      __IOM uint32_t CHCTL0_Output;             /*!< capture/compare mode register (output mode)                               */

      struct {
        __IOM uint32_t CH0MS    : 2;            /*!< Capture/Compare 0 selection                                               */
        __IOM uint32_t CH0COMFEN : 1;           /*!< Output Compare 0 fast enable                                              */
        __IOM uint32_t CH0COMSEN : 1;           /*!< Output Compare 0 preload enable                                           */
        __IOM uint32_t CH0COMCTL : 3;           /*!< Output Compare 0 mode                                                     */
              uint32_t          : 1;
        __IOM uint32_t CH1MS    : 2;            /*!< Capture/Compare 1 selection                                               */
        __IOM uint32_t CH1COMFEN : 1;           /*!< Output Compare 1 fast enable                                              */
        __IOM uint32_t CH1COMSEN : 1;           /*!< Output Compare 1 preload enable                                           */
        __IOM uint32_t CH1COMCTL : 3;           /*!< Output Compare 1 mode                                                     */
              uint32_t          : 17;
      } CHCTL0_Output_b;
    } ;

    union {
      __IOM uint32_t CHCTL0_Input;              /*!< capture/compare mode register 0 (input mode)                              */

