RIOT-OS/RIOT/cpu/gd32f3x0/include/gd32f3x0_periph.h
    struct {
      __IOM uint32_t DMATB      : 16;           /*!< DMA register for burst accesses                                           */
            uint32_t            : 16;
    } DMATB_b;
  } ;
  __IM  uint32_t  RESERVED2[43];

  union {
    __IOM uint32_t CFG;                         /*!< configuration register                                                    */

    struct {
      __IOM uint32_t OUTSEL     : 1;            /*!< The output value selection                                                */
      __IOM uint32_t CHVSEL     : 1;            /*!< Write CHxVAL register selection                                           */
            uint32_t            : 30;
    } CFG_b;
  } ;
} TIMER14_Type;                                 /*!< Size = 256 (0x100)                                                        */



/* =========================================================================================================================== */
/* ================                                          TIMER15                                          ================ */
/* =========================================================================================================================== */


/**
  * @brief General-purpose-timers (TIMER15)
  */

typedef struct {                                /*!< TIMER15 Structure                                                         */

  union {
    __IOM uint32_t CTL0;                        /*!< control register 0                                                        */

    struct {
      __IOM uint32_t CEN        : 1;            /*!< Counter enable                                                            */
      __IOM uint32_t UPDIS      : 1;            /*!< Update disable                                                            */
      __IOM uint32_t UPS        : 1;            /*!< Update request source                                                     */
      __IOM uint32_t SPM        : 1;            /*!< One-pulse mode                                                            */
            uint32_t            : 3;
      __IOM uint32_t ARSE       : 1;            /*!< Auto-reload preload enable                                                */
      __IOM uint32_t CKDIV      : 2;            /*!< Clock division                                                            */
            uint32_t            : 22;
    } CTL0_b;
  } ;

  union {
    __IOM uint32_t CTL1;                        /*!< control register 1                                                        */

    struct {
      __IOM uint32_t CCSE       : 1;            /*!< Capture/compare preloaded control                                         */
            uint32_t            : 1;
      __IOM uint32_t CCUC       : 1;            /*!< Capture/compare control update selection                                  */
      __IOM uint32_t DMAS       : 1;            /*!< Capture/compare DMA selection                                             */
            uint32_t            : 4;
      __IOM uint32_t ISO0       : 1;            /*!< Output Idle state 0                                                       */
      __IOM uint32_t ISO0N      : 1;            /*!< Output Idle state 0                                                       */
            uint32_t            : 22;
    } CTL1_b;
  } ;
  __IM  uint32_t  RESERVED;

  union {
    __IOM uint32_t DMAINTEN;                    /*!< DMA/Interrupt enable register                                             */

    struct {
      __IOM uint32_t UPIE       : 1;            /*!< Update interrupt enable                                                   */
      __IOM uint32_t CH0IE      : 1;            /*!< Capture/Compare 0 interrupt enable                                        */
            uint32_t            : 3;
      __IOM uint32_t CMTIE      : 1;            /*!< COM interrupt enable                                                      */
            uint32_t            : 1;
      __IOM uint32_t BRKIE      : 1;            /*!< Break interrupt enable                                                    */
      __IOM uint32_t UPDEN      : 1;            /*!< Update DMA request enable                                                 */
      __IOM uint32_t CH0DEN     : 1;            /*!< Capture/Compare 0 DMA request enable                                      */
            uint32_t            : 22;
    } DMAINTEN_b;
  } ;

  union {
    __IOM uint32_t INTF;                        /*!< interrupt flag register                                                   */

    struct {
      __IOM uint32_t UPIF       : 1;            /*!< Update interrupt flag                                                     */
      __IOM uint32_t CH0IF      : 1;            /*!< Capture/compare 0 interrupt flag                                          */
            uint32_t            : 3;
      __IOM uint32_t CMTIF      : 1;            /*!< COM interrupt flag                                                        */
            uint32_t            : 1;
      __IOM uint32_t BRKIF      : 1;            /*!< Break interrupt flag                                                      */
            uint32_t            : 1;
      __IOM uint32_t CH0OF      : 1;            /*!< Capture/Compare 0 overcapture flag                                        */
            uint32_t            : 22;
    } INTF_b;
  } ;

  union {
    __OM  uint32_t SWEVG;                       /*!< event generation register                                                 */

    struct {
      __OM  uint32_t UPG        : 1;            /*!< Update generation                                                         */
      __OM  uint32_t CH0G       : 1;            /*!< Capture/compare 0 generation                                              */
            uint32_t            : 3;
      __OM  uint32_t CMTG       : 1;            /*!< Capture/Compare control update generation                                 */
            uint32_t            : 1;
      __OM  uint32_t BRKG       : 1;            /*!< Break generation                                                          */
            uint32_t            : 24;
    } SWEVG_b;
  } ;

  union {
    union {
      __IOM uint32_t CHCTL0_Output;             /*!< capture/compare mode register (output mode)                               */

