RIOT-OS/RIOT/cpu/gd32f3x0/include/gd32f3x0_periph.h
      struct {
        __IOM uint32_t CH0MS    : 2;            /*!< Capture/Compare 0 selection                                               */
        __IOM uint32_t CH0COMFEN : 1;           /*!< Output Compare 0 fast enable                                              */
        __IOM uint32_t CH0COMSEN : 1;           /*!< Output Compare 0 preload enable                                           */
        __IOM uint32_t CH0COMCTL : 3;           /*!< Output Compare 0 mode                                                     */
              uint32_t          : 25;
      } CHCTL0_Output_b;
    } ;

    union {
      __IOM uint32_t CHCTL0_Input;              /*!< capture/compare mode register 0 (input mode)                              */

      struct {
        __IOM uint32_t CH0MS    : 2;            /*!< Capture/Compare 0 selection                                               */
        __IOM uint32_t CH0CAPPSC : 2;           /*!< Input capture 0 prescaler                                                 */
        __IOM uint32_t CH0CAPFLT : 4;           /*!< Input capture 0 filter                                                    */
              uint32_t          : 24;
      } CHCTL0_Input_b;
    } ;
  };
  __IM  uint32_t  RESERVED1;

  union {
    __IOM uint32_t CHCTL2;                      /*!< capture/compare enable register                                           */

    struct {
      __IOM uint32_t CH0EN      : 1;            /*!< Capture/Compare 0 output enable                                           */
      __IOM uint32_t CH0P       : 1;            /*!< Capture/Compare 0 output Polarity                                         */
      __IOM uint32_t CH0NEN     : 1;            /*!< Capture/Compare 0 complementary output enable                             */
      __IOM uint32_t CH0NP      : 1;            /*!< Capture/Compare 0 output Polarity                                         */
            uint32_t            : 28;
    } CHCTL2_b;
  } ;

  union {
    __IOM uint32_t CNT;                         /*!< counter                                                                   */

    struct {
      __IOM uint32_t CNT        : 16;           /*!< counter value                                                             */
            uint32_t            : 16;
    } CNT_b;
  } ;

  union {
    __IOM uint32_t PSC;                         /*!< prescaler                                                                 */

    struct {
      __IOM uint32_t PSC        : 16;           /*!< Prescaler value                                                           */
            uint32_t            : 16;
    } PSC_b;
  } ;

  union {
    __IOM uint32_t CAR;                         /*!< auto-reload register                                                      */

    struct {
      __IOM uint32_t CARL       : 16;           /*!< Auto-reload value                                                         */
            uint32_t            : 16;
    } CAR_b;
  } ;

  union {
    __IOM uint32_t CREP;                        /*!< repetition counter register                                               */

    struct {
      __IOM uint32_t CREP       : 8;            /*!< Repetition counter value                                                  */
            uint32_t            : 24;
    } CREP_b;
  } ;

  union {
    __IOM uint32_t CH0CV;                       /*!< capture/compare register 0                                                */

    struct {
      __IOM uint32_t CH0VAL     : 16;           /*!< Capture/Compare 0 value                                                   */
            uint32_t            : 16;
    } CH0CV_b;
  } ;
  __IM  uint32_t  RESERVED2[3];

  union {
    __IOM uint32_t CCHP;                        /*!< break and dead-time register                                              */

    struct {
      __IOM uint32_t DTCFG      : 8;            /*!< Dead-time generator setup                                                 */
      __IOM uint32_t PROT       : 2;            /*!< complementary register protect control                                    */
      __IOM uint32_t IOS        : 1;            /*!< Off-state selection for Idle mode                                         */
      __IOM uint32_t ROS        : 1;            /*!< Off-state selection for Run mode                                          */
      __IOM uint32_t BRKEN      : 1;            /*!< Break enable                                                              */
      __IOM uint32_t BRKP       : 1;            /*!< Break polarity                                                            */
      __IOM uint32_t OAEN       : 1;            /*!< Automatic output enable                                                   */
      __IOM uint32_t POEN       : 1;            /*!< Main output enable                                                        */
            uint32_t            : 16;
    } CCHP_b;
  } ;

  union {
    __IOM uint32_t DMACFG;                      /*!< DMA configuration register                                                */

    struct {
      __IOM uint32_t DMATA      : 5;            /*!< DMA transfer access start address                                         */
            uint32_t            : 3;
      __IOM uint32_t DMATC      : 5;            /*!< DMA transfer count                                                        */
            uint32_t            : 19;
    } DMACFG_b;
  } ;

  union {
    __IOM uint32_t DMATB;                       /*!< DMA transfer buffer register                                              */

    struct {
      __IOM uint32_t DMATB      : 16;           /*!< DMA register for burst accesses                                           */
            uint32_t            : 16;
    } DMATB_b;
  } ;
  __IM  uint32_t  RESERVED3[43];

  union {
    __IOM uint32_t CFG;                         /*!< configuration register                                                    */

