RIOT-OS/RIOT/cpu/gd32f3x0/include/gd32f3x0_periph.h
    struct {
      __IOM uint32_t OUTSEL     : 1;            /*!< The output value selection                                                */
      __IOM uint32_t CHVSEL     : 1;            /*!< Write CHxVAL register selection                                           */
            uint32_t            : 30;
    } CFG_b;
  } ;
} TIMER15_Type;                                 /*!< Size = 256 (0x100)                                                        */



/* =========================================================================================================================== */
/* ================                                            TSI                                            ================ */
/* =========================================================================================================================== */


/**
  * @brief Touch sensing Interface (TSI)
  */

typedef struct {                                /*!< TSI Structure                                                             */

  union {
    __IOM uint32_t CTL0;                        /*!< control register                                                          */

    struct {
      __IOM uint32_t TSIEN      : 1;            /*!< Touch sensing controller enable                                           */
      __IOM uint32_t TSIS       : 1;            /*!< Start a new acquisition                                                   */
      __IOM uint32_t TRGMOD     : 1;            /*!< Trigger mode selection                                                    */
      __IOM uint32_t EGSEL      : 1;            /*!< Edge selection                                                            */
      __IOM uint32_t PINMOD     : 1;            /*!< I/O Default mode                                                          */
      __IOM uint32_t MCN        : 3;            /*!< Max count value                                                           */
            uint32_t            : 4;
      __IOM uint32_t CTCDIV     : 3;            /*!< pulse generator prescaler                                                 */
      __IOM uint32_t ECDIV      : 1;            /*!< Spread spectrum prescaler                                                 */
      __IOM uint32_t ECEN       : 1;            /*!< Spread spectrum enable                                                    */
      __IOM uint32_t ECDT       : 7;            /*!< Spread spectrum deviation                                                 */
      __IOM uint32_t CTDT       : 4;            /*!< Charge transfer pulse low                                                 */
      __IOM uint32_t CDT        : 4;            /*!< Charge transfer pulse high                                                */
    } CTL0_b;
  } ;

  union {
    __IOM uint32_t INTEN;                       /*!< interrupt enable register                                                 */

    struct {
      __IOM uint32_t CTCFIE     : 1;            /*!< Charge-transfer complete flag Interrupt Enable                            */
      __IOM uint32_t MNERRIE    : 1;            /*!< Max Cycle Number Error Interrupt Enable                                   */
            uint32_t            : 30;
    } INTEN_b;
  } ;

  union {
    __IOM uint32_t INTC;                        /*!< interrupt flag clear register                                             */

    struct {
      __IOM uint32_t CCTCF      : 1;            /*!< Clear charge-transfer complete flag                                       */
      __IOM uint32_t CMNERR     : 1;            /*!< Clear max cycle number error                                              */
            uint32_t            : 30;
    } INTC_b;
  } ;

  union {
    __IOM uint32_t INTF;                        /*!< interrupt flag register                                                   */

    struct {
      __IOM uint32_t CTCF       : 1;            /*!< End of acquisition flag                                                   */
      __IOM uint32_t MNERR      : 1;            /*!< Max count error flag                                                      */
            uint32_t            : 30;
    } INTF_b;
  } ;

  union {
    __IOM uint32_t PHM;                         /*!< Pin hysteresis mode register                                              */

    struct {
      __IOM uint32_t G0P0       : 1;            /*!< G0P0 Schmitt trigger hysteresis mode                                      */
      __IOM uint32_t G0P1       : 1;            /*!< G0P1 Schmitt trigger hysteresis mode                                      */
      __IOM uint32_t G0P2       : 1;            /*!< G0P2 Schmitt trigger hysteresis mode                                      */
      __IOM uint32_t G0P3       : 1;            /*!< G0P3 Schmitt trigger hysteresis mode                                      */
      __IOM uint32_t G1P0       : 1;            /*!< G1P0 Schmitt trigger hysteresis mode                                      */
      __IOM uint32_t G1P1       : 1;            /*!< G1P1 Schmitt trigger hysteresis mode                                      */
      __IOM uint32_t G1P2       : 1;            /*!< G1P2 Schmitt trigger hysteresis mode                                      */
      __IOM uint32_t G1P3       : 1;            /*!< G1P3 Schmitt trigger hysteresis mode                                      */
      __IOM uint32_t G2P0       : 1;            /*!< G2P0 Schmitt trigger hysteresis mode                                      */
      __IOM uint32_t G2P1       : 1;            /*!< G2P1 Schmitt trigger hysteresis mode                                      */
      __IOM uint32_t G2P2       : 1;            /*!< G2P2 Schmitt trigger hysteresis mode                                      */
      __IOM uint32_t G2P3       : 1;            /*!< G2P3 Schmitt trigger hysteresis mode                                      */
      __IOM uint32_t G3P0       : 1;            /*!< G3P0 Schmitt trigger hysteresis mode                                      */
      __IOM uint32_t G3P1       : 1;            /*!< G3P1 Schmitt trigger hysteresis mode                                      */
      __IOM uint32_t G3P2       : 1;            /*!< G3P2 Schmitt trigger hysteresis mode                                      */
      __IOM uint32_t G3P3       : 1;            /*!< G3P3 Schmitt trigger hysteresis mode                                      */
      __IOM uint32_t G4P0       : 1;            /*!< G4P0 Schmitt trigger hysteresis mode                                      */
      __IOM uint32_t G4P1       : 1;            /*!< G4P1 Schmitt trigger hysteresis mode                                      */
      __IOM uint32_t G4P2       : 1;            /*!< G4P2 Schmitt trigger hysteresis mode                                      */
      __IOM uint32_t G4P3       : 1;            /*!< G4P3 Schmitt trigger hysteresis mode                                      */
      __IOM uint32_t G5P0       : 1;            /*!< G5P0 Schmitt trigger hysteresis mode                                      */
      __IOM uint32_t G5P1       : 1;            /*!< G5P1 Schmitt trigger hysteresis mode                                      */
      __IOM uint32_t G5P2       : 1;            /*!< G5P2 Schmitt trigger hysteresis mode                                      */
      __IOM uint32_t G5P3       : 1;            /*!< G5P3 Schmitt trigger hysteresis mode                                      */
            uint32_t            : 8;
    } PHM_b;
  } ;
  __IM  uint32_t  RESERVED;

  union {
    __IOM uint32_t ASW;                         /*!< I/O analog switch register                                                */

