RIOT-OS/RIOT/cpu/gd32f3x0/include/gd32f3x0_periph.h
    struct {
      __IOM uint32_t G0P0       : 1;            /*!< G0P0 analog switch enable                                                 */
      __IOM uint32_t G0P1       : 1;            /*!< G0P1 analog switch enable                                                 */
      __IOM uint32_t G0P2       : 1;            /*!< G0P2 analog switch enable                                                 */
      __IOM uint32_t G0P3       : 1;            /*!< G0P3 analog switch enable                                                 */
      __IOM uint32_t G1P0       : 1;            /*!< G1P0 analog switch enable                                                 */
      __IOM uint32_t G1P1       : 1;            /*!< G1P1 analog switch enable                                                 */
      __IOM uint32_t G1P2       : 1;            /*!< G1P2 analog switch enable                                                 */
      __IOM uint32_t G1P3       : 1;            /*!< G1P3 analog switch enable                                                 */
      __IOM uint32_t G2P0       : 1;            /*!< G2P0 analog switch enable                                                 */
      __IOM uint32_t G2P1       : 1;            /*!< G2P1 analog switch enable                                                 */
      __IOM uint32_t G2P2       : 1;            /*!< G2P2 analog switch enable                                                 */
      __IOM uint32_t G2P3       : 1;            /*!< G2P3 analog switch enable                                                 */
      __IOM uint32_t G3P0       : 1;            /*!< G3P0 analog switch enable                                                 */
      __IOM uint32_t G3P1       : 1;            /*!< G3P1 analog switch enable                                                 */
      __IOM uint32_t G3P2       : 1;            /*!< G3P2 analog switch enable                                                 */
      __IOM uint32_t G3P3       : 1;            /*!< G3P3 analog switch enable                                                 */
      __IOM uint32_t G4P0       : 1;            /*!< G4P0 analog switch enable                                                 */
      __IOM uint32_t G4P1       : 1;            /*!< G4P1 analog switch enable                                                 */
      __IOM uint32_t G4P2       : 1;            /*!< G4P2 analog switch enable                                                 */
      __IOM uint32_t G4P3       : 1;            /*!< G4P3 analog switch enable                                                 */
      __IOM uint32_t G5P0       : 1;            /*!< G5P0 analog switch enable                                                 */
      __IOM uint32_t G5P1       : 1;            /*!< G5P1 analog switch enable                                                 */
      __IOM uint32_t G5P2       : 1;            /*!< G5P2 analog switch enable                                                 */
      __IOM uint32_t G5P3       : 1;            /*!< G5P3 analog switch enable                                                 */
            uint32_t            : 8;
    } ASW_b;
  } ;
  __IM  uint32_t  RESERVED1;

  union {
    __IOM uint32_t SAMPCFG;                     /*!< I/O sample configuration register                                         */

    struct {
      __IOM uint32_t G0P0       : 1;            /*!< G0P0 sampling mode                                                        */
      __IOM uint32_t G0P1       : 1;            /*!< G0P1 sampling mode                                                        */
      __IOM uint32_t G0P2       : 1;            /*!< G0P2 sampling mode                                                        */
      __IOM uint32_t G0P3       : 1;            /*!< G0P3 sampling mode                                                        */
      __IOM uint32_t G1P0       : 1;            /*!< G1P0 sampling mode                                                        */
      __IOM uint32_t G1P1       : 1;            /*!< G1P1 sampling mode                                                        */
      __IOM uint32_t G1P2       : 1;            /*!< G1P2 sampling mode                                                        */
      __IOM uint32_t G1P3       : 1;            /*!< G1P3 sampling mode                                                        */
      __IOM uint32_t G2P0       : 1;            /*!< G2P0 sampling mode                                                        */
      __IOM uint32_t G2P1       : 1;            /*!< G2P1 sampling mode                                                        */
      __IOM uint32_t G2P2       : 1;            /*!< G2P2 sampling mode                                                        */
      __IOM uint32_t G2P3       : 1;            /*!< G2P3 sampling mode                                                        */
      __IOM uint32_t G3P0       : 1;            /*!< G3P0 sampling mode                                                        */
      __IOM uint32_t G3P1       : 1;            /*!< G3P1 sampling mode                                                        */
      __IOM uint32_t G3P2       : 1;            /*!< G3P2 sampling mode                                                        */
      __IOM uint32_t G3P3       : 1;            /*!< G3P3 sampling mode                                                        */
      __IOM uint32_t G4P0       : 1;            /*!< G4P0 sampling mode                                                        */
      __IOM uint32_t G4P1       : 1;            /*!< G4P1 sampling mode                                                        */
      __IOM uint32_t G4P2       : 1;            /*!< G4P2 sampling mode                                                        */
      __IOM uint32_t G4P3       : 1;            /*!< G4P3 sampling mode                                                        */
      __IOM uint32_t G5P0       : 1;            /*!< G5P0 sampling mode                                                        */
      __IOM uint32_t G5P1       : 1;            /*!< G5P1 sampling mode                                                        */
      __IOM uint32_t G5P2       : 1;            /*!< G5P2 sampling mode                                                        */
      __IOM uint32_t G5P3       : 1;            /*!< G5P3 sampling mode                                                        */
            uint32_t            : 8;
    } SAMPCFG_b;
  } ;
  __IM  uint32_t  RESERVED2;

  union {
    __IOM uint32_t CHCFG;                       /*!< I/O channel configuration register                                        */

