RIOT-OS/RIOT/cpu/gd32f3x0/include/gd32f3x0_periph.h
    struct {
      __IOM uint32_t G0P0       : 1;            /*!< G0P0 channel mode                                                         */
      __IOM uint32_t G0P1       : 1;            /*!< G0P1 channel mode                                                         */
      __IOM uint32_t G0P2       : 1;            /*!< G0P2 channel mode                                                         */
      __IOM uint32_t G0P3       : 1;            /*!< G0P3 channel mode                                                         */
      __IOM uint32_t G1P0       : 1;            /*!< G1P0 channel mode                                                         */
      __IOM uint32_t G1P1       : 1;            /*!< G1P1 channel mode                                                         */
      __IOM uint32_t G1P2       : 1;            /*!< G1P2 channel mode                                                         */
      __IOM uint32_t G1P3       : 1;            /*!< G1P3 channel mode                                                         */
      __IOM uint32_t G2P0       : 1;            /*!< G2P0 channel mode                                                         */
      __IOM uint32_t G2P1       : 1;            /*!< G2P1 channel mode                                                         */
      __IOM uint32_t G2P2       : 1;            /*!< G2P2 channel mode                                                         */
      __IOM uint32_t G2P3       : 1;            /*!< G2P3 channel mode                                                         */
      __IOM uint32_t G3P0       : 1;            /*!< G3P0 channel mode                                                         */
      __IOM uint32_t G3P1       : 1;            /*!< G3P1 channel mode                                                         */
      __IOM uint32_t G3P2       : 1;            /*!< G3P2 channel mode                                                         */
      __IOM uint32_t G3P3       : 1;            /*!< G3P3 channel mode                                                         */
      __IOM uint32_t G4P0       : 1;            /*!< G4P0 channel mode                                                         */
      __IOM uint32_t G4P1       : 1;            /*!< G4P1 channel mode                                                         */
      __IOM uint32_t G4P2       : 1;            /*!< G4P2 channel mode                                                         */
      __IOM uint32_t G4P3       : 1;            /*!< G4P3 channel mode                                                         */
      __IOM uint32_t G5P0       : 1;            /*!< G5P0 channel mode                                                         */
      __IOM uint32_t G5P1       : 1;            /*!< G5P1 channel mode                                                         */
      __IOM uint32_t G5P2       : 1;            /*!< G5P2 channel mode                                                         */
      __IOM uint32_t G5P3       : 1;            /*!< G5P3 channel mode                                                         */
            uint32_t            : 8;
    } CHCFG_b;
  } ;
  __IM  uint32_t  RESERVED3;

  union {
    __IOM uint32_t GCTL;                        /*!< I/O group control register                                                */

    struct {
      __IOM uint32_t GE0        : 1;            /*!< Analog I/O group x enable                                                 */
      __IOM uint32_t GE1        : 1;            /*!< Analog I/O group x enable                                                 */
      __IOM uint32_t GE2        : 1;            /*!< Analog I/O group x enable                                                 */
      __IOM uint32_t GE3        : 1;            /*!< Analog I/O group x enable                                                 */
      __IOM uint32_t GE4        : 1;            /*!< Analog I/O group x enable                                                 */
      __IOM uint32_t GE5        : 1;            /*!< Analog I/O group x enable                                                 */
            uint32_t            : 10;
      __IM  uint32_t GC0        : 1;            /*!< Analog I/O group x status                                                 */
      __IM  uint32_t GC1        : 1;            /*!< Analog I/O group x status                                                 */
      __IM  uint32_t GC2        : 1;            /*!< Analog I/O group x status                                                 */
      __IM  uint32_t GC3        : 1;            /*!< Analog I/O group x status                                                 */
      __IM  uint32_t GC4        : 1;            /*!< Analog I/O group x status                                                 */
      __IM  uint32_t GC5        : 1;            /*!< Analog I/O group x status                                                 */
            uint32_t            : 10;
    } GCTL_b;
  } ;

  union {
    __IM  uint32_t G0CYCN;                      /*!< I/O group x cycle number register                                         */

    struct {
      __IM  uint32_t CYCN       : 14;           /*!< Cycle number                                                              */
            uint32_t            : 18;
    } G0CYCN_b;
  } ;

  union {
    __IM  uint32_t G1CYCN;                      /*!< I/O group x cycle number register                                         */

    struct {
      __IM  uint32_t CYCN       : 14;           /*!< Cycle number                                                              */
            uint32_t            : 18;
    } G1CYCN_b;
  } ;

  union {
    __IM  uint32_t G2CYCN;                      /*!< I/O group x cycle number register                                         */

    struct {
      __IM  uint32_t CYCN       : 14;           /*!< Cycle number                                                              */
            uint32_t            : 18;
    } G2CYCN_b;
  } ;

  union {
    __IM  uint32_t G3CYCN;                      /*!< I/O group x cycle number register                                         */

