RIOT-OS/RIOT/cpu/gd32f3x0/include/gd32f3x0_periph.h
    struct {
      __IOM uint32_t ERRIE      : 1;            /*!< Error interrupt enable                                                    */
      __IOM uint32_t IREN       : 1;            /*!< IrDA mode enable                                                          */
      __IOM uint32_t IRLP       : 1;            /*!< IrDA low-power                                                            */
      __IOM uint32_t HDEN       : 1;            /*!< Half-duplex selection                                                     */
      __IOM uint32_t NKEN       : 1;            /*!< Smartcard NACK enable                                                     */
      __IOM uint32_t SCEN       : 1;            /*!< Smartcard mode enable                                                     */
      __IOM uint32_t DENR       : 1;            /*!< DMA enable receiver                                                       */
      __IOM uint32_t DENT       : 1;            /*!< DMA enable transmitter                                                    */
      __IOM uint32_t RTSEN      : 1;            /*!< RTS enable                                                                */
      __IOM uint32_t CTSEN      : 1;            /*!< CTS enable                                                                */
      __IOM uint32_t CTSIE      : 1;            /*!< CTS interrupt enable                                                      */
      __IOM uint32_t OSB        : 1;            /*!< One sample bit method enable                                              */
      __IOM uint32_t OVRD       : 1;            /*!< Overrun Disable                                                           */
      __IOM uint32_t DDRE       : 1;            /*!< DMA Disable on Reception Error                                            */
      __IOM uint32_t DEM        : 1;            /*!< Driver enable mode                                                        */
      __IOM uint32_t DEP        : 1;            /*!< Driver enable polarity selection                                          */
            uint32_t            : 1;
      __IOM uint32_t SCRTNUM    : 3;            /*!< Smartcard auto-retry count                                                */
      __IOM uint32_t WUM        : 2;            /*!< Wakeup from Stop mode interrupt flag selection                            */
      __IOM uint32_t WUIE       : 1;            /*!< Wakeup from Stop mode interrupt enable                                    */
            uint32_t            : 9;
    } CTL2_b;
  } ;

  union {
    __IOM uint32_t BAUD;                        /*!< Baud rate register                                                        */

    struct {
      __IOM uint32_t BRR_FRA    : 4;            /*!< integer of baud-rate divider                                              */
      __IOM uint32_t BRR_INT    : 12;           /*!< integer of baud-rate divider                                              */
            uint32_t            : 16;
    } BAUD_b;
  } ;

  union {
    __IOM uint32_t GP;                          /*!< Guard time and prescaler register                                         */

    struct {
      __IOM uint32_t PSC        : 8;            /*!< Prescaler value                                                           */
      __IOM uint32_t GUAT       : 8;            /*!< Guard time value                                                          */
            uint32_t            : 16;
    } GP_b;
  } ;

  union {
    __IOM uint32_t RT;                          /*!< Receiver timeout register                                                 */

    struct {
      __IOM uint32_t RT         : 24;           /*!< Receiver timeout value                                                    */
      __IOM uint32_t BL         : 8;            /*!< Block Length                                                              */
    } RT_b;
  } ;

  union {
    __OM  uint32_t CMD;                         /*!< Request register                                                          */

    struct {
      __OM  uint32_t ABDCMD     : 1;            /*!< Auto baud rate request                                                    */
      __OM  uint32_t SBKCMD     : 1;            /*!< Send break request                                                        */
      __OM  uint32_t MMCMD      : 1;            /*!< Mute mode request                                                         */
      __OM  uint32_t RXFCMD     : 1;            /*!< Receive data flush request                                                */
      __OM  uint32_t TXFCMD     : 1;            /*!< Transmit data flush request                                               */
            uint32_t            : 27;
    } CMD_b;
  } ;

  union {
    __IM  uint32_t STAT;                        /*!< Interrupt & status register                                               */

    struct {
      __IM  uint32_t PERR       : 1;            /*!< Parity error                                                              */
      __IM  uint32_t FERR       : 1;            /*!< Framing error                                                             */
      __IM  uint32_t NERR       : 1;            /*!< Noise detected flag                                                       */
      __IM  uint32_t ORERR      : 1;            /*!< Overrun error                                                             */
      __IM  uint32_t IDLEF      : 1;            /*!< Idle line detected                                                        */
      __IM  uint32_t RBNE       : 1;            /*!< Read data register not empty                                              */
      __IM  uint32_t TC         : 1;            /*!< Transmission complete                                                     */
      __IM  uint32_t TBE        : 1;            /*!< Transmit data register empty                                              */
      __IM  uint32_t LBDF       : 1;            /*!< LIN break detection flag                                                  */
      __IM  uint32_t CTSF       : 1;            /*!< CTS interrupt flag                                                        */
      __IM  uint32_t CTS        : 1;            /*!< CTS flag                                                                  */
      __IM  uint32_t RTF        : 1;            /*!< Receiver timeout                                                          */
      __IM  uint32_t EBF        : 1;            /*!< End of block flag                                                         */
            uint32_t            : 1;
      __IM  uint32_t ABDE       : 1;            /*!< Auto baud rate error                                                      */
      __IM  uint32_t ABDF       : 1;            /*!< Auto baud rate flag                                                       */
      __IM  uint32_t BSY        : 1;            /*!< Busy flag                                                                 */
      __IM  uint32_t AMF        : 1;            /*!< character match flag                                                      */
      __IM  uint32_t SBF        : 1;            /*!< Send break flag                                                           */
      __IM  uint32_t RWU        : 1;            /*!< Receiver wakeup from Mute mode                                            */
      __IM  uint32_t WUF        : 1;            /*!< Wakeup from Stop mode flag                                                */
      __IM  uint32_t TEA        : 1;            /*!< Transmit enable acknowledge flag                                          */
      __IM  uint32_t REA        : 1;            /*!< Receive enable acknowledge flag                                           */
            uint32_t            : 9;
    } STAT_b;
  } ;

  union {
    __OM  uint32_t INTC;                        /*!< Interrupt flag clear register                                             */

