RIOT-OS/RIOT/cpu/gd32f3x0/include/gd32f3x0_periph.h
    struct {
      __OM  uint32_t PEC        : 1;            /*!< Parity error clear flag                                                   */
      __OM  uint32_t FEC        : 1;            /*!< Framing error clear flag                                                  */
      __OM  uint32_t NEC        : 1;            /*!< Noise detected clear flag                                                 */
      __OM  uint32_t OREC       : 1;            /*!< Overrun error clear flag                                                  */
      __OM  uint32_t IDLEC      : 1;            /*!< Idle line detected clear flag                                             */
            uint32_t            : 1;
      __OM  uint32_t TCC        : 1;            /*!< Transmission complete clear flag                                          */
            uint32_t            : 1;
      __OM  uint32_t LBDC       : 1;            /*!< LIN break detection clear flag                                            */
      __OM  uint32_t CTSC       : 1;            /*!< CTS clear flag                                                            */
            uint32_t            : 1;
      __OM  uint32_t RTC        : 1;            /*!< Receiver timeout clear flag                                               */
      __OM  uint32_t EBC        : 1;            /*!< End of timeout clear flag                                                 */
            uint32_t            : 4;
      __OM  uint32_t AMC        : 1;            /*!< Character match clear flag                                                */
            uint32_t            : 2;
      __OM  uint32_t WUC        : 1;            /*!< Wakeup from Stop mode clear flag                                          */
            uint32_t            : 11;
    } INTC_b;
  } ;

  union {
    __IM  uint32_t RDATA;                       /*!< Receive data register                                                     */

    struct {
      __IM  uint32_t RDATA      : 9;            /*!< Receive data value                                                        */
            uint32_t            : 23;
    } RDATA_b;
  } ;

  union {
    __IOM uint32_t TDATA;                       /*!< Transmit data register                                                    */

    struct {
      __IOM uint32_t TDATA      : 9;            /*!< Transmit data value                                                       */
            uint32_t            : 23;
    } TDATA_b;
  } ;
  __IM  uint32_t  RESERVED[41];

  union {
    __IOM uint32_t RFCS;                        /*!< USART receive FIFO control and status register                            */

    struct {
      __IOM uint32_t ELNACK     : 1;            /*!< Early NKEN when smartcard mode is selected                                */
            uint32_t            : 7;
      __IOM uint32_t RFEN       : 1;            /*!< Receive FIFO enable                                                       */
      __IOM uint32_t RFFIE      : 1;            /*!< Receive FIFO full interrupt enable                                        */
      __IOM uint32_t RFE        : 1;            /*!< Receive FIFO empty flag                                                   */
      __IOM uint32_t RFF        : 1;            /*!< Receive FIFO full flag                                                    */
      __IOM uint32_t RFCNT      : 3;            /*!< Receive FIFO count number                                                 */
      __IOM uint32_t RFFINT     : 1;            /*!< Receive FIFO full interrupt flag                                          */
            uint32_t            : 16;
    } RFCS_b;
  } ;
} USART_Type;                                  /*!< Size = 212 (0xd4)                                                         */



/* =========================================================================================================================== */
/* ================                                       USBFS_GLOBAL                                        ================ */
/* =========================================================================================================================== */


/**
  * @brief USB full speed global registers (USBFS_GLOBAL)
  */

typedef struct {                                /*!< USBFS_GLOBAL Structure                                                    */

  union {
    __IOM uint32_t GOTGCS;                      /*!< Global OTG control and status register (USBFS_GOTGCS)                     */

    struct {
      __IM  uint32_t SRPS       : 1;            /*!< SRP success                                                               */
      __IOM uint32_t SRPREQ     : 1;            /*!< SRP request                                                               */
            uint32_t            : 6;
      __IM  uint32_t HNPS       : 1;            /*!< Host success                                                              */
      __IOM uint32_t HNPREQ     : 1;            /*!< HNP request                                                               */
      __IOM uint32_t HHNPEN     : 1;            /*!< Host HNP enable                                                           */
      __IOM uint32_t DHNPEN     : 1;            /*!< Device HNP enabled                                                        */
            uint32_t            : 4;
      __IM  uint32_t IDPS       : 1;            /*!< ID pin status                                                             */
      __IM  uint32_t DI         : 1;            /*!< Debounce interval                                                         */
      __IM  uint32_t ASV        : 1;            /*!< A-session valid                                                           */
      __IM  uint32_t BSV        : 1;            /*!< B-session valid                                                           */
            uint32_t            : 12;
    } GOTGCS_b;
  } ;

  union {
    __IOM uint32_t GOTGINTF;                    /*!< Global OTG interrupt flag register (USBFS_GOTGINTF)                       */

