RIOT-OS/RIOT/cpu/gd32f3x0/include/gd32f3x0_periph.h
    struct {
            uint32_t            : 2;
      __IOM uint32_t SESEND     : 1;            /*!< Session end                                                               */
            uint32_t            : 5;
      __IOM uint32_t SRPEND     : 1;            /*!< Session request success status change                                     */
      __IOM uint32_t HNPEND     : 1;            /*!< HNP end                                                                   */
            uint32_t            : 7;
      __IOM uint32_t HNPDET     : 1;            /*!< Host negotiation request detected                                         */
      __IOM uint32_t ADTO       : 1;            /*!< A-device timeout                                                          */
      __IOM uint32_t DF         : 1;            /*!< Debounce finish                                                           */
            uint32_t            : 12;
    } GOTGINTF_b;
  } ;

  union {
    __IOM uint32_t GAHBCS;                      /*!< Global AHB control and status register (USBFS_GAHBCS)                     */

    struct {
      __IOM uint32_t GINTEN     : 1;            /*!< Global interrupt enable                                                   */
            uint32_t            : 6;
      __IOM uint32_t TXFTH      : 1;            /*!< Tx FIFO threshold                                                         */
      __IOM uint32_t PTXFTH     : 1;            /*!< Periodic Tx FIFO threshold                                                */
            uint32_t            : 23;
    } GAHBCS_b;
  } ;

  union {
    __IOM uint32_t GUSBCS;                      /*!< Global USB control and status register (OTG_FS_GUSBCS)                    */

    struct {
      __IOM uint32_t TOC        : 3;            /*!< Timeout calibration                                                       */
            uint32_t            : 5;
      __IOM uint32_t SRPCEN     : 1;            /*!< SRP capability enable                                                     */
      __IOM uint32_t HNPCEN     : 1;            /*!< HNP capability enable                                                     */
      __IOM uint32_t UTT        : 4;            /*!< USB turnaround time                                                       */
            uint32_t            : 15;
      __IOM uint32_t FHM        : 1;            /*!< Force host mode                                                           */
      __IOM uint32_t FDM        : 1;            /*!< Force device mode                                                         */
            uint32_t            : 1;
    } GUSBCS_b;
  } ;

  union {
    __IOM uint32_t GRSTCTL;                     /*!< Global reset control register (USBFS_GRSTCTL)                             */

    struct {
      __IOM uint32_t CSRST      : 1;            /*!< Core soft reset                                                           */
      __IOM uint32_t HCSRST     : 1;            /*!< HCLK soft reset                                                           */
      __IOM uint32_t HFCRST     : 1;            /*!< Host frame counter reset                                                  */
            uint32_t            : 1;
      __IOM uint32_t RXFF       : 1;            /*!< RxFIFO flush                                                              */
      __IOM uint32_t TXFF       : 1;            /*!< TxFIFO flush                                                              */
      __IOM uint32_t TXFNUM     : 5;            /*!< TxFIFO number                                                             */
            uint32_t            : 21;
    } GRSTCTL_b;
  } ;

  union {
    __IOM uint32_t GINTF;                       /*!< Global interrupt flag register (USBFS_GINTF)                              */

    struct {
      __IM  uint32_t COPM       : 1;            /*!< Current operation mode                                                    */
      __IOM uint32_t MFIF       : 1;            /*!< Mode fault interrupt flag                                                 */
      __IM  uint32_t OTGIF      : 1;            /*!< OTG interrupt flag                                                        */
      __IOM uint32_t SOF        : 1;            /*!< Start of frame                                                            */
      __IM  uint32_t RXFNEIF    : 1;            /*!< RxFIFO non-empty interrupt flag                                           */
      __IM  uint32_t NPTXFEIF   : 1;            /*!< Non-periodic TxFIFO empty interrupt flag                                  */
      __IM  uint32_t GNPINAK    : 1;            /*!< Global Non-Periodic IN NAK effective                                      */
      __IM  uint32_t GONAK      : 1;            /*!< Global OUT NAK effective                                                  */
            uint32_t            : 2;
      __IOM uint32_t ESP        : 1;            /*!< Early suspend                                                             */
      __IOM uint32_t SP         : 1;            /*!< USB suspend                                                               */
      __IOM uint32_t RST        : 1;            /*!< USB reset                                                                 */
      __IOM uint32_t ENUMF      : 1;            /*!< Enumeration finished                                                      */
      __IOM uint32_t ISOOPDIF   : 1;            /*!< Isochronous OUT packet dropped interrupt                                  */
      __IOM uint32_t EOPFIF     : 1;            /*!< End of periodic frame interrupt flag                                      */
            uint32_t            : 2;
      __IM  uint32_t IEPIF      : 1;            /*!< IN endpoint interrupt flag                                                */
      __IM  uint32_t OEPIF      : 1;            /*!< OUT endpoint interrupt flag                                               */
      __IOM uint32_t ISOINCIF   : 1;            /*!< Isochronous IN transfer Not Complete Interrupt Flag                       */
      __IOM uint32_t PXNCIF_ISOONCIF : 1;       /*!< periodic transfer not complete interrupt flag(Host mode)/isochronous
                                                     OUT transfer not complete interrupt flag(Device mode)                     */
            uint32_t            : 2;
      __IM  uint32_t HPIF       : 1;            /*!< Host port interrupt flag                                                  */
      __IM  uint32_t HCIF       : 1;            /*!< Host channels interrupt flag                                              */
      __IM  uint32_t PTXFEIF    : 1;            /*!< Periodic TxFIFO empty interrupt flag                                      */
            uint32_t            : 1;
      __IOM uint32_t IDPSC      : 1;            /*!< ID pin status change                                                      */
      __IOM uint32_t DISCIF     : 1;            /*!< Disconnect interrupt flag                                                 */
      __IOM uint32_t SESIF      : 1;            /*!< Session interrupt flag                                                    */
      __IOM uint32_t WKUPIF     : 1;            /*!< Wakeup interrupt flag                                                     */
    } GINTF_b;
  } ;

  union {
    __IOM uint32_t GINTEN;                      /*!< Global interrupt enable register (USBFS_GINTEN)                           */

