RIOT-OS/RIOT/cpu/gd32f3x0/include/gd32f3x0_periph.h
    struct {
            uint32_t            : 1;
      __IOM uint32_t MFIE       : 1;            /*!< Mode fault interrupt enable                                               */
      __IOM uint32_t OTGIE      : 1;            /*!< OTG interrupt enable                                                      */
      __IOM uint32_t SOFIE      : 1;            /*!< Start of frame interrupt enable                                           */
      __IOM uint32_t RXFNEIE    : 1;            /*!< Receive FIFO non-empty interrupt enable                                   */
      __IOM uint32_t NPTXFEIE   : 1;            /*!< Non-periodic TxFIFO empty interrupt enable                                */
      __IOM uint32_t GNPINAKIE  : 1;            /*!< Global non-periodic IN NAK effective interrupt enable                     */
      __IOM uint32_t GONAKIE    : 1;            /*!< Global OUT NAK effective interrupt enable                                 */
            uint32_t            : 2;
      __IOM uint32_t ESPIE      : 1;            /*!< Early suspend interrupt enable                                            */
      __IOM uint32_t SPIE       : 1;            /*!< USB suspend interrupt enable                                              */
      __IOM uint32_t RSTIE      : 1;            /*!< USB reset interrupt enable                                                */
      __IOM uint32_t ENUMFIE    : 1;            /*!< Enumeration finish interrupt enable                                       */
      __IOM uint32_t ISOOPDIE   : 1;            /*!< Isochronous OUT packet dropped interrupt enable                           */
      __IOM uint32_t EOPFIE     : 1;            /*!< End of periodic frame interrupt enable                                    */
            uint32_t            : 2;
      __IOM uint32_t IEPIE      : 1;            /*!< IN endpoints interrupt enable                                             */
      __IOM uint32_t OEPIE      : 1;            /*!< OUT endpoints interrupt enable                                            */
      __IOM uint32_t ISOINCIE   : 1;            /*!< isochronous IN transfer not complete interrupt enable                     */
      __IOM uint32_t PXNCIE_ISOONCIE : 1;       /*!< periodic transfer not compelete Interrupt enable(Host mode)/isochronous
                                                     OUT transfer not complete interrupt enable(Device mode)                   */
            uint32_t            : 2;
      __IM  uint32_t HPIE       : 1;            /*!< Host port interrupt enable                                                */
      __IOM uint32_t HCIE       : 1;            /*!< Host channels interrupt enable                                            */
      __IOM uint32_t PTXFEIE    : 1;            /*!< Periodic TxFIFO empty interrupt enable                                    */
            uint32_t            : 1;
      __IOM uint32_t IDPSCIE    : 1;            /*!< ID pin status change interrupt enable                                     */
      __IOM uint32_t DISCIE     : 1;            /*!< Disconnect interrupt enable                                               */
      __IOM uint32_t SESIE      : 1;            /*!< Session interrupt enable                                                  */
      __IOM uint32_t WKUPIE     : 1;            /*!< Wakeup interrupt enable                                                   */
    } GINTEN_b;
  } ;

  union {
    union {
      __IM  uint32_t GRSTATR_Device;            /*!< Global Receive status read(Device mode)                                   */

      struct {
        __IM  uint32_t EPNUM    : 4;            /*!< Endpoint number                                                           */
        __IM  uint32_t BCOUNT   : 11;           /*!< Byte count                                                                */
        __IM  uint32_t DPID     : 2;            /*!< Data PID                                                                  */
        __IM  uint32_t RPCKST   : 4;            /*!< Recieve packet status                                                     */
              uint32_t          : 11;
      } GRSTATR_Device_b;
    } ;

    union {
      __IM  uint32_t GRSTATR_Host;              /*!< Global Receive status read(Host mode)                                     */

      struct {
        __IM  uint32_t CNUM     : 4;            /*!< Channel number                                                            */
        __IM  uint32_t BCOUNT   : 11;           /*!< Byte count                                                                */
        __IM  uint32_t DPID     : 2;            /*!< Data PID                                                                  */
        __IM  uint32_t RPCKST   : 4;            /*!< Reivece packet status                                                     */
              uint32_t          : 11;
      } GRSTATR_Host_b;
    } ;
  };

  union {
    union {
      __IM  uint32_t GRSTATP_Device;            /*!< Global Receive status pop(Device mode)                                    */

      struct {
        __IM  uint32_t EPNUM    : 4;            /*!< Endpoint number                                                           */
        __IM  uint32_t BCOUNT   : 11;           /*!< Byte count                                                                */
        __IM  uint32_t DPID     : 2;            /*!< Data PID                                                                  */
        __IM  uint32_t RPCKST   : 4;            /*!< Recieve packet status                                                     */
              uint32_t          : 11;
      } GRSTATP_Device_b;
    } ;

    union {
      __IM  uint32_t GRSTATP_Host;              /*!< Global Receive status pop(Host mode)                                      */

      struct {
        __IM  uint32_t CNUM     : 4;            /*!< Channel number                                                            */
        __IM  uint32_t BCOUNT   : 11;           /*!< Byte count                                                                */
        __IM  uint32_t DPID     : 2;            /*!< Data PID                                                                  */
        __IM  uint32_t RPCKST   : 4;            /*!< Reivece packet status                                                     */
              uint32_t          : 11;
      } GRSTATP_Host_b;
    } ;
  };

  union {
    __IOM uint32_t GRFLEN;                      /*!< Global Receive FIFO size register (USBFS_GRFLEN)                          */

