RIOT-OS/RIOT/cpu/gd32f3x0/include/gd32f3x0_periph.h
    struct {
      __IOM uint32_t RXFD       : 16;           /*!< Rx FIFO depth                                                             */
            uint32_t            : 16;
    } GRFLEN_b;
  } ;

  union {
    union {
      __IOM uint32_t HNPTFLEN;                  /*!< Host non-periodic transmit FIFO length register (Host mode)               */

      struct {
        __IOM uint32_t HNPTXRSAR : 16;          /*!< host non-periodic transmit Tx RAM start address                           */
        __IOM uint32_t HNPTXFD  : 16;           /*!< host non-periodic TxFIFO depth                                            */
      } HNPTFLEN_b;
    } ;

    union {
      __IOM uint32_t DIEP0TFLEN;                /*!< Device IN endpoint 0 transmit FIFO length (Device mode)                   */

      struct {
        __IOM uint32_t IEP0TXRSAR : 16;         /*!< in endpoint 0 Tx RAM start address                                        */
        __IOM uint32_t IEP0TXFD : 16;           /*!< in endpoint 0 Tx FIFO depth                                               */
      } DIEP0TFLEN_b;
    } ;
  };

  union {
    __IM  uint32_t HNPTFQSTAT;                  /*!< Host non-periodic transmit FIFO/queue status register (HNPTFQSTAT)        */

    struct {
      __IM  uint32_t NPTXFS     : 16;           /*!< Non-periodic TxFIFO space                                                 */
      __IM  uint32_t NPTXRQS    : 8;            /*!< Non-periodic transmit request queue space                                 */
      __IM  uint32_t NPTXRQTOP  : 7;            /*!< Top of the non-periodic transmit request queue                            */
            uint32_t            : 1;
    } HNPTFQSTAT_b;
  } ;
  __IM  uint32_t  RESERVED[2];

  union {
    __IOM uint32_t GCCFG;                       /*!< Global core configuration register (USBFS_GCCFG)                          */

    struct {
            uint32_t            : 16;
      __IOM uint32_t PWRON      : 1;            /*!< Power on                                                                  */
            uint32_t            : 1;
      __IOM uint32_t VBUSACEN   : 1;            /*!< The VBUS A-device Comparer enable                                         */
      __IOM uint32_t VBUSBCEN   : 1;            /*!< The VBUS B-device Comparer enable                                         */
      __IOM uint32_t SOFOEN     : 1;            /*!< SOF output enable                                                         */
      __IOM uint32_t VBUSIG     : 1;            /*!< VBUS ignored                                                              */
            uint32_t            : 10;
    } GCCFG_b;
  } ;

  union {
    __IOM uint32_t CID;                         /*!< core ID register                                                          */

    struct {
      __IOM uint32_t CID        : 32;           /*!< Core ID                                                                   */
    } CID_b;
  } ;
  __IM  uint32_t  RESERVED1[48];

  union {
    __IOM uint32_t HPTFLEN;                     /*!< Host periodic transmit FIFO length register (HPTFLEN)                     */

    struct {
      __IOM uint32_t HPTXFSAR   : 16;           /*!< Host periodic TxFIFO start address                                        */
      __IOM uint32_t HPTXFD     : 16;           /*!< Host periodic TxFIFO depth                                                */
    } HPTFLEN_b;
  } ;

  union {
    __IOM uint32_t DIEP1TFLEN;                  /*!< device IN endpoint transmit FIFO size register (DIEP1TFLEN)               */

    struct {
      __IOM uint32_t IEPTXRSAR  : 16;           /*!< IN endpoint FIFO transmit RAM start address                               */
      __IOM uint32_t IEPTXFD    : 16;           /*!< IN endpoint TxFIFO depth                                                  */
    } DIEP1TFLEN_b;
  } ;

  union {
    __IOM uint32_t DIEP2TFLEN;                  /*!< device IN endpoint transmit FIFO size register (DIEP2TFLEN)               */

    struct {
      __IOM uint32_t IEPTXRSAR  : 16;           /*!< IN endpoint FIFO transmit RAM start address                               */
      __IOM uint32_t IEPTXFD    : 16;           /*!< IN endpoint TxFIFO depth                                                  */
    } DIEP2TFLEN_b;
  } ;

  union {
    __IOM uint32_t DIEP3TFLEN;                  /*!< device IN endpoint transmit FIFO size register (FS_DIEP3TXFLEN)           */

    struct {
      __IOM uint32_t IEPTXRSAR  : 16;           /*!< IN endpoint FIFO4 transmit RAM start address                              */
      __IOM uint32_t IEPTXFD    : 16;           /*!< IN endpoint TxFIFO depth                                                  */
    } DIEP3TFLEN_b;
  } ;
} USBFS_GLOBAL_Type;                            /*!< Size = 272 (0x110)                                                        */



/* =========================================================================================================================== */
/* ================                                        USBFS_HOST                                         ================ */
/* =========================================================================================================================== */


/**
  * @brief USB on the go full speed host (USBFS_HOST)
  */

typedef struct {                                /*!< USBFS_HOST Structure                                                      */

  union {
    __IOM uint32_t HCTL;                        /*!< host configuration register (HCTL)                                        */

    struct {
      __IOM uint32_t CLKSEL     : 2;            /*!< clock select for USB clock                                                */
            uint32_t            : 30;
    } HCTL_b;
  } ;

  union {
    __IOM uint32_t HFT;                         /*!< Host frame interval register                                              */

    struct {
      __IOM uint32_t FRI        : 16;           /*!< Frame interval                                                            */
            uint32_t            : 16;
    } HFT_b;
  } ;

  union {
    __IM  uint32_t HFINFR;                      /*!< OTG_FS host frame number/frame time remaining register (HFINFR)           */

