RIOT-OS/RIOT/cpu/gd32f3x0/include/gd32f3x0_periph.h
    struct {
      __IM  uint32_t FRNUM      : 16;           /*!< Frame number                                                              */
      __IM  uint32_t FRT        : 16;           /*!< Frame remaining time                                                      */
    } HFINFR_b;
  } ;
  __IM  uint32_t  RESERVED;

  union {
    __IOM uint32_t HPTFQSTAT;                   /*!< Host periodic transmit FIFO/queue status register (HPTFQSTAT)             */

    struct {
      __IM  uint32_t PTXFS      : 16;           /*!< Periodic transmit data FIFO space available                               */
      __IM  uint32_t PTXREQS    : 8;            /*!< Periodic transmit request queue space available                           */
      __IM  uint32_t PTXREQT    : 8;            /*!< Top of the periodic transmit request queue                                */
    } HPTFQSTAT_b;
  } ;

  union {
    __IM  uint32_t HACHINT;                     /*!< Host all channels interrupt register                                      */

    struct {
      __IM  uint32_t HACHINT    : 8;            /*!< Host all channel interrupts                                               */
            uint32_t            : 24;
    } HACHINT_b;
  } ;

  union {
    __IOM uint32_t HACHINTEN;                   /*!< host all channels interrupt mask register                                 */

    struct {
      __IOM uint32_t CINTEN     : 8;            /*!< Channel interrupt enable                                                  */
            uint32_t            : 24;
    } HACHINTEN_b;
  } ;
  __IM  uint32_t  RESERVED1[9];

  union {
    __IOM uint32_t HPCS;                        /*!< Host port control and status register (USBFS_HPCS)                        */

    struct {
      __IM  uint32_t PCST       : 1;            /*!< Port connect status                                                       */
      __IOM uint32_t PCD        : 1;            /*!< Port connect detected                                                     */
      __IOM uint32_t PE         : 1;            /*!< Port enable                                                               */
      __IOM uint32_t PEDC       : 1;            /*!< Port enable/disable change                                                */
            uint32_t            : 2;
      __IOM uint32_t PREM       : 1;            /*!< Port resume                                                               */
      __IOM uint32_t PSP        : 1;            /*!< Port suspend                                                              */
      __IOM uint32_t PRST       : 1;            /*!< Port reset                                                                */
            uint32_t            : 1;
      __IM  uint32_t PLST       : 2;            /*!< Port line status                                                          */
      __IOM uint32_t PP         : 1;            /*!< Port power                                                                */
            uint32_t            : 4;
      __IM  uint32_t PS         : 2;            /*!< Port speed                                                                */
            uint32_t            : 13;
    } HPCS_b;
  } ;
  __IM  uint32_t  RESERVED2[47];

  union {
    __IOM uint32_t HCH0CTL;                     /*!< host channel-0 characteristics register (HCH0CTL)                         */

    struct {
      __IOM uint32_t MPL        : 11;           /*!< Maximum packet size                                                       */
      __IOM uint32_t EPNUM      : 4;            /*!< Endpoint number                                                           */
      __IOM uint32_t EPDIR      : 1;            /*!< Endpoint direction                                                        */
            uint32_t            : 1;
      __IOM uint32_t LSD        : 1;            /*!< Low-speed device                                                          */
      __IOM uint32_t EPTYPE     : 2;            /*!< Endpoint type                                                             */
            uint32_t            : 2;
      __IOM uint32_t DAR        : 7;            /*!< Device address                                                            */
      __IOM uint32_t ODDFRM     : 1;            /*!< Odd frame                                                                 */
      __IOM uint32_t CDIS       : 1;            /*!< Channel disable                                                           */
      __IOM uint32_t CEN        : 1;            /*!< Channel enable                                                            */
    } HCH0CTL_b;
  } ;
  __IM  uint32_t  RESERVED3;

  union {
    __IOM uint32_t HCH0INTF;                    /*!< host channel-0 interrupt register (USBFS_HCHxINTF)                        */

    struct {
      __IOM uint32_t TF         : 1;            /*!< Transfer finished                                                         */
      __IOM uint32_t CH         : 1;            /*!< Channel halted                                                            */
            uint32_t            : 1;
      __IOM uint32_t STALL      : 1;            /*!< STALL response received interrupt                                         */
      __IOM uint32_t NAK        : 1;            /*!< NAK response received interrupt                                           */
      __IOM uint32_t ACK        : 1;            /*!< ACK response received/transmitted interrupt                               */
            uint32_t            : 1;
      __IOM uint32_t USBER      : 1;            /*!< USB bus error                                                             */
      __IOM uint32_t BBER       : 1;            /*!< Babble error                                                              */
      __IOM uint32_t REQOVR     : 1;            /*!< Request queue overrun                                                     */
      __IOM uint32_t DTER       : 1;            /*!< Data toggle error                                                         */
            uint32_t            : 21;
    } HCH0INTF_b;
  } ;

  union {
    __IOM uint32_t HCH0INTEN;                   /*!< host channel-0 interrupt enable register (HCH0INTEN)                      */

