RIOT-OS/RIOT/cpu/gd32f3x0/include/gd32f3x0_periph.h
    struct {
      __IOM uint32_t TFIE       : 1;            /*!< Transfer completed interrupt enable                                       */
      __IOM uint32_t CHIE       : 1;            /*!< Channel halted interrupt enable                                           */
            uint32_t            : 1;
      __IOM uint32_t STALLIE    : 1;            /*!< STALL interrupt enable                                                    */
      __IOM uint32_t NAKIE      : 1;            /*!< NAK interrupt enable                                                      */
      __IOM uint32_t ACKIE      : 1;            /*!< ACK interrupt enable                                                      */
            uint32_t            : 1;
      __IOM uint32_t USBERIE    : 1;            /*!< USB bus error interrupt enable                                            */
      __IOM uint32_t BBERIE     : 1;            /*!< Babble error interrupt enable                                             */
      __IOM uint32_t REQOVRIE   : 1;            /*!< request queue overrun interrupt enable                                    */
      __IOM uint32_t DTERIE     : 1;            /*!< Data toggle error interrupt enable                                        */
            uint32_t            : 21;
    } HCH0INTEN_b;
  } ;

  union {
    __IOM uint32_t HCH0LEN;                     /*!< host channel-0 transfer length register                                   */

    struct {
      __IOM uint32_t TLEN       : 19;           /*!< Transfer length                                                           */
      __IOM uint32_t PCNT       : 10;           /*!< Packet count                                                              */
      __IOM uint32_t DPID       : 2;            /*!< Data PID                                                                  */
            uint32_t            : 1;
    } HCH0LEN_b;
  } ;
  __IM  uint32_t  RESERVED4[3];

  union {
    __IOM uint32_t HCH1CTL;                     /*!< host channel-1 characteristics register (HCH1CTL)                         */

    struct {
      __IOM uint32_t MPL        : 11;           /*!< Maximum packet size                                                       */
      __IOM uint32_t EPNUM      : 4;            /*!< Endpoint number                                                           */
      __IOM uint32_t EPDIR      : 1;            /*!< Endpoint direction                                                        */
            uint32_t            : 1;
      __IOM uint32_t LSD        : 1;            /*!< Low-speed device                                                          */
      __IOM uint32_t EPTYPE     : 2;            /*!< Endpoint type                                                             */
            uint32_t            : 2;
      __IOM uint32_t DAR        : 7;            /*!< Device address                                                            */
      __IOM uint32_t ODDFRM     : 1;            /*!< Odd frame                                                                 */
      __IOM uint32_t CDIS       : 1;            /*!< Channel disable                                                           */
      __IOM uint32_t CEN        : 1;            /*!< Channel enable                                                            */
    } HCH1CTL_b;
  } ;
  __IM  uint32_t  RESERVED5;

  union {
    __IOM uint32_t HCH1INTF;                    /*!< host channel-1 interrupt register (HCH1INTF)                              */

    struct {
      __IOM uint32_t TF         : 1;            /*!< Transfer finished                                                         */
      __IOM uint32_t CH         : 1;            /*!< Channel halted                                                            */
            uint32_t            : 1;
      __IOM uint32_t STALL      : 1;            /*!< STALL response received interrupt                                         */
      __IOM uint32_t NAK        : 1;            /*!< NAK response received interrupt                                           */
      __IOM uint32_t ACK        : 1;            /*!< ACK response received/transmitted interrupt                               */
            uint32_t            : 1;
      __IOM uint32_t USBER      : 1;            /*!< USB bus error                                                             */
      __IOM uint32_t BBER       : 1;            /*!< Babble error                                                              */
      __IOM uint32_t REQOVR     : 1;            /*!< Request queue overrun                                                     */
      __IOM uint32_t DTER       : 1;            /*!< Data toggle error                                                         */
            uint32_t            : 21;
    } HCH1INTF_b;
  } ;

  union {
    __IOM uint32_t HCH1INTEN;                   /*!< host channel-1 interrupt enable register (HCH1INTEN)                      */

    struct {
      __IOM uint32_t TFIE       : 1;            /*!< Transfer completed interrupt enable                                       */
      __IOM uint32_t CHIE       : 1;            /*!< Channel halted interrupt enable                                           */
            uint32_t            : 1;
      __IOM uint32_t STALLIE    : 1;            /*!< STALL interrupt enable                                                    */
      __IOM uint32_t NAKIE      : 1;            /*!< NAK interrupt enable                                                      */
      __IOM uint32_t ACKIE      : 1;            /*!< ACK interrupt enable                                                      */
            uint32_t            : 1;
      __IOM uint32_t USBERIE    : 1;            /*!< USB bus error interrupt enable                                            */
      __IOM uint32_t BBERIE     : 1;            /*!< Babble error interrupt enable                                             */
      __IOM uint32_t REQOVRIE   : 1;            /*!< request queue overrun interrupt enable                                    */
      __IOM uint32_t DTERIE     : 1;            /*!< Data toggle error interrupt enable                                        */
            uint32_t            : 21;
    } HCH1INTEN_b;
  } ;

  union {
    __IOM uint32_t HCH1LEN;                     /*!< host channel-1 transfer length register                                   */

