RIOT-OS/RIOT/cpu/gd32f3x0/include/gd32f3x0_periph.h
    struct {
      __IOM uint32_t TF         : 1;            /*!< Transfer finished                                                         */
      __IOM uint32_t CH         : 1;            /*!< Channel halted                                                            */
            uint32_t            : 1;
      __IOM uint32_t STALL      : 1;            /*!< STALL response received interrupt                                         */
      __IOM uint32_t NAK        : 1;            /*!< NAK response received interrupt                                           */
      __IOM uint32_t ACK        : 1;            /*!< ACK response received/transmitted interrupt                               */
            uint32_t            : 1;
      __IOM uint32_t USBER      : 1;            /*!< USB bus error                                                             */
      __IOM uint32_t BBER       : 1;            /*!< Babble error                                                              */
      __IOM uint32_t REQOVR     : 1;            /*!< Request queue overrun                                                     */
      __IOM uint32_t DTER       : 1;            /*!< Data toggle error                                                         */
            uint32_t            : 21;
    } HCH7INTF_b;
  } ;

  union {
    __IOM uint32_t HCH7INTEN;                   /*!< host channel-7 interrupt enable register (HCH7INTEN)                      */

    struct {
      __IOM uint32_t TFIE       : 1;            /*!< Transfer completed interrupt enable                                       */
      __IOM uint32_t CHIE       : 1;            /*!< Channel halted interrupt enable                                           */
            uint32_t            : 1;
      __IOM uint32_t STALLIE    : 1;            /*!< STALL interrupt enable                                                    */
      __IOM uint32_t NAKIE      : 1;            /*!< NAK interrupt enable                                                      */
      __IOM uint32_t ACKIE      : 1;            /*!< ACK interrupt enable                                                      */
            uint32_t            : 1;
      __IOM uint32_t USBERIE    : 1;            /*!< USB bus error interrupt enable                                            */
      __IOM uint32_t BBERIE     : 1;            /*!< Babble error interrupt enable                                             */
      __IOM uint32_t REQOVRIE   : 1;            /*!< request queue overrun interrupt enable                                    */
      __IOM uint32_t DTERIE     : 1;            /*!< Data toggle error interrupt enable                                        */
            uint32_t            : 21;
    } HCH7INTEN_b;
  } ;

  union {
    __IOM uint32_t HCH7LEN;                     /*!< host channel-7 transfer length register                                   */

    struct {
      __IOM uint32_t TLEN       : 19;           /*!< Transfer length                                                           */
      __IOM uint32_t PCNT       : 10;           /*!< Packet count                                                              */
      __IOM uint32_t DPID       : 2;            /*!< Data PID                                                                  */
            uint32_t            : 1;
    } HCH7LEN_b;
  } ;
} USBFS_HOST_Type;                              /*!< Size = 500 (0x1f4)                                                        */



/* =========================================================================================================================== */
/* ================                                       USBFS_DEVICE                                        ================ */
/* =========================================================================================================================== */


/**
  * @brief USB on the go full speed device (USBFS_DEVICE)
  */

typedef struct {                                /*!< USBFS_DEVICE Structure                                                    */

  union {
    __IOM uint32_t DCFG;                        /*!< device configuration register (DCFG)                                      */

    struct {
      __IOM uint32_t DS         : 2;            /*!< Device speed                                                              */
      __IOM uint32_t NZLSOH     : 1;            /*!< Non-zero-length status OUT handshake                                      */
            uint32_t            : 1;
      __IOM uint32_t DAR        : 7;            /*!< Device address                                                            */
      __IOM uint32_t EOPFT      : 2;            /*!< end of periodic frame time                                                */
            uint32_t            : 19;
    } DCFG_b;
  } ;

  union {
    __IOM uint32_t DCTL;                        /*!< device control register (DCTL)                                            */

    struct {
      __IOM uint32_t RWKUP      : 1;            /*!< Remote wakeup                                                             */
      __IOM uint32_t SD         : 1;            /*!< Soft disconnect                                                           */
      __IM  uint32_t GINS       : 1;            /*!< Global IN NAK status                                                      */
      __IM  uint32_t GONS       : 1;            /*!< Global OUT NAK status                                                     */
            uint32_t            : 3;
      __OM  uint32_t SGINAK     : 1;            /*!< Set global IN NAK                                                         */
      __OM  uint32_t CGINAK     : 1;            /*!< Clear global IN NAK                                                       */
      __OM  uint32_t SGONAK     : 1;            /*!< Set global OUT NAK                                                        */
      __OM  uint32_t CGONAK     : 1;            /*!< Clear global OUT NAK                                                      */
      __IOM uint32_t POIF       : 1;            /*!< Power-on initialization flag                                              */
            uint32_t            : 20;
    } DCTL_b;
  } ;

  union {
    __IM  uint32_t DSTAT;                       /*!< device status register (DSTAT)                                            */

