RIOT-OS/RIOT/cpu/gd32f3x0/include/gd32f3x0_periph.h
    struct {
      __IM  uint32_t SPST       : 1;            /*!< Suspend status                                                            */
      __IM  uint32_t ES         : 2;            /*!< Enumerated speed                                                          */
            uint32_t            : 5;
      __IM  uint32_t FNRSOF     : 14;           /*!< Frame number of the received SOF                                          */
            uint32_t            : 10;
    } DSTAT_b;
  } ;
  __IM  uint32_t  RESERVED;

  union {
    __IOM uint32_t DIEPINTEN;                   /*!< device IN endpoint common interrupt mask register (DIEPINTEN)             */

    struct {
      __IOM uint32_t TFEN       : 1;            /*!< Transfer finished interrupt enable                                        */
      __IOM uint32_t EPDISEN    : 1;            /*!< Endpoint disabled interrupt enable                                        */
            uint32_t            : 1;
      __IOM uint32_t CITOEN     : 1;            /*!< Control IN timeout condition interrupt enable (Non-isochronous
                                                     endpoints)                                                                */
      __IOM uint32_t EPTXFUDEN  : 1;            /*!< Endpoint Tx FIFO underrun interrupt enable bit                            */
            uint32_t            : 1;
      __IOM uint32_t IEPNEEN    : 1;            /*!< IN endpoint NAK effective interrupt enable                                */
            uint32_t            : 25;
    } DIEPINTEN_b;
  } ;

  union {
    __IOM uint32_t DOEPINTEN;                   /*!< device OUT endpoint common interrupt enable register (DOEPINTEN)          */

    struct {
      __IOM uint32_t TFEN       : 1;            /*!< Transfer finished interrupt enable                                        */
      __IOM uint32_t EPDISEN    : 1;            /*!< Endpoint disabled interrupt enable                                        */
            uint32_t            : 1;
      __IOM uint32_t STPFEN     : 1;            /*!< SETUP phase finished interrupt enable                                     */
      __IOM uint32_t EPRXFOVREN : 1;            /*!< Endpoint Rx FIFO overrun interrupt enable                                 */
            uint32_t            : 1;
      __IOM uint32_t BTBSTPEN   : 1;            /*!< Back-to-back SETUP packets interrupt enable                               */
            uint32_t            : 25;
    } DOEPINTEN_b;
  } ;

  union {
    __IM  uint32_t DAEPINT;                     /*!< device all endpoints interrupt register (DAEPINT)                         */

    struct {
      __IM  uint32_t IEPITB     : 4;            /*!< Device all IN endpoint interrupt bits                                     */
            uint32_t            : 12;
      __IM  uint32_t OEPITB     : 4;            /*!< Device all OUT endpoint interrupt bits                                    */
            uint32_t            : 12;
    } DAEPINT_b;
  } ;

  union {
    __IOM uint32_t DAEPINTEN;                   /*!< Device all endpoints interrupt enable register (DAEPINTEN)                */

    struct {
      __IOM uint32_t IEPIE      : 4;            /*!< IN EP interrupt interrupt enable bits                                     */
            uint32_t            : 12;
      __IOM uint32_t OEPIE      : 4;            /*!< OUT endpoint interrupt enable bits                                        */
            uint32_t            : 12;
    } DAEPINTEN_b;
  } ;
  __IM  uint32_t  RESERVED1[2];

  union {
    __IOM uint32_t DVBUSDT;                     /*!< device VBUS discharge time register                                       */

    struct {
      __IOM uint32_t DVBUSDT    : 16;           /*!< Device VBUS discharge time                                                */
            uint32_t            : 16;
    } DVBUSDT_b;
  } ;

  union {
    __IOM uint32_t DVBUSPT;                     /*!< device VBUS pulsing time register                                         */

    struct {
      __IOM uint32_t DVBUSPT    : 12;           /*!< Device VBUS pulsing time                                                  */
            uint32_t            : 20;
    } DVBUSPT_b;
  } ;
  __IM  uint32_t  RESERVED2;

  union {
    __IOM uint32_t DIEPFEINTEN;                 /*!< device IN endpoint FIFO empty interrupt enable register                   */

    struct {
      __IOM uint32_t IEPTXFEIE  : 4;            /*!< IN EP Tx FIFO empty interrupt enable bits                                 */
            uint32_t            : 28;
    } DIEPFEINTEN_b;
  } ;
  __IM  uint32_t  RESERVED3[50];

  union {
    __IOM uint32_t DIEP0CTL;                    /*!< device IN endpoint 0 control register (DIEP0CTL)                          */

    struct {
      __IOM uint32_t MPL        : 2;            /*!< Maximum packet length                                                     */
            uint32_t            : 13;
      __IM  uint32_t EPACT      : 1;            /*!< endpoint active                                                           */
            uint32_t            : 1;
      __IM  uint32_t NAKS       : 1;            /*!< NAK status                                                                */
      __IM  uint32_t EPTYPE     : 2;            /*!< Endpoint type                                                             */
            uint32_t            : 1;
      __IOM uint32_t STALL      : 1;            /*!< STALL handshake                                                           */
      __IOM uint32_t TXFNUM     : 4;            /*!< TxFIFO number                                                             */
      __OM  uint32_t CNAK       : 1;            /*!< Clear NAK                                                                 */
      __OM  uint32_t SNAK       : 1;            /*!< Set NAK                                                                   */
            uint32_t            : 2;
      __IOM uint32_t EPD        : 1;            /*!< Endpoint disable                                                          */
      __IOM uint32_t EPEN       : 1;            /*!< Endpoint enable                                                           */
    } DIEP0CTL_b;
  } ;
  __IM  uint32_t  RESERVED4;

  union {
    __IOM uint32_t DIEP0INTF;                   /*!< device endpoint-0 interrupt register                                      */

