RIOT-OS/RIOT/cpu/gd32f3x0/include/gd32f3x0_periph.h
    struct {
      __IOM uint32_t TF         : 1;            /*!< Transfer finished                                                         */
      __IOM uint32_t EPDIS      : 1;            /*!< Endpoint finished                                                         */
            uint32_t            : 1;
      __IOM uint32_t CITO       : 1;            /*!< Control in timeout interrupt                                              */
      __IOM uint32_t EPTXFUD    : 1;            /*!< Endpoint Tx FIFO underrun                                                 */
            uint32_t            : 1;
      __IOM uint32_t IEPNE      : 1;            /*!< IN endpoint NAK effective                                                 */
      __IM  uint32_t TXFE       : 1;            /*!< Transmit FIFO empty                                                       */
            uint32_t            : 24;
    } DIEP0INTF_b;
  } ;
  __IM  uint32_t  RESERVED5;

  union {
    __IOM uint32_t DIEP0LEN;                    /*!< device IN endpoint-0 transfer length register                             */

    struct {
      __IOM uint32_t TLEN       : 7;            /*!< Transfer length                                                           */
            uint32_t            : 12;
      __IOM uint32_t PCNT       : 2;            /*!< Packet count                                                              */
            uint32_t            : 11;
    } DIEP0LEN_b;
  } ;
  __IM  uint32_t  RESERVED6;

  union {
    __IM  uint32_t DIEP0TFSTAT;                 /*!< device IN endpoint 0 transmit FIFO status register                        */

    struct {
      __IM  uint32_t IEPTFS     : 16;           /*!< IN endpoint TxFIFO space remaining                                        */
            uint32_t            : 16;
    } DIEP0TFSTAT_b;
  } ;
  __IM  uint32_t  RESERVED7;

  union {
    __IOM uint32_t DIEP1CTL;                    /*!< device in endpoint-1 control register                                     */

    struct {
      __IOM uint32_t MPL        : 11;           /*!< maximum packet length                                                     */
            uint32_t            : 4;
      __IOM uint32_t EPACT      : 1;            /*!< Endpoint active                                                           */
      __IM  uint32_t EOFRM_DPID : 1;            /*!< EOFRM/DPID                                                                */
      __IM  uint32_t NAKS       : 1;            /*!< NAK status                                                                */
      __IOM uint32_t EPTYPE     : 2;            /*!< Endpoint type                                                             */
            uint32_t            : 1;
      __IOM uint32_t STALL      : 1;            /*!< STALL handshake                                                           */
      __IOM uint32_t TXFNUM     : 4;            /*!< Tx FIFO number                                                            */
      __OM  uint32_t CNAK       : 1;            /*!< Clear NAK                                                                 */
      __OM  uint32_t SNAK       : 1;            /*!< Set NAK                                                                   */
      __OM  uint32_t SD0PID_SEVENFRM : 1;       /*!< SD0PID/SEVNFRM                                                            */
      __OM  uint32_t SD1PID_SODDFRM : 1;        /*!< Set DATA1 PID/Set odd frame                                               */
      __IOM uint32_t EPD        : 1;            /*!< Endpoint disable                                                          */
      __IOM uint32_t EPEN       : 1;            /*!< Endpoint enable                                                           */
    } DIEP1CTL_b;
  } ;
  __IM  uint32_t  RESERVED8;

  union {
    __IOM uint32_t DIEP1INTF;                   /*!< device endpoint-1 interrupt register                                      */

    struct {
      __IOM uint32_t TF         : 1;            /*!< Transfer finished                                                         */
      __IOM uint32_t EPDIS      : 1;            /*!< Endpoint finished                                                         */
            uint32_t            : 1;
      __IOM uint32_t CITO       : 1;            /*!< Control in timeout interrupt                                              */
      __IOM uint32_t EPTXFUD    : 1;            /*!< Endpoint Tx FIFO underrun                                                 */
            uint32_t            : 1;
      __IOM uint32_t IEPNE      : 1;            /*!< IN endpoint NAK effective                                                 */
      __IM  uint32_t TXFE       : 1;            /*!< Transmit FIFO empty                                                       */
            uint32_t            : 24;
    } DIEP1INTF_b;
  } ;
  __IM  uint32_t  RESERVED9;

  union {
    __IOM uint32_t DIEP1LEN;                    /*!< device IN endpoint-1 transfer length register                             */

    struct {
      __IOM uint32_t TLEN       : 19;           /*!< Transfer length                                                           */
      __IOM uint32_t PCNT       : 10;           /*!< Packet count                                                              */
      __IOM uint32_t MCPF       : 2;            /*!< Multi packet count per frame                                              */
            uint32_t            : 1;
    } DIEP1LEN_b;
  } ;
  __IM  uint32_t  RESERVED10;

  union {
    __IM  uint32_t DIEP1TFSTAT;                 /*!< device IN endpoint 1 transmit FIFO status register                        */

    struct {
      __IM  uint32_t IEPTFS     : 16;           /*!< IN endpoint TxFIFO space remaining                                        */
            uint32_t            : 16;
    } DIEP1TFSTAT_b;
  } ;
  __IM  uint32_t  RESERVED11;

  union {
    __IOM uint32_t DIEP2CTL;                    /*!< device endpoint-2 control register                                        */

