RIOT-OS/RIOT/cpu/gd32f3x0/include/gd32f3x0_periph.h
    struct {
      __IOM uint32_t MPL        : 11;           /*!< maximum packet length                                                     */
            uint32_t            : 4;
      __IOM uint32_t EPACT      : 1;            /*!< Endpoint active                                                           */
      __IM  uint32_t EOFRM_DPID : 1;            /*!< EOFRM/DPID                                                                */
      __IM  uint32_t NAKS       : 1;            /*!< NAK status                                                                */
      __IOM uint32_t EPTYPE     : 2;            /*!< Endpoint type                                                             */
            uint32_t            : 1;
      __IOM uint32_t STALL      : 1;            /*!< STALL handshake                                                           */
      __IOM uint32_t TXFNUM     : 4;            /*!< Tx FIFO number                                                            */
      __OM  uint32_t CNAK       : 1;            /*!< Clear NAK                                                                 */
      __OM  uint32_t SNAK       : 1;            /*!< Set NAK                                                                   */
      __OM  uint32_t SD0PID_SEVENFRM : 1;       /*!< SD0PID/SEVNFRM                                                            */
      __OM  uint32_t SD1PID_SODDFRM : 1;        /*!< Set DATA1 PID/Set odd frame                                               */
      __IOM uint32_t EPD        : 1;            /*!< Endpoint disable                                                          */
      __IOM uint32_t EPEN       : 1;            /*!< Endpoint enable                                                           */
    } DIEP2CTL_b;
  } ;
  __IM  uint32_t  RESERVED12;

  union {
    __IOM uint32_t DIEP2INTF;                   /*!< device endpoint-2 interrupt register                                      */

    struct {
      __IOM uint32_t TF         : 1;            /*!< Transfer finished                                                         */
      __IOM uint32_t EPDIS      : 1;            /*!< Endpoint finished                                                         */
            uint32_t            : 1;
      __IOM uint32_t CITO       : 1;            /*!< Control in timeout interrupt                                              */
      __IOM uint32_t EPTXFUD    : 1;            /*!< Endpoint Tx FIFO underrun                                                 */
            uint32_t            : 1;
      __IOM uint32_t IEPNE      : 1;            /*!< IN endpoint NAK effective                                                 */
      __IM  uint32_t TXFE       : 1;            /*!< Transmit FIFO empty                                                       */
            uint32_t            : 24;
    } DIEP2INTF_b;
  } ;
  __IM  uint32_t  RESERVED13;

  union {
    __IOM uint32_t DIEP2LEN;                    /*!< device IN endpoint-2 transfer length register                             */

    struct {
      __IOM uint32_t TLEN       : 19;           /*!< Transfer length                                                           */
      __IOM uint32_t PCNT       : 10;           /*!< Packet count                                                              */
      __IOM uint32_t MCPF       : 2;            /*!< Multi packet count per frame                                              */
            uint32_t            : 1;
    } DIEP2LEN_b;
  } ;
  __IM  uint32_t  RESERVED14;

  union {
    __IM  uint32_t DIEP2TFSTAT;                 /*!< device IN endpoint 2 transmit FIFO status register                        */

    struct {
      __IM  uint32_t IEPTFS     : 16;           /*!< IN endpoint TxFIFO space remaining                                        */
            uint32_t            : 16;
    } DIEP2TFSTAT_b;
  } ;
  __IM  uint32_t  RESERVED15;

  union {
    __IOM uint32_t DIEP3CTL;                    /*!< device endpoint-3 control register                                        */

    struct {
      __IOM uint32_t MPL        : 11;           /*!< maximum packet length                                                     */
            uint32_t            : 4;
      __IOM uint32_t EPACT      : 1;            /*!< Endpoint active                                                           */
      __IM  uint32_t EOFRM_DPID : 1;            /*!< EOFRM/DPID                                                                */
      __IM  uint32_t NAKS       : 1;            /*!< NAK status                                                                */
      __IOM uint32_t EPTYPE     : 2;            /*!< Endpoint type                                                             */
            uint32_t            : 1;
      __IOM uint32_t STALL      : 1;            /*!< STALL handshake                                                           */
      __IOM uint32_t TXFNUM     : 4;            /*!< Tx FIFO number                                                            */
      __OM  uint32_t CNAK       : 1;            /*!< Clear NAK                                                                 */
      __OM  uint32_t SNAK       : 1;            /*!< Set NAK                                                                   */
      __OM  uint32_t SD0PID_SEVENFRM : 1;       /*!< SD0PID/SEVNFRM                                                            */
      __OM  uint32_t SD1PID_SODDFRM : 1;        /*!< Set DATA1 PID/Set odd frame                                               */
      __IOM uint32_t EPD        : 1;            /*!< Endpoint disable                                                          */
      __IOM uint32_t EPEN       : 1;            /*!< Endpoint enable                                                           */
    } DIEP3CTL_b;
  } ;
  __IM  uint32_t  RESERVED16;

  union {
    __IOM uint32_t DIEP3INTF;                   /*!< device endpoint-3 interrupt register                                      */

