RIOT-OS/RIOT/cpu/gd32f3x0/include/gd32f3x0_periph.h
    struct {
      __IOM uint32_t TF         : 1;            /*!< Transfer finished                                                         */
      __IOM uint32_t EPDIS      : 1;            /*!< Endpoint finished                                                         */
            uint32_t            : 1;
      __IOM uint32_t CITO       : 1;            /*!< Control in timeout interrupt                                              */
      __IOM uint32_t EPTXFUD    : 1;            /*!< Endpoint Tx FIFO underrun                                                 */
            uint32_t            : 1;
      __IOM uint32_t IEPNE      : 1;            /*!< IN endpoint NAK effective                                                 */
      __IM  uint32_t TXFE       : 1;            /*!< Transmit FIFO empty                                                       */
            uint32_t            : 24;
    } DIEP3INTF_b;
  } ;
  __IM  uint32_t  RESERVED17;

  union {
    __IOM uint32_t DIEP3LEN;                    /*!< device IN endpoint-3 transfer length register                             */

    struct {
      __IOM uint32_t TLEN       : 19;           /*!< Transfer length                                                           */
      __IOM uint32_t PCNT       : 10;           /*!< Packet count                                                              */
      __IOM uint32_t MCPF       : 2;            /*!< Multi packet count per frame                                              */
            uint32_t            : 1;
    } DIEP3LEN_b;
  } ;
  __IM  uint32_t  RESERVED18;

  union {
    __IM  uint32_t DIEP3TFSTAT;                 /*!< device IN endpoint 3 transmit FIFO status register                        */

    struct {
      __IM  uint32_t IEPTFS     : 16;           /*!< IN endpoint TxFIFO space remaining                                        */
            uint32_t            : 16;
    } DIEP3TFSTAT_b;
  } ;
  __IM  uint32_t  RESERVED19[97];

  union {
    __IOM uint32_t DOEP0CTL;                    /*!< device endpoint-0 control register                                        */

    struct {
      __IM  uint32_t MPL        : 2;            /*!< Maximum packet length                                                     */
            uint32_t            : 13;
      __IM  uint32_t EPACT      : 1;            /*!< Endpoint active                                                           */
            uint32_t            : 1;
      __IM  uint32_t NAKS       : 1;            /*!< NAK status                                                                */
      __IM  uint32_t EPTYPE     : 2;            /*!< Endpoint type                                                             */
      __IOM uint32_t SNOOP      : 1;            /*!< Snoop mode                                                                */
      __IOM uint32_t STALL      : 1;            /*!< STALL handshake                                                           */
            uint32_t            : 4;
      __OM  uint32_t CNAK       : 1;            /*!< Clear NAK                                                                 */
      __OM  uint32_t SNAK       : 1;            /*!< Set NAK                                                                   */
            uint32_t            : 2;
      __IM  uint32_t EPD        : 1;            /*!< Endpoint disable                                                          */
      __OM  uint32_t EPEN       : 1;            /*!< Endpoint enable                                                           */
    } DOEP0CTL_b;
  } ;
  __IM  uint32_t  RESERVED20;

  union {
    __IOM uint32_t DOEP0INTF;                   /*!< device out endpoint-0 interrupt flag register                             */

    struct {
      __IOM uint32_t TF         : 1;            /*!< Transfer finished                                                         */
      __IOM uint32_t EPDIS      : 1;            /*!< Endpoint disabled                                                         */
            uint32_t            : 1;
      __IOM uint32_t STPF       : 1;            /*!< Setup phase finished                                                      */
      __IOM uint32_t EPRXFOVR   : 1;            /*!< Endpoint Rx FIFO overrun                                                  */
            uint32_t            : 1;
      __IOM uint32_t BTBSTP     : 1;            /*!< Back-to-back SETUP packets                                                */
            uint32_t            : 25;
    } DOEP0INTF_b;
  } ;
  __IM  uint32_t  RESERVED21;

  union {
    __IOM uint32_t DOEP0LEN;                    /*!< device OUT endpoint-0 transfer length register                            */

    struct {
      __IOM uint32_t TLEN       : 7;            /*!< Transfer length                                                           */
            uint32_t            : 12;
      __IOM uint32_t PCNT       : 1;            /*!< Packet count                                                              */
            uint32_t            : 9;
      __IOM uint32_t STPCNT     : 2;            /*!< SETUP packet count                                                        */
            uint32_t            : 1;
    } DOEP0LEN_b;
  } ;
  __IM  uint32_t  RESERVED22[3];

  union {
    __IOM uint32_t DOEP1CTL;                    /*!< device endpoint-1 control register                                        */

    struct {
      __IOM uint32_t MPL        : 11;           /*!< maximum packet length                                                     */
            uint32_t            : 4;
      __IOM uint32_t EPACT      : 1;            /*!< Endpoint active                                                           */
      __IM  uint32_t EOFRM_DPID : 1;            /*!< EOFRM/DPID                                                                */
      __IM  uint32_t NAKS       : 1;            /*!< NAK status                                                                */
      __IOM uint32_t EPTYPE     : 2;            /*!< Endpoint type                                                             */
      __IOM uint32_t SNOOP      : 1;            /*!< Snoop mode                                                                */
      __IOM uint32_t STALL      : 1;            /*!< STALL handshake                                                           */
            uint32_t            : 4;
      __OM  uint32_t CNAK       : 1;            /*!< Clear NAK                                                                 */
      __OM  uint32_t SNAK       : 1;            /*!< Set NAK                                                                   */
      __OM  uint32_t SD0PID_SEVENFRM : 1;       /*!< SD0PID/SEVENFRM                                                           */
      __OM  uint32_t SD1PID_SODDFRM : 1;        /*!< SD1PID/SODDFRM                                                            */
      __IOM uint32_t EPD        : 1;            /*!< Endpoint disable                                                          */
      __IOM uint32_t EPEN       : 1;            /*!< Endpoint enable                                                           */
    } DOEP1CTL_b;
  } ;
  __IM  uint32_t  RESERVED23;

  union {
    __IOM uint32_t DOEP1INTF;                   /*!< device out endpoint-1 interrupt flag register                             */

