RIOT-OS/RIOT/cpu/gd32f3x0/include/gd32f3x0_periph.h
    struct {
      __IOM uint32_t TF         : 1;            /*!< Transfer finished                                                         */
      __IOM uint32_t EPDIS      : 1;            /*!< Endpoint disabled                                                         */
            uint32_t            : 1;
      __IOM uint32_t STPF       : 1;            /*!< Setup phase finished                                                      */
      __IOM uint32_t EPRXFOVR   : 1;            /*!< Endpoint Rx FIFO overrun                                                  */
            uint32_t            : 1;
      __IOM uint32_t BTBSTP     : 1;            /*!< Back-to-back SETUP packets                                                */
            uint32_t            : 25;
    } DOEP1INTF_b;
  } ;
  __IM  uint32_t  RESERVED24;

  union {
    __IOM uint32_t DOEP1LEN;                    /*!< device OUT endpoint-1 transfer length register                            */

    struct {
      __IOM uint32_t TLEN       : 19;           /*!< Transfer length                                                           */
      __IOM uint32_t PCNT       : 10;           /*!< Packet count                                                              */
      __IOM uint32_t STPCNT_RXDPID : 2;         /*!< SETUP packet count/Received data PID                                      */
            uint32_t            : 1;
    } DOEP1LEN_b;
  } ;
  __IM  uint32_t  RESERVED25[3];

  union {
    __IOM uint32_t DOEP2CTL;                    /*!< device endpoint-2 control register                                        */

    struct {
      __IOM uint32_t MPL        : 11;           /*!< maximum packet length                                                     */
            uint32_t            : 4;
      __IOM uint32_t EPACT      : 1;            /*!< Endpoint active                                                           */
      __IM  uint32_t EOFRM_DPID : 1;            /*!< EOFRM/DPID                                                                */
      __IM  uint32_t NAKS       : 1;            /*!< NAK status                                                                */
      __IOM uint32_t EPTYPE     : 2;            /*!< Endpoint type                                                             */
      __IOM uint32_t SNOOP      : 1;            /*!< Snoop mode                                                                */
      __IOM uint32_t STALL      : 1;            /*!< STALL handshake                                                           */
            uint32_t            : 4;
      __OM  uint32_t CNAK       : 1;            /*!< Clear NAK                                                                 */
      __OM  uint32_t SNAK       : 1;            /*!< Set NAK                                                                   */
      __OM  uint32_t SD0PID_SEVENFRM : 1;       /*!< SD0PID/SEVENFRM                                                           */
      __OM  uint32_t SD1PID_SODDFRM : 1;        /*!< SD1PID/SODDFRM                                                            */
      __IOM uint32_t EPD        : 1;            /*!< Endpoint disable                                                          */
      __IOM uint32_t EPEN       : 1;            /*!< Endpoint enable                                                           */
    } DOEP2CTL_b;
  } ;
  __IM  uint32_t  RESERVED26;

  union {
    __IOM uint32_t DOEP2INTF;                   /*!< device out endpoint-2 interrupt flag register                             */

    struct {
      __IOM uint32_t TF         : 1;            /*!< Transfer finished                                                         */
      __IOM uint32_t EPDIS      : 1;            /*!< Endpoint disabled                                                         */
            uint32_t            : 1;
      __IOM uint32_t STPF       : 1;            /*!< Setup phase finished                                                      */
      __IOM uint32_t EPRXFOVR   : 1;            /*!< Endpoint Rx FIFO overrun                                                  */
            uint32_t            : 1;
      __IOM uint32_t BTBSTP     : 1;            /*!< Back-to-back SETUP packets                                                */
            uint32_t            : 25;
    } DOEP2INTF_b;
  } ;
  __IM  uint32_t  RESERVED27;

  union {
    __IOM uint32_t DOEP2LEN;                    /*!< device OUT endpoint-2 transfer length register                            */

    struct {
      __IOM uint32_t TLEN       : 19;           /*!< Transfer length                                                           */
      __IOM uint32_t PCNT       : 10;           /*!< Packet count                                                              */
      __IOM uint32_t STPCNT_RXDPID : 2;         /*!< SETUP packet count/Received data PID                                      */
            uint32_t            : 1;
    } DOEP2LEN_b;
  } ;
  __IM  uint32_t  RESERVED28[3];

  union {
    __IOM uint32_t DOEP3CTL;                    /*!< device endpoint-3 control register                                        */

    struct {
      __IOM uint32_t MPL        : 11;           /*!< maximum packet length                                                     */
            uint32_t            : 4;
      __IOM uint32_t EPACT      : 1;            /*!< Endpoint active                                                           */
      __IM  uint32_t EOFRM_DPID : 1;            /*!< EOFRM/DPID                                                                */
      __IM  uint32_t NAKS       : 1;            /*!< NAK status                                                                */
      __IOM uint32_t EPTYPE     : 2;            /*!< Endpoint type                                                             */
      __IOM uint32_t SNOOP      : 1;            /*!< Snoop mode                                                                */
      __IOM uint32_t STALL      : 1;            /*!< STALL handshake                                                           */
            uint32_t            : 4;
      __OM  uint32_t CNAK       : 1;            /*!< Clear NAK                                                                 */
      __OM  uint32_t SNAK       : 1;            /*!< Set NAK                                                                   */
      __OM  uint32_t SD0PID_SEVENFRM : 1;       /*!< SD0PID/SEVENFRM                                                           */
      __OM  uint32_t SD1PID_SODDFRM : 1;        /*!< SD1PID/SODDFRM                                                            */
      __IOM uint32_t EPD        : 1;            /*!< Endpoint disable                                                          */
      __IOM uint32_t EPEN       : 1;            /*!< Endpoint enable                                                           */
    } DOEP3CTL_b;
  } ;
  __IM  uint32_t  RESERVED29;

  union {
    __IOM uint32_t DOEP3INTF;                   /*!< device out endpoint-3 interrupt flag register                             */

