RIOT-OS/RIOT/cpu/gd32f3x0/include/gd32f3x0_periph.h
    struct {
      __IOM uint32_t TF         : 1;            /*!< Transfer finished                                                         */
      __IOM uint32_t EPDIS      : 1;            /*!< Endpoint disabled                                                         */
            uint32_t            : 1;
      __IOM uint32_t STPF       : 1;            /*!< Setup phase finished                                                      */
      __IOM uint32_t EPRXFOVR   : 1;            /*!< Endpoint Rx FIFO overrun                                                  */
            uint32_t            : 1;
      __IOM uint32_t BTBSTP     : 1;            /*!< Back-to-back SETUP packets                                                */
            uint32_t            : 25;
    } DOEP3INTF_b;
  } ;
  __IM  uint32_t  RESERVED30;

  union {
    __IOM uint32_t DOEP3LEN;                    /*!< device OUT endpoint-3 transfer length register                            */

    struct {
      __IOM uint32_t TLEN       : 19;           /*!< Transfer length                                                           */
      __IOM uint32_t PCNT       : 10;           /*!< Packet count                                                              */
      __IOM uint32_t STPCNT_RXDPID : 2;         /*!< SETUP packet count/Received data PID                                      */
            uint32_t            : 1;
    } DOEP3LEN_b;
  } ;
} USBFS_DEVICE_Type;                            /*!< Size = 884 (0x374)                                                        */



/* =========================================================================================================================== */
/* ================                                       USBFS_PWRCLK                                        ================ */
/* =========================================================================================================================== */


/**
  * @brief USB on the go full speed (USBFS_PWRCLK)
  */

typedef struct {                                /*!< USBFS_PWRCLK Structure                                                    */

  union {
    __IOM uint32_t PWRCLKCTL;                   /*!< power and clock gating control register (PWRCLKCTL)                       */

    struct {
      __IOM uint32_t SUCLK      : 1;            /*!< Stop the USB clock                                                        */
      __IOM uint32_t SHCLK      : 1;            /*!< Stop HCLK                                                                 */
            uint32_t            : 30;
    } PWRCLKCTL_b;
  } ;
} USBFS_PWRCLK_Type;                            /*!< Size = 4 (0x4)                                                            */



/* =========================================================================================================================== */
/* ================                                           WWDGT                                           ================ */
/* =========================================================================================================================== */


/**
  * @brief Window watchdog timer (WWDGT)
  */

typedef struct {                                /*!< WWDGT Structure                                                           */

  union {
    __IOM uint32_t CTL;                         /*!< Control register                                                          */

    struct {
      __IOM uint32_t CNT        : 7;            /*!< The value of the watchdog timer counter                                   */
      __IOM uint32_t WDGTEN     : 1;            /*!< Activation bit                                                            */
            uint32_t            : 24;
    } CTL_b;
  } ;

  union {
    __IOM uint32_t CFG;                         /*!< Configuration register                                                    */

    struct {
      __IOM uint32_t WIN        : 7;            /*!< 7-bit window value                                                        */
      __IOM uint32_t PSC        : 2;            /*!< Prescaler                                                                 */
      __IOM uint32_t EWIE       : 1;            /*!< Early wakeup interrupt                                                    */
            uint32_t            : 22;
    } CFG_b;
  } ;

  union {
    __IOM uint32_t STAT;                        /*!< Status register                                                           */

    struct {
      __IOM uint32_t EWIF       : 1;            /*!< Early wakeup interrupt flag                                               */
            uint32_t            : 31;
    } STAT_b;
  } ;
} WWDGT_Type;                                   /*!< Size = 12 (0xc)                                                           */


/** @} */ /* End of group Device_Peripheral_peripherals */


/* =========================================================================================================================== */
/* ================                          Device Specific Peripheral Address Map                           ================ */
/* =========================================================================================================================== */


/** @addtogroup Device_Peripheral_peripheralAddr
  * @{
  */

// #define ADC_BASE                    0x40012400UL
// #define CEC_BASE                    0x40007800UL
// #define CMP_BASE                    0x4001001CUL
// #define CRC_BASE                    0x40023000UL
// #define CTC_BASE                    0x4000C800UL
// #define DAC_BASE                    0x40007400UL
// #define DBG_BASE                    0xE0042000UL
// #define DMA_BASE                    0x40020000UL
// #define EXTI_BASE                   0x40010400UL
// #define FMC_BASE                    0x40022000UL
// #define FWDGT_BASE                  0x40003000UL
// #define GPIOA_BASE                  0x48000000UL
// #define GPIOB_BASE                  0x48000400UL
// #define GPIOC_BASE                  0x48000800UL
// #define GPIOD_BASE                  0x48000C00UL
// #define GPIOF_BASE                  0x48001400UL
#define I2C0_BASE                   0x40005400UL
#define I2C1_BASE                   0x40005800UL
// #define NVIC_BASE                   0xE000E100UL
// #define PMU_BASE                    0x40007000UL
// #define RCU_BASE                    0x40021000UL
// #define RTC_BASE                    0x40002800UL
#define SPI0_BASE                   0x40013000UL
#define SPI1_BASE                   0x40003800UL
// #define SYSCFG_BASE                 0x40010000UL
#define TIMER0_BASE                 0x40012C00UL
#define TIMER1_BASE                 0x40000000UL
#define TIMER2_BASE                 0x40000400UL
#define TIMER5_BASE                 0x40001000UL
#define TIMER13_BASE                0x40002000UL
#define TIMER14_BASE                0x40014000UL
#define TIMER15_BASE                0x40014400UL
#define TIMER16_BASE                0x40014800UL
#define TSI_BASE                    0x40024000UL
#define USART0_BASE                 0x40013800UL
#define USART1_BASE                 0x40004400UL
#define USBFS_GLOBAL_BASE           0x50000000UL
#define USBFS_HOST_BASE             0x50000400UL
#define USBFS_DEVICE_BASE           0x50000800UL
#define USBFS_PWRCLK_BASE           0x50000E00UL
// #define WWDGT_BASE                  0x40002C00UL

/** @} */ /* End of group Device_Peripheral_peripheralAddr */


/* =========================================================================================================================== */
/* ================                                  Peripheral declaration                                   ================ */
/* =========================================================================================================================== */


/** @addtogroup Device_Peripheral_declaration
  * @{
  */

#define ADC                         ((ADC_Type*)               ADC_BASE)
#define CEC                         ((CEC_Type*)               CEC_BASE)
#define CMP                         ((CMP_Type*)               CMP_BASE)
#define CRC                         ((CRC_Type*)               CRC_BASE)
#define CTC                         ((CTC_Type*)               CTC_BASE)
#define DAC                         ((DAC_Type*)               DAC_BASE)
#define DBG                         ((DBG_Type*)               DBG_BASE)
#define DMA                         ((DMA_Type*)               DMA_BASE)
#define EXTI                        ((EXTI_Type*)              EXTI_BASE)
#define FMC                         ((FMC_Type*)               FMC_BASE)
#define FWDGT                       ((FWDGT_Type*)             FWDGT_BASE)
#define GPIOA                       ((GPIO_Type*)              GPIOA_BASE)
#define GPIOB                       ((GPIO_Type*)              GPIOB_BASE)
#define GPIOC                       ((GPIO_Type*)              GPIOC_BASE)
#define GPIOD                       ((GPIO_Type*)              GPIOD_BASE)
#define GPIOF                       ((GPIO_Type*)              GPIOF_BASE)
#define I2C0                        ((I2C_Type*)               I2C0_BASE)
#define I2C1                        ((I2C_Type*)               I2C1_BASE)
// #define NVIC                        ((NVIC_Type*)              NVIC_BASE)
#define PMU                         ((PMU_Type*)               PMU_BASE)
#define RCU                         ((RCU_Type*)               RCU_BASE)
#define RTC                         ((RTC_Type*)               RTC_BASE)
#define SPI0                        ((SPI_Type*)               SPI0_BASE)
#define SPI1                        ((SPI_Type*)               SPI1_BASE)
#define SYSCFG                      ((SYSCFG_Type*)            SYSCFG_BASE)
#define TIMER0                      ((TIMER_Type*)             TIMER0_BASE)
#define TIMER1                      ((TIMER_Type*)             TIMER1_BASE)
#define TIMER2                      ((TIMER_Type*)             TIMER2_BASE)
#define TIMER5                      ((TIMER_Type*)             TIMER5_BASE)
#define TIMER13                     ((TIMER_Type*)             TIMER13_BASE)
#define TIMER14                     ((TIMER_Type*)             TIMER14_BASE)
#define TIMER15                     ((TIMER_Type*)             TIMER15_BASE)
#define TIMER16                     ((TIMER_Type*)             TIMER16_BASE)
#define TSI                         ((TSI_Type*)               TSI_BASE)
#define USART0                      ((USART_Type*)             USART0_BASE)
#define USART1                      ((USART_Type*)             USART1_BASE)
#define USBFS_GLOBAL                ((USBFS_GLOBAL_Type*)      USBFS_GLOBAL_BASE)
#define USBFS_HOST                  ((USBFS_HOST_Type*)        USBFS_HOST_BASE)
#define USBFS_DEVICE                ((USBFS_DEVICE_Type*)      USBFS_DEVICE_BASE)
#define USBFS_PWRCLK                ((USBFS_PWRCLK_Type*)      USBFS_PWRCLK_BASE)
#define WWDGT                       ((WWDGT_Type*)             WWDGT_BASE)

