RIOT-OS/RIOT/cpu/gd32f3x0/include/gd32f3x0_periph.h
/* ========================================================  IDATA0  ========================================================= */
#define ADC_IDATA0_IDATAn_Pos             (0UL)                     /*!< IDATAn (Bit 0)                                        */
#define ADC_IDATA0_IDATAn_Msk             (0xffffUL)                /*!< IDATAn (Bitfield-Mask: 0xffff)                        */
/* ========================================================  IDATA1  ========================================================= */
#define ADC_IDATA1_IDATAn_Pos             (0UL)                     /*!< IDATAn (Bit 0)                                        */
#define ADC_IDATA1_IDATAn_Msk             (0xffffUL)                /*!< IDATAn (Bitfield-Mask: 0xffff)                        */
/* ========================================================  IDATA2  ========================================================= */
#define ADC_IDATA2_IDATAn_Pos             (0UL)                     /*!< IDATAn (Bit 0)                                        */
#define ADC_IDATA2_IDATAn_Msk             (0xffffUL)                /*!< IDATAn (Bitfield-Mask: 0xffff)                        */
/* ========================================================  IDATA3  ========================================================= */
#define ADC_IDATA3_IDATAn_Pos             (0UL)                     /*!< IDATAn (Bit 0)                                        */
#define ADC_IDATA3_IDATAn_Msk             (0xffffUL)                /*!< IDATAn (Bitfield-Mask: 0xffff)                        */
/* =========================================================  RDATA  ========================================================= */
#define ADC_RDATA_RDATA_Pos               (0UL)                     /*!< RDATA (Bit 0)                                         */
#define ADC_RDATA_RDATA_Msk               (0xffffUL)                /*!< RDATA (Bitfield-Mask: 0xffff)                         */
/* =======================================================  OVSAMPCTL  ======================================================= */
#define ADC_OVSAMPCTL_TOVS_Pos            (9UL)                     /*!< TOVS (Bit 9)                                          */
#define ADC_OVSAMPCTL_TOVS_Msk            (0x200UL)                 /*!< TOVS (Bitfield-Mask: 0x01)                            */
#define ADC_OVSAMPCTL_OVSS_Pos            (5UL)                     /*!< OVSS (Bit 5)                                          */
#define ADC_OVSAMPCTL_OVSS_Msk            (0x1e0UL)                 /*!< OVSS (Bitfield-Mask: 0x0f)                            */
#define ADC_OVSAMPCTL_OVSR_Pos            (2UL)                     /*!< OVSR (Bit 2)                                          */
#define ADC_OVSAMPCTL_OVSR_Msk            (0x1cUL)                  /*!< OVSR (Bitfield-Mask: 0x07)                            */
#define ADC_OVSAMPCTL_OVSEN_Pos           (0UL)                     /*!< OVSEN (Bit 0)                                         */
#define ADC_OVSAMPCTL_OVSEN_Msk           (0x1UL)                   /*!< OVSEN (Bitfield-Mask: 0x01)                           */


/* =========================================================================================================================== */
/* ================                                            CEC                                            ================ */
/* =========================================================================================================================== */

/* ==========================================================  CTL  ========================================================== */
#define CEC_CTL_ENDOM_Pos                 (2UL)                     /*!< ENDOM (Bit 2)                                         */
#define CEC_CTL_ENDOM_Msk                 (0x4UL)                   /*!< ENDOM (Bitfield-Mask: 0x01)                           */
#define CEC_CTL_STAOM_Pos                 (1UL)                     /*!< STAOM (Bit 1)                                         */
#define CEC_CTL_STAOM_Msk                 (0x2UL)                   /*!< STAOM (Bitfield-Mask: 0x01)                           */
#define CEC_CTL_CECEN_Pos                 (0UL)                     /*!< CECEN (Bit 0)                                         */
#define CEC_CTL_CECEN_Msk                 (0x1UL)                   /*!< CECEN (Bitfield-Mask: 0x01)                           */
/* ==========================================================  CFG  ========================================================== */
#define CEC_CFG_SFT_Pos                   (0UL)                     /*!< SFT (Bit 0)                                           */
#define CEC_CFG_SFT_Msk                   (0x7UL)                   /*!< SFT (Bitfield-Mask: 0x07)                             */
#define CEC_CFG_RTOL_Pos                  (3UL)                     /*!< RTOL (Bit 3)                                          */
#define CEC_CFG_RTOL_Msk                  (0x8UL)                   /*!< RTOL (Bitfield-Mask: 0x01)                            */
#define CEC_CFG_BRES_Pos                  (4UL)                     /*!< BRES (Bit 4)                                          */
#define CEC_CFG_BRES_Msk                  (0x10UL)                  /*!< BRES (Bitfield-Mask: 0x01)                            */
#define CEC_CFG_BREG_Pos                  (5UL)                     /*!< BREG (Bit 5)                                          */
#define CEC_CFG_BREG_Msk                  (0x20UL)                  /*!< BREG (Bitfield-Mask: 0x01)                            */
#define CEC_CFG_BPLEG_Pos                 (6UL)                     /*!< BPLEG (Bit 6)                                         */
#define CEC_CFG_BPLEG_Msk                 (0x40UL)                  /*!< BPLEG (Bitfield-Mask: 0x01)                           */
#define CEC_CFG_BCNG_Pos                  (7UL)                     /*!< BCNG (Bit 7)                                          */
#define CEC_CFG_BCNG_Msk                  (0x80UL)                  /*!< BCNG (Bitfield-Mask: 0x01)                            */
#define CEC_CFG_SFTOPT_Pos                (8UL)                     /*!< SFTOPT (Bit 8)                                        */
#define CEC_CFG_SFTOPT_Msk                (0x100UL)                 /*!< SFTOPT (Bitfield-Mask: 0x01)                          */
#define CEC_CFG_OAD_Pos                   (16UL)                    /*!< OAD (Bit 16)                                          */
#define CEC_CFG_OAD_Msk                   (0x7fff0000UL)            /*!< OAD (Bitfield-Mask: 0x7fff)                           */
#define CEC_CFG_LMEN_Pos                  (31UL)                    /*!< LMEN (Bit 31)                                         */
#define CEC_CFG_LMEN_Msk                  (0x80000000UL)            /*!< LMEN (Bitfield-Mask: 0x01)                            */
/* =========================================================  TDATA  ========================================================= */
#define CEC_TDATA_TDATA_Pos               (0UL)                     /*!< TDATA (Bit 0)                                         */
#define CEC_TDATA_TDATA_Msk               (0xffUL)                  /*!< TDATA (Bitfield-Mask: 0xff)                           */
/* =========================================================  RDATA  ========================================================= */
#define CEC_RDATA_RDATA_Pos               (0UL)                     /*!< RDATA (Bit 0)                                         */
#define CEC_RDATA_RDATA_Msk               (0xffUL)                  /*!< RDATA (Bitfield-Mask: 0xff)                           */
/* =========================================================  INTF  ========================================================== */
#define CEC_INTF_TAERR_Pos                (12UL)                    /*!< TAERR (Bit 12)                                        */
#define CEC_INTF_TAERR_Msk                (0x1000UL)                /*!< TAERR (Bitfield-Mask: 0x01)                           */
#define CEC_INTF_TERR_Pos                 (11UL)                    /*!< TERR (Bit 11)                                         */
#define CEC_INTF_TERR_Msk                 (0x800UL)                 /*!< TERR (Bitfield-Mask: 0x01)                            */
#define CEC_INTF_TU_Pos                   (10UL)                    /*!< TU (Bit 10)                                           */
#define CEC_INTF_TU_Msk                   (0x400UL)                 /*!< TU (Bitfield-Mask: 0x01)                              */
#define CEC_INTF_TEND_Pos                 (9UL)                     /*!< TEND (Bit 9)                                          */
#define CEC_INTF_TEND_Msk                 (0x200UL)                 /*!< TEND (Bitfield-Mask: 0x01)                            */
#define CEC_INTF_TBR_Pos                  (8UL)                     /*!< TBR (Bit 8)                                           */
#define CEC_INTF_TBR_Msk                  (0x100UL)                 /*!< TBR (Bitfield-Mask: 0x01)                             */
#define CEC_INTF_ARBF_Pos                 (7UL)                     /*!< ARBF (Bit 7)                                          */
#define CEC_INTF_ARBF_Msk                 (0x80UL)                  /*!< ARBF (Bitfield-Mask: 0x01)                            */
#define CEC_INTF_RAE_Pos                  (6UL)                     /*!< RAE (Bit 6)                                           */
#define CEC_INTF_RAE_Msk                  (0x40UL)                  /*!< RAE (Bitfield-Mask: 0x01)                             */
#define CEC_INTF_BPLE_Pos                 (5UL)                     /*!< BPLE (Bit 5)                                          */
#define CEC_INTF_BPLE_Msk                 (0x20UL)                  /*!< BPLE (Bitfield-Mask: 0x01)                            */
#define CEC_INTF_BPSE_Pos                 (4UL)                     /*!< BPSE (Bit 4)                                          */
#define CEC_INTF_BPSE_Msk                 (0x10UL)                  /*!< BPSE (Bitfield-Mask: 0x01)                            */
#define CEC_INTF_BRE_Pos                  (3UL)                     /*!< BRE (Bit 3)                                           */
#define CEC_INTF_BRE_Msk                  (0x8UL)                   /*!< BRE (Bitfield-Mask: 0x01)                             */
#define CEC_INTF_RO_Pos                   (2UL)                     /*!< RO (Bit 2)                                            */
#define CEC_INTF_RO_Msk                   (0x4UL)                   /*!< RO (Bitfield-Mask: 0x01)                              */
#define CEC_INTF_REND_Pos                 (1UL)                     /*!< REND (Bit 1)                                          */
#define CEC_INTF_REND_Msk                 (0x2UL)                   /*!< REND (Bitfield-Mask: 0x01)                            */
#define CEC_INTF_BR_Pos                   (0UL)                     /*!< BR (Bit 0)                                            */
#define CEC_INTF_BR_Msk                   (0x1UL)                   /*!< BR (Bitfield-Mask: 0x01)                              */
/* =========================================================  INTEN  ========================================================= */
#define CEC_INTEN_TAERRIE_Pos             (12UL)                    /*!< TAERRIE (Bit 12)                                      */
#define CEC_INTEN_TAERRIE_Msk             (0x1000UL)                /*!< TAERRIE (Bitfield-Mask: 0x01)                         */
#define CEC_INTEN_TERRIE_Pos              (11UL)                    /*!< TERRIE (Bit 11)                                       */
#define CEC_INTEN_TERRIE_Msk              (0x800UL)                 /*!< TERRIE (Bitfield-Mask: 0x01)                          */
#define CEC_INTEN_TUIE_Pos                (10UL)                    /*!< TUIE (Bit 10)                                         */
#define CEC_INTEN_TUIE_Msk                (0x400UL)                 /*!< TUIE (Bitfield-Mask: 0x01)                            */
#define CEC_INTEN_TXENDIE_Pos             (9UL)                     /*!< TXENDIE (Bit 9)                                       */
#define CEC_INTEN_TXENDIE_Msk             (0x200UL)                 /*!< TXENDIE (Bitfield-Mask: 0x01)                         */
#define CEC_INTEN_TBRIE_Pos               (8UL)                     /*!< TBRIE (Bit 8)                                         */
#define CEC_INTEN_TBRIE_Msk               (0x100UL)                 /*!< TBRIE (Bitfield-Mask: 0x01)                           */
#define CEC_INTEN_ARBFIE_Pos              (7UL)                     /*!< ARBFIE (Bit 7)                                        */
#define CEC_INTEN_ARBFIE_Msk              (0x80UL)                  /*!< ARBFIE (Bitfield-Mask: 0x01)                          */
#define CEC_INTEN_RAEIE_Pos               (6UL)                     /*!< RAEIE (Bit 6)                                         */
#define CEC_INTEN_RAEIE_Msk               (0x40UL)                  /*!< RAEIE (Bitfield-Mask: 0x01)                           */
#define CEC_INTEN_BPLEIE_Pos              (5UL)                     /*!< BPLEIE (Bit 5)                                        */
#define CEC_INTEN_BPLEIE_Msk              (0x20UL)                  /*!< BPLEIE (Bitfield-Mask: 0x01)                          */
#define CEC_INTEN_BPSEIE_Pos              (4UL)                     /*!< BPSEIE (Bit 4)                                        */
#define CEC_INTEN_BPSEIE_Msk              (0x10UL)                  /*!< BPSEIE (Bitfield-Mask: 0x01)                          */
#define CEC_INTEN_BREIE_Pos               (3UL)                     /*!< BREIE (Bit 3)                                         */
#define CEC_INTEN_BREIE_Msk               (0x8UL)                   /*!< BREIE (Bitfield-Mask: 0x01)                           */
#define CEC_INTEN_ROIE_Pos                (2UL)                     /*!< ROIE (Bit 2)                                          */
#define CEC_INTEN_ROIE_Msk                (0x4UL)                   /*!< ROIE (Bitfield-Mask: 0x01)                            */
#define CEC_INTEN_RENDIE_Pos              (1UL)                     /*!< RENDIE (Bit 1)                                        */
#define CEC_INTEN_RENDIE_Msk              (0x2UL)                   /*!< RENDIE (Bitfield-Mask: 0x01)                          */
#define CEC_INTEN_BRIE_Pos                (0UL)                     /*!< BRIE (Bit 0)                                          */
#define CEC_INTEN_BRIE_Msk                (0x1UL)                   /*!< BRIE (Bitfield-Mask: 0x01)                            */


/* =========================================================================================================================== */
/* ================                                            CMP                                            ================ */
/* =========================================================================================================================== */

/* ==========================================================  CS  =========================================================== */
#define CMP_CS_CMP0EN_Pos                 (0UL)                     /*!< CMP0EN (Bit 0)                                        */
#define CMP_CS_CMP0EN_Msk                 (0x1UL)                   /*!< CMP0EN (Bitfield-Mask: 0x01)                          */
#define CMP_CS_CMP0SW_Pos                 (1UL)                     /*!< CMP0SW (Bit 1)                                        */
#define CMP_CS_CMP0SW_Msk                 (0x2UL)                   /*!< CMP0SW (Bitfield-Mask: 0x01)                          */
#define CMP_CS_CMP0M_Pos                  (2UL)                     /*!< CMP0M (Bit 2)                                         */
#define CMP_CS_CMP0M_Msk                  (0xcUL)                   /*!< CMP0M (Bitfield-Mask: 0x03)                           */
#define CMP_CS_CMP0MSEL_Pos               (4UL)                     /*!< CMP0MSEL (Bit 4)                                      */
#define CMP_CS_CMP0MSEL_Msk               (0x70UL)                  /*!< CMP0MSEL (Bitfield-Mask: 0x07)                        */
#define CMP_CS_CMP0OSEL_Pos               (8UL)                     /*!< CMP0OSEL (Bit 8)                                      */
#define CMP_CS_CMP0OSEL_Msk               (0x700UL)                 /*!< CMP0OSEL (Bitfield-Mask: 0x07)                        */
#define CMP_CS_CMP0PL_Pos                 (11UL)                    /*!< CMP0PL (Bit 11)                                       */
#define CMP_CS_CMP0PL_Msk                 (0x800UL)                 /*!< CMP0PL (Bitfield-Mask: 0x01)                          */
#define CMP_CS_CMP0HST_Pos                (12UL)                    /*!< CMP0HST (Bit 12)                                      */
#define CMP_CS_CMP0HST_Msk                (0x3000UL)                /*!< CMP0HST (Bitfield-Mask: 0x03)                         */
#define CMP_CS_CMP0O_Pos                  (14UL)                    /*!< CMP0O (Bit 14)                                        */
#define CMP_CS_CMP0O_Msk                  (0x4000UL)                /*!< CMP0O (Bitfield-Mask: 0x01)                           */
#define CMP_CS_CMP0LK_Pos                 (15UL)                    /*!< CMP0LK (Bit 15)                                       */
#define CMP_CS_CMP0LK_Msk                 (0x8000UL)                /*!< CMP0LK (Bitfield-Mask: 0x01)                          */
#define CMP_CS_CMP1EN_Pos                 (16UL)                    /*!< CMP1EN (Bit 16)                                       */
#define CMP_CS_CMP1EN_Msk                 (0x10000UL)               /*!< CMP1EN (Bitfield-Mask: 0x01)                          */
#define CMP_CS_CMP1M_Pos                  (18UL)                    /*!< CMP1M (Bit 18)                                        */
#define CMP_CS_CMP1M_Msk                  (0xc0000UL)               /*!< CMP1M (Bitfield-Mask: 0x03)                           */
#define CMP_CS_CMP1MSEL_Pos               (20UL)                    /*!< CMP1MSEL (Bit 20)                                     */
#define CMP_CS_CMP1MSEL_Msk               (0x700000UL)              /*!< CMP1MSEL (Bitfield-Mask: 0x07)                        */
#define CMP_CS_WNDEN_Pos                  (23UL)                    /*!< WNDEN (Bit 23)                                        */
#define CMP_CS_WNDEN_Msk                  (0x800000UL)              /*!< WNDEN (Bitfield-Mask: 0x01)                           */
#define CMP_CS_CMP1OSEL_Pos               (24UL)                    /*!< CMP1OSEL (Bit 24)                                     */
#define CMP_CS_CMP1OSEL_Msk               (0x7000000UL)             /*!< CMP1OSEL (Bitfield-Mask: 0x07)                        */
#define CMP_CS_CMP1PL_Pos                 (27UL)                    /*!< CMP1PL (Bit 27)                                       */
#define CMP_CS_CMP1PL_Msk                 (0x8000000UL)             /*!< CMP1PL (Bitfield-Mask: 0x01)                          */
#define CMP_CS_CMP1HST_Pos                (28UL)                    /*!< CMP1HST (Bit 28)                                      */
#define CMP_CS_CMP1HST_Msk                (0x30000000UL)            /*!< CMP1HST (Bitfield-Mask: 0x03)                         */
#define CMP_CS_CMP1O_Pos                  (30UL)                    /*!< CMP1O (Bit 30)                                        */
#define CMP_CS_CMP1O_Msk                  (0x40000000UL)            /*!< CMP1O (Bitfield-Mask: 0x01)                           */
#define CMP_CS_CMP1LK_Pos                 (31UL)                    /*!< CMP1LK (Bit 31)                                       */
#define CMP_CS_CMP1LK_Msk                 (0x80000000UL)            /*!< CMP1LK (Bitfield-Mask: 0x01)                          */


/* =========================================================================================================================== */
/* ================                                            CRC                                            ================ */
/* =========================================================================================================================== */

/* =========================================================  DATA  ========================================================== */
#define CRC_DATA_DATA_Pos                 (0UL)                     /*!< DATA (Bit 0)                                          */
#define CRC_DATA_DATA_Msk                 (0xffffffffUL)            /*!< DATA (Bitfield-Mask: 0xffffffff)                      */
/* =========================================================  FDATA  ========================================================= */
#define CRC_FDATA_FDATA_Pos               (0UL)                     /*!< FDATA (Bit 0)                                         */
#define CRC_FDATA_FDATA_Msk               (0xffUL)                  /*!< FDATA (Bitfield-Mask: 0xff)                           */
/* ==========================================================  CTL  ========================================================== */
#define CRC_CTL_RST_Pos                   (0UL)                     /*!< RST (Bit 0)                                           */
#define CRC_CTL_RST_Msk                   (0x1UL)                   /*!< RST (Bitfield-Mask: 0x01)                             */
#define CRC_CTL_PS_Pos                    (3UL)                     /*!< PS (Bit 3)                                            */
#define CRC_CTL_PS_Msk                    (0x18UL)                  /*!< PS (Bitfield-Mask: 0x03)                              */
#define CRC_CTL_REV_I_Pos                 (5UL)                     /*!< REV_I (Bit 5)                                         */
#define CRC_CTL_REV_I_Msk                 (0x60UL)                  /*!< REV_I (Bitfield-Mask: 0x03)                           */
#define CRC_CTL_REV_O_Pos                 (7UL)                     /*!< REV_O (Bit 7)                                         */
#define CRC_CTL_REV_O_Msk                 (0x80UL)                  /*!< REV_O (Bitfield-Mask: 0x01)                           */
/* =========================================================  IDATA  ========================================================= */
#define CRC_IDATA_IDATA_Pos               (0UL)                     /*!< IDATA (Bit 0)                                         */
#define CRC_IDATA_IDATA_Msk               (0xffffffffUL)            /*!< IDATA (Bitfield-Mask: 0xffffffff)                     */
/* =========================================================  POLY  ========================================================== */
#define CRC_POLY_POLY_Pos                 (0UL)                     /*!< POLY (Bit 0)                                          */
#define CRC_POLY_POLY_Msk                 (0xffffffffUL)            /*!< POLY (Bitfield-Mask: 0xffffffff)                      */


/* =========================================================================================================================== */
/* ================                                            CTC                                            ================ */
/* =========================================================================================================================== */

