RIOT-OS/RIOT/cpu/gd32f3x0/include/gd32f3x0_periph.h
/* =========================================================  CTL0  ========================================================== */
#define CTC_CTL0_TRIMVALUE_Pos            (8UL)                     /*!< TRIMVALUE (Bit 8)                                     */
#define CTC_CTL0_TRIMVALUE_Msk            (0x3f00UL)                /*!< TRIMVALUE (Bitfield-Mask: 0x3f)                       */
#define CTC_CTL0_SWREFPUL_Pos             (7UL)                     /*!< SWREFPUL (Bit 7)                                      */
#define CTC_CTL0_SWREFPUL_Msk             (0x80UL)                  /*!< SWREFPUL (Bitfield-Mask: 0x01)                        */
#define CTC_CTL0_AUTOTRIM_Pos             (6UL)                     /*!< AUTOTRIM (Bit 6)                                      */
#define CTC_CTL0_AUTOTRIM_Msk             (0x40UL)                  /*!< AUTOTRIM (Bitfield-Mask: 0x01)                        */
#define CTC_CTL0_CNTEN_Pos                (5UL)                     /*!< CNTEN (Bit 5)                                         */
#define CTC_CTL0_CNTEN_Msk                (0x20UL)                  /*!< CNTEN (Bitfield-Mask: 0x01)                           */
#define CTC_CTL0_EREFIE_Pos               (3UL)                     /*!< EREFIE (Bit 3)                                        */
#define CTC_CTL0_EREFIE_Msk               (0x8UL)                   /*!< EREFIE (Bitfield-Mask: 0x01)                          */
#define CTC_CTL0_ERRIE_Pos                (2UL)                     /*!< ERRIE (Bit 2)                                         */
#define CTC_CTL0_ERRIE_Msk                (0x4UL)                   /*!< ERRIE (Bitfield-Mask: 0x01)                           */
#define CTC_CTL0_CKWARNIE_Pos             (1UL)                     /*!< CKWARNIE (Bit 1)                                      */
#define CTC_CTL0_CKWARNIE_Msk             (0x2UL)                   /*!< CKWARNIE (Bitfield-Mask: 0x01)                        */
#define CTC_CTL0_CKOKIE_Pos               (0UL)                     /*!< CKOKIE (Bit 0)                                        */
#define CTC_CTL0_CKOKIE_Msk               (0x1UL)                   /*!< CKOKIE (Bitfield-Mask: 0x01)                          */
/* =========================================================  CTL1  ========================================================== */
#define CTC_CTL1_RLVALUE_Pos              (0UL)                     /*!< RLVALUE (Bit 0)                                       */
#define CTC_CTL1_RLVALUE_Msk              (0xffffUL)                /*!< RLVALUE (Bitfield-Mask: 0xffff)                       */
#define CTC_CTL1_CKLIM_Pos                (16UL)                    /*!< CKLIM (Bit 16)                                        */
#define CTC_CTL1_CKLIM_Msk                (0xff0000UL)              /*!< CKLIM (Bitfield-Mask: 0xff)                           */
#define CTC_CTL1_REFPSC_Pos               (24UL)                    /*!< REFPSC (Bit 24)                                       */
#define CTC_CTL1_REFPSC_Msk               (0x7000000UL)             /*!< REFPSC (Bitfield-Mask: 0x07)                          */
#define CTC_CTL1_REFSEL_Pos               (28UL)                    /*!< REFSEL (Bit 28)                                       */
#define CTC_CTL1_REFSEL_Msk               (0x30000000UL)            /*!< REFSEL (Bitfield-Mask: 0x03)                          */
#define CTC_CTL1_REFPOL_Pos               (31UL)                    /*!< REFPOL (Bit 31)                                       */
#define CTC_CTL1_REFPOL_Msk               (0x80000000UL)            /*!< REFPOL (Bitfield-Mask: 0x01)                          */
/* =========================================================  STAT  ========================================================== */
#define CTC_STAT_CKOKIF_Pos               (0UL)                     /*!< CKOKIF (Bit 0)                                        */
#define CTC_STAT_CKOKIF_Msk               (0x1UL)                   /*!< CKOKIF (Bitfield-Mask: 0x01)                          */
#define CTC_STAT_CKWARNIF_Pos             (1UL)                     /*!< CKWARNIF (Bit 1)                                      */
#define CTC_STAT_CKWARNIF_Msk             (0x2UL)                   /*!< CKWARNIF (Bitfield-Mask: 0x01)                        */
#define CTC_STAT_ERRIF_Pos                (2UL)                     /*!< ERRIF (Bit 2)                                         */
#define CTC_STAT_ERRIF_Msk                (0x4UL)                   /*!< ERRIF (Bitfield-Mask: 0x01)                           */
#define CTC_STAT_EREFIF_Pos               (3UL)                     /*!< EREFIF (Bit 3)                                        */
#define CTC_STAT_EREFIF_Msk               (0x8UL)                   /*!< EREFIF (Bitfield-Mask: 0x01)                          */
#define CTC_STAT_CKERR_Pos                (8UL)                     /*!< CKERR (Bit 8)                                         */
#define CTC_STAT_CKERR_Msk                (0x100UL)                 /*!< CKERR (Bitfield-Mask: 0x01)                           */
#define CTC_STAT_REFMISS_Pos              (9UL)                     /*!< REFMISS (Bit 9)                                       */
#define CTC_STAT_REFMISS_Msk              (0x200UL)                 /*!< REFMISS (Bitfield-Mask: 0x01)                         */
#define CTC_STAT_TRIMERR_Pos              (10UL)                    /*!< TRIMERR (Bit 10)                                      */
#define CTC_STAT_TRIMERR_Msk              (0x400UL)                 /*!< TRIMERR (Bitfield-Mask: 0x01)                         */
#define CTC_STAT_REFDIR_Pos               (15UL)                    /*!< REFDIR (Bit 15)                                       */
#define CTC_STAT_REFDIR_Msk               (0x8000UL)                /*!< REFDIR (Bitfield-Mask: 0x01)                          */
#define CTC_STAT_REFCAP_Pos               (16UL)                    /*!< REFCAP (Bit 16)                                       */
#define CTC_STAT_REFCAP_Msk               (0xffff0000UL)            /*!< REFCAP (Bitfield-Mask: 0xffff)                        */
/* =========================================================  INTC  ========================================================== */
#define CTC_INTC_CKOKIC_Pos               (0UL)                     /*!< CKOKIC (Bit 0)                                        */
#define CTC_INTC_CKOKIC_Msk               (0x1UL)                   /*!< CKOKIC (Bitfield-Mask: 0x01)                          */
#define CTC_INTC_CKWARNIC_Pos             (1UL)                     /*!< CKWARNIC (Bit 1)                                      */
#define CTC_INTC_CKWARNIC_Msk             (0x2UL)                   /*!< CKWARNIC (Bitfield-Mask: 0x01)                        */
#define CTC_INTC_ERRIC_Pos                (2UL)                     /*!< ERRIC (Bit 2)                                         */
#define CTC_INTC_ERRIC_Msk                (0x4UL)                   /*!< ERRIC (Bitfield-Mask: 0x01)                           */
#define CTC_INTC_EREFIC_Pos               (3UL)                     /*!< EREFIC (Bit 3)                                        */
#define CTC_INTC_EREFIC_Msk               (0x8UL)                   /*!< EREFIC (Bitfield-Mask: 0x01)                          */


/* =========================================================================================================================== */
/* ================                                            DAC                                            ================ */
/* =========================================================================================================================== */

/* ==========================================================  CTL  ========================================================== */
#define DAC_CTL_DEN_Pos                   (0UL)                     /*!< DEN (Bit 0)                                           */
#define DAC_CTL_DEN_Msk                   (0x1UL)                   /*!< DEN (Bitfield-Mask: 0x01)                             */
#define DAC_CTL_DBOFF_Pos                 (1UL)                     /*!< DBOFF (Bit 1)                                         */
#define DAC_CTL_DBOFF_Msk                 (0x2UL)                   /*!< DBOFF (Bitfield-Mask: 0x01)                           */
#define DAC_CTL_DTEN_Pos                  (2UL)                     /*!< DTEN (Bit 2)                                          */
#define DAC_CTL_DTEN_Msk                  (0x4UL)                   /*!< DTEN (Bitfield-Mask: 0x01)                            */
#define DAC_CTL_DTSEL_Pos                 (3UL)                     /*!< DTSEL (Bit 3)                                         */
#define DAC_CTL_DTSEL_Msk                 (0x38UL)                  /*!< DTSEL (Bitfield-Mask: 0x07)                           */
#define DAC_CTL_DWM_Pos                   (6UL)                     /*!< DWM (Bit 6)                                           */
#define DAC_CTL_DWM_Msk                   (0xc0UL)                  /*!< DWM (Bitfield-Mask: 0x03)                             */
#define DAC_CTL_DWBW_Pos                  (8UL)                     /*!< DWBW (Bit 8)                                          */
#define DAC_CTL_DWBW_Msk                  (0xf00UL)                 /*!< DWBW (Bitfield-Mask: 0x0f)                            */
#define DAC_CTL_DDMAEN_Pos                (12UL)                    /*!< DDMAEN (Bit 12)                                       */
#define DAC_CTL_DDMAEN_Msk                (0x1000UL)                /*!< DDMAEN (Bitfield-Mask: 0x01)                          */
#define DAC_CTL_DDUDRIE_Pos               (13UL)                    /*!< DDUDRIE (Bit 13)                                      */
#define DAC_CTL_DDUDRIE_Msk               (0x2000UL)                /*!< DDUDRIE (Bitfield-Mask: 0x01)                         */
/* ==========================================================  SWT  ========================================================== */
#define DAC_SWT_SWTR_Pos                  (0UL)                     /*!< SWTR (Bit 0)                                          */
#define DAC_SWT_SWTR_Msk                  (0x1UL)                   /*!< SWTR (Bitfield-Mask: 0x01)                            */
/* =======================================================  DAC_R12DH  ======================================================= */
#define DAC_DAC_R12DH_DAC_DH_Pos          (0UL)                     /*!< DAC_DH (Bit 0)                                        */
#define DAC_DAC_R12DH_DAC_DH_Msk          (0xfffUL)                 /*!< DAC_DH (Bitfield-Mask: 0xfff)                         */
/* =======================================================  DAC_L12DH  ======================================================= */
#define DAC_DAC_L12DH_DAC_DH_Pos          (4UL)                     /*!< DAC_DH (Bit 4)                                        */
#define DAC_DAC_L12DH_DAC_DH_Msk          (0xfff0UL)                /*!< DAC_DH (Bitfield-Mask: 0xfff)                         */
/* =======================================================  DAC_R8DH  ======================================================== */
#define DAC_DAC_R8DH_DAC_DH_Pos           (0UL)                     /*!< DAC_DH (Bit 0)                                        */
#define DAC_DAC_R8DH_DAC_DH_Msk           (0xffUL)                  /*!< DAC_DH (Bitfield-Mask: 0xff)                          */
/* ========================================================  DAC_DO  ========================================================= */
#define DAC_DAC_DO_DAC_DO_Pos             (0UL)                     /*!< DAC_DO (Bit 0)                                        */
#define DAC_DAC_DO_DAC_DO_Msk             (0xfffUL)                 /*!< DAC_DO (Bitfield-Mask: 0xfff)                         */
/* =========================================================  STAT  ========================================================== */
#define DAC_STAT_DDUDR_Pos                (13UL)                    /*!< DDUDR (Bit 13)                                        */
#define DAC_STAT_DDUDR_Msk                (0x2000UL)                /*!< DDUDR (Bitfield-Mask: 0x01)                           */


/* =========================================================================================================================== */
/* ================                                            DBG                                            ================ */
/* =========================================================================================================================== */

/* ==========================================================  ID  =========================================================== */
#define DBG_ID_ID_CODE_Pos                (0UL)                     /*!< ID_CODE (Bit 0)                                       */
#define DBG_ID_ID_CODE_Msk                (0xffffffffUL)            /*!< ID_CODE (Bitfield-Mask: 0xffffffff)                   */
/* =========================================================  CTL0  ========================================================== */
#define DBG_CTL0_SLP_HOLD_Pos             (0UL)                     /*!< SLP_HOLD (Bit 0)                                      */
#define DBG_CTL0_SLP_HOLD_Msk             (0x1UL)                   /*!< SLP_HOLD (Bitfield-Mask: 0x01)                        */
#define DBG_CTL0_DSLP_HOLD_Pos            (1UL)                     /*!< DSLP_HOLD (Bit 1)                                     */
#define DBG_CTL0_DSLP_HOLD_Msk            (0x2UL)                   /*!< DSLP_HOLD (Bitfield-Mask: 0x01)                       */
#define DBG_CTL0_STB_HOLD_Pos             (2UL)                     /*!< STB_HOLD (Bit 2)                                      */
#define DBG_CTL0_STB_HOLD_Msk             (0x4UL)                   /*!< STB_HOLD (Bitfield-Mask: 0x01)                        */
#define DBG_CTL0_FWDGT_HOLD_Pos           (8UL)                     /*!< FWDGT_HOLD (Bit 8)                                    */
#define DBG_CTL0_FWDGT_HOLD_Msk           (0x100UL)                 /*!< FWDGT_HOLD (Bitfield-Mask: 0x01)                      */
#define DBG_CTL0_WWDGT_HOLD_Pos           (9UL)                     /*!< WWDGT_HOLD (Bit 9)                                    */
#define DBG_CTL0_WWDGT_HOLD_Msk           (0x200UL)                 /*!< WWDGT_HOLD (Bitfield-Mask: 0x01)                      */
#define DBG_CTL0_TIMER0_HOLD_Pos          (10UL)                    /*!< TIMER0_HOLD (Bit 10)                                  */
#define DBG_CTL0_TIMER0_HOLD_Msk          (0x400UL)                 /*!< TIMER0_HOLD (Bitfield-Mask: 0x01)                     */
#define DBG_CTL0_TIMER1_HOLD_Pos          (11UL)                    /*!< TIMER1_HOLD (Bit 11)                                  */
#define DBG_CTL0_TIMER1_HOLD_Msk          (0x800UL)                 /*!< TIMER1_HOLD (Bitfield-Mask: 0x01)                     */
#define DBG_CTL0_TIMER2_HOLD_Pos          (12UL)                    /*!< TIMER2_HOLD (Bit 12)                                  */
#define DBG_CTL0_TIMER2_HOLD_Msk          (0x1000UL)                /*!< TIMER2_HOLD (Bitfield-Mask: 0x01)                     */
#define DBG_CTL0_I2C0_HOLD_Pos            (15UL)                    /*!< I2C0_HOLD (Bit 15)                                    */
#define DBG_CTL0_I2C0_HOLD_Msk            (0x8000UL)                /*!< I2C0_HOLD (Bitfield-Mask: 0x01)                       */
#define DBG_CTL0_I2C1_HOLD_Pos            (16UL)                    /*!< I2C1_HOLD (Bit 16)                                    */
#define DBG_CTL0_I2C1_HOLD_Msk            (0x10000UL)               /*!< I2C1_HOLD (Bitfield-Mask: 0x01)                       */
#define DBG_CTL0_TIMER5_HOLD_Pos          (19UL)                    /*!< TIMER5_HOLD (Bit 19)                                  */
#define DBG_CTL0_TIMER5_HOLD_Msk          (0x80000UL)               /*!< TIMER5_HOLD (Bitfield-Mask: 0x01)                     */
#define DBG_CTL0_TIMER13_HOLD_Pos         (27UL)                    /*!< TIMER13_HOLD (Bit 27)                                 */
#define DBG_CTL0_TIMER13_HOLD_Msk         (0x8000000UL)             /*!< TIMER13_HOLD (Bitfield-Mask: 0x01)                    */
/* =========================================================  CTL1  ========================================================== */
#define DBG_CTL1_RTC_HOLD_Pos             (10UL)                    /*!< RTC_HOLD (Bit 10)                                     */
#define DBG_CTL1_RTC_HOLD_Msk             (0x400UL)                 /*!< RTC_HOLD (Bitfield-Mask: 0x01)                        */
#define DBG_CTL1_TIMER14_HOLD_Pos         (16UL)                    /*!< TIMER14_HOLD (Bit 16)                                 */
#define DBG_CTL1_TIMER14_HOLD_Msk         (0x10000UL)               /*!< TIMER14_HOLD (Bitfield-Mask: 0x01)                    */
#define DBG_CTL1_TIMER15_HOLD_Pos         (17UL)                    /*!< TIMER15_HOLD (Bit 17)                                 */
#define DBG_CTL1_TIMER15_HOLD_Msk         (0x20000UL)               /*!< TIMER15_HOLD (Bitfield-Mask: 0x01)                    */
#define DBG_CTL1_TIMER16_HOLD_Pos         (18UL)                    /*!< TIMER16_HOLD (Bit 18)                                 */
#define DBG_CTL1_TIMER16_HOLD_Msk         (0x40000UL)               /*!< TIMER16_HOLD (Bitfield-Mask: 0x01)                    */


/* =========================================================================================================================== */
/* ================                                            DMA                                            ================ */
/* =========================================================================================================================== */

