RIOT-OS/RIOT/cpu/gd32f3x0/include/gd32f3x0_periph.h
/* =========================================================  INTF  ========================================================== */
#define DMA_INTF_GIF0_Pos                 (0UL)                     /*!< GIF0 (Bit 0)                                          */
#define DMA_INTF_GIF0_Msk                 (0x1UL)                   /*!< GIF0 (Bitfield-Mask: 0x01)                            */
#define DMA_INTF_FTFIF0_Pos               (1UL)                     /*!< FTFIF0 (Bit 1)                                        */
#define DMA_INTF_FTFIF0_Msk               (0x2UL)                   /*!< FTFIF0 (Bitfield-Mask: 0x01)                          */
#define DMA_INTF_HTFIF0_Pos               (2UL)                     /*!< HTFIF0 (Bit 2)                                        */
#define DMA_INTF_HTFIF0_Msk               (0x4UL)                   /*!< HTFIF0 (Bitfield-Mask: 0x01)                          */
#define DMA_INTF_ERRIF0_Pos               (3UL)                     /*!< ERRIF0 (Bit 3)                                        */
#define DMA_INTF_ERRIF0_Msk               (0x8UL)                   /*!< ERRIF0 (Bitfield-Mask: 0x01)                          */
#define DMA_INTF_GIF1_Pos                 (4UL)                     /*!< GIF1 (Bit 4)                                          */
#define DMA_INTF_GIF1_Msk                 (0x10UL)                  /*!< GIF1 (Bitfield-Mask: 0x01)                            */
#define DMA_INTF_FTFIF1_Pos               (5UL)                     /*!< FTFIF1 (Bit 5)                                        */
#define DMA_INTF_FTFIF1_Msk               (0x20UL)                  /*!< FTFIF1 (Bitfield-Mask: 0x01)                          */
#define DMA_INTF_HTFIF1_Pos               (6UL)                     /*!< HTFIF1 (Bit 6)                                        */
#define DMA_INTF_HTFIF1_Msk               (0x40UL)                  /*!< HTFIF1 (Bitfield-Mask: 0x01)                          */
#define DMA_INTF_ERRIF1_Pos               (7UL)                     /*!< ERRIF1 (Bit 7)                                        */
#define DMA_INTF_ERRIF1_Msk               (0x80UL)                  /*!< ERRIF1 (Bitfield-Mask: 0x01)                          */
#define DMA_INTF_GIF2_Pos                 (8UL)                     /*!< GIF2 (Bit 8)                                          */
#define DMA_INTF_GIF2_Msk                 (0x100UL)                 /*!< GIF2 (Bitfield-Mask: 0x01)                            */
#define DMA_INTF_FTFIF2_Pos               (9UL)                     /*!< FTFIF2 (Bit 9)                                        */
#define DMA_INTF_FTFIF2_Msk               (0x200UL)                 /*!< FTFIF2 (Bitfield-Mask: 0x01)                          */
#define DMA_INTF_HTFIF2_Pos               (10UL)                    /*!< HTFIF2 (Bit 10)                                       */
#define DMA_INTF_HTFIF2_Msk               (0x400UL)                 /*!< HTFIF2 (Bitfield-Mask: 0x01)                          */
#define DMA_INTF_ERRIF2_Pos               (11UL)                    /*!< ERRIF2 (Bit 11)                                       */
#define DMA_INTF_ERRIF2_Msk               (0x800UL)                 /*!< ERRIF2 (Bitfield-Mask: 0x01)                          */
#define DMA_INTF_GIF3_Pos                 (12UL)                    /*!< GIF3 (Bit 12)                                         */
#define DMA_INTF_GIF3_Msk                 (0x1000UL)                /*!< GIF3 (Bitfield-Mask: 0x01)                            */
#define DMA_INTF_FTFIF3_Pos               (13UL)                    /*!< FTFIF3 (Bit 13)                                       */
#define DMA_INTF_FTFIF3_Msk               (0x2000UL)                /*!< FTFIF3 (Bitfield-Mask: 0x01)                          */
#define DMA_INTF_HTFIF3_Pos               (14UL)                    /*!< HTFIF3 (Bit 14)                                       */
#define DMA_INTF_HTFIF3_Msk               (0x4000UL)                /*!< HTFIF3 (Bitfield-Mask: 0x01)                          */
#define DMA_INTF_ERRIF3_Pos               (15UL)                    /*!< ERRIF3 (Bit 15)                                       */
#define DMA_INTF_ERRIF3_Msk               (0x8000UL)                /*!< ERRIF3 (Bitfield-Mask: 0x01)                          */
#define DMA_INTF_GIF4_Pos                 (16UL)                    /*!< GIF4 (Bit 16)                                         */
#define DMA_INTF_GIF4_Msk                 (0x10000UL)               /*!< GIF4 (Bitfield-Mask: 0x01)                            */
#define DMA_INTF_FTFIF4_Pos               (17UL)                    /*!< FTFIF4 (Bit 17)                                       */
#define DMA_INTF_FTFIF4_Msk               (0x20000UL)               /*!< FTFIF4 (Bitfield-Mask: 0x01)                          */
#define DMA_INTF_HTFIF4_Pos               (18UL)                    /*!< HTFIF4 (Bit 18)                                       */
#define DMA_INTF_HTFIF4_Msk               (0x40000UL)               /*!< HTFIF4 (Bitfield-Mask: 0x01)                          */
#define DMA_INTF_ERRIF4_Pos               (19UL)                    /*!< ERRIF4 (Bit 19)                                       */
#define DMA_INTF_ERRIF4_Msk               (0x80000UL)               /*!< ERRIF4 (Bitfield-Mask: 0x01)                          */
#define DMA_INTF_GIF5_Pos                 (20UL)                    /*!< GIF5 (Bit 20)                                         */
#define DMA_INTF_GIF5_Msk                 (0x100000UL)              /*!< GIF5 (Bitfield-Mask: 0x01)                            */
#define DMA_INTF_FTFIF5_Pos               (21UL)                    /*!< FTFIF5 (Bit 21)                                       */
#define DMA_INTF_FTFIF5_Msk               (0x200000UL)              /*!< FTFIF5 (Bitfield-Mask: 0x01)                          */
#define DMA_INTF_HTFIF5_Pos               (22UL)                    /*!< HTFIF5 (Bit 22)                                       */
#define DMA_INTF_HTFIF5_Msk               (0x400000UL)              /*!< HTFIF5 (Bitfield-Mask: 0x01)                          */
#define DMA_INTF_ERRIF5_Pos               (23UL)                    /*!< ERRIF5 (Bit 23)                                       */
#define DMA_INTF_ERRIF5_Msk               (0x800000UL)              /*!< ERRIF5 (Bitfield-Mask: 0x01)                          */
#define DMA_INTF_GIF6_Pos                 (24UL)                    /*!< GIF6 (Bit 24)                                         */
#define DMA_INTF_GIF6_Msk                 (0x1000000UL)             /*!< GIF6 (Bitfield-Mask: 0x01)                            */
#define DMA_INTF_FTFIF6_Pos               (25UL)                    /*!< FTFIF6 (Bit 25)                                       */
#define DMA_INTF_FTFIF6_Msk               (0x2000000UL)             /*!< FTFIF6 (Bitfield-Mask: 0x01)                          */
#define DMA_INTF_HTFIF6_Pos               (26UL)                    /*!< HTFIF6 (Bit 26)                                       */
#define DMA_INTF_HTFIF6_Msk               (0x4000000UL)             /*!< HTFIF6 (Bitfield-Mask: 0x01)                          */
#define DMA_INTF_ERRIF6_Pos               (27UL)                    /*!< ERRIF6 (Bit 27)                                       */
#define DMA_INTF_ERRIF6_Msk               (0x8000000UL)             /*!< ERRIF6 (Bitfield-Mask: 0x01)                          */
/* =========================================================  INTC  ========================================================== */
#define DMA_INTC_GIFC0_Pos                (0UL)                     /*!< GIFC0 (Bit 0)                                         */
#define DMA_INTC_GIFC0_Msk                (0x1UL)                   /*!< GIFC0 (Bitfield-Mask: 0x01)                           */
#define DMA_INTC_GIFC1_Pos                (4UL)                     /*!< GIFC1 (Bit 4)                                         */
#define DMA_INTC_GIFC1_Msk                (0x10UL)                  /*!< GIFC1 (Bitfield-Mask: 0x01)                           */
#define DMA_INTC_GIFC2_Pos                (8UL)                     /*!< GIFC2 (Bit 8)                                         */
#define DMA_INTC_GIFC2_Msk                (0x100UL)                 /*!< GIFC2 (Bitfield-Mask: 0x01)                           */
#define DMA_INTC_GIFC3_Pos                (12UL)                    /*!< GIFC3 (Bit 12)                                        */
#define DMA_INTC_GIFC3_Msk                (0x1000UL)                /*!< GIFC3 (Bitfield-Mask: 0x01)                           */
#define DMA_INTC_GIFC4_Pos                (16UL)                    /*!< GIFC4 (Bit 16)                                        */
#define DMA_INTC_GIFC4_Msk                (0x10000UL)               /*!< GIFC4 (Bitfield-Mask: 0x01)                           */
#define DMA_INTC_GIFC5_Pos                (20UL)                    /*!< GIFC5 (Bit 20)                                        */
#define DMA_INTC_GIFC5_Msk                (0x100000UL)              /*!< GIFC5 (Bitfield-Mask: 0x01)                           */
#define DMA_INTC_GIFC6_Pos                (24UL)                    /*!< GIFC6 (Bit 24)                                        */
#define DMA_INTC_GIFC6_Msk                (0x1000000UL)             /*!< GIFC6 (Bitfield-Mask: 0x01)                           */
#define DMA_INTC_FTFIFC0_Pos              (1UL)                     /*!< FTFIFC0 (Bit 1)                                       */
#define DMA_INTC_FTFIFC0_Msk              (0x2UL)                   /*!< FTFIFC0 (Bitfield-Mask: 0x01)                         */
#define DMA_INTC_FTFIFC1_Pos              (5UL)                     /*!< FTFIFC1 (Bit 5)                                       */
#define DMA_INTC_FTFIFC1_Msk              (0x20UL)                  /*!< FTFIFC1 (Bitfield-Mask: 0x01)                         */
#define DMA_INTC_FTFIFC2_Pos              (9UL)                     /*!< FTFIFC2 (Bit 9)                                       */
#define DMA_INTC_FTFIFC2_Msk              (0x200UL)                 /*!< FTFIFC2 (Bitfield-Mask: 0x01)                         */
#define DMA_INTC_FTFIFC3_Pos              (13UL)                    /*!< FTFIFC3 (Bit 13)                                      */
#define DMA_INTC_FTFIFC3_Msk              (0x2000UL)                /*!< FTFIFC3 (Bitfield-Mask: 0x01)                         */
#define DMA_INTC_FTFIFC4_Pos              (17UL)                    /*!< FTFIFC4 (Bit 17)                                      */
#define DMA_INTC_FTFIFC4_Msk              (0x20000UL)               /*!< FTFIFC4 (Bitfield-Mask: 0x01)                         */
#define DMA_INTC_FTFIFC5_Pos              (21UL)                    /*!< FTFIFC5 (Bit 21)                                      */
#define DMA_INTC_FTFIFC5_Msk              (0x200000UL)              /*!< FTFIFC5 (Bitfield-Mask: 0x01)                         */
#define DMA_INTC_FTFIFC6_Pos              (25UL)                    /*!< FTFIFC6 (Bit 25)                                      */
#define DMA_INTC_FTFIFC6_Msk              (0x2000000UL)             /*!< FTFIFC6 (Bitfield-Mask: 0x01)                         */
#define DMA_INTC_HTFIFC0_Pos              (2UL)                     /*!< HTFIFC0 (Bit 2)                                       */
#define DMA_INTC_HTFIFC0_Msk              (0x4UL)                   /*!< HTFIFC0 (Bitfield-Mask: 0x01)                         */
#define DMA_INTC_HTFIFC1_Pos              (6UL)                     /*!< HTFIFC1 (Bit 6)                                       */
#define DMA_INTC_HTFIFC1_Msk              (0x40UL)                  /*!< HTFIFC1 (Bitfield-Mask: 0x01)                         */
#define DMA_INTC_HTFIFC2_Pos              (10UL)                    /*!< HTFIFC2 (Bit 10)                                      */
#define DMA_INTC_HTFIFC2_Msk              (0x400UL)                 /*!< HTFIFC2 (Bitfield-Mask: 0x01)                         */
#define DMA_INTC_HTFIFC3_Pos              (14UL)                    /*!< HTFIFC3 (Bit 14)                                      */
#define DMA_INTC_HTFIFC3_Msk              (0x4000UL)                /*!< HTFIFC3 (Bitfield-Mask: 0x01)                         */
#define DMA_INTC_HTFIFC4_Pos              (18UL)                    /*!< HTFIFC4 (Bit 18)                                      */
#define DMA_INTC_HTFIFC4_Msk              (0x40000UL)               /*!< HTFIFC4 (Bitfield-Mask: 0x01)                         */
#define DMA_INTC_HTFIFC5_Pos              (22UL)                    /*!< HTFIFC5 (Bit 22)                                      */
#define DMA_INTC_HTFIFC5_Msk              (0x400000UL)              /*!< HTFIFC5 (Bitfield-Mask: 0x01)                         */
#define DMA_INTC_HTFIFC6_Pos              (26UL)                    /*!< HTFIFC6 (Bit 26)                                      */
#define DMA_INTC_HTFIFC6_Msk              (0x4000000UL)             /*!< HTFIFC6 (Bitfield-Mask: 0x01)                         */
#define DMA_INTC_ERRIFC0_Pos              (3UL)                     /*!< ERRIFC0 (Bit 3)                                       */
#define DMA_INTC_ERRIFC0_Msk              (0x8UL)                   /*!< ERRIFC0 (Bitfield-Mask: 0x01)                         */
#define DMA_INTC_ERRIFC1_Pos              (7UL)                     /*!< ERRIFC1 (Bit 7)                                       */
#define DMA_INTC_ERRIFC1_Msk              (0x80UL)                  /*!< ERRIFC1 (Bitfield-Mask: 0x01)                         */
#define DMA_INTC_ERRIFC2_Pos              (11UL)                    /*!< ERRIFC2 (Bit 11)                                      */
#define DMA_INTC_ERRIFC2_Msk              (0x800UL)                 /*!< ERRIFC2 (Bitfield-Mask: 0x01)                         */
#define DMA_INTC_ERRIFC3_Pos              (15UL)                    /*!< ERRIFC3 (Bit 15)                                      */
#define DMA_INTC_ERRIFC3_Msk              (0x8000UL)                /*!< ERRIFC3 (Bitfield-Mask: 0x01)                         */
#define DMA_INTC_ERRIFC4_Pos              (19UL)                    /*!< ERRIFC4 (Bit 19)                                      */
#define DMA_INTC_ERRIFC4_Msk              (0x80000UL)               /*!< ERRIFC4 (Bitfield-Mask: 0x01)                         */
#define DMA_INTC_ERRIFC5_Pos              (23UL)                    /*!< ERRIFC5 (Bit 23)                                      */
#define DMA_INTC_ERRIFC5_Msk              (0x800000UL)              /*!< ERRIFC5 (Bitfield-Mask: 0x01)                         */
#define DMA_INTC_ERRIFC6_Pos              (27UL)                    /*!< ERRIFC6 (Bit 27)                                      */
#define DMA_INTC_ERRIFC6_Msk              (0x8000000UL)             /*!< ERRIFC6 (Bitfield-Mask: 0x01)                         */
/* ========================================================  CH0CTL  ========================================================= */
#define DMA_CH0CTL_CHEN_Pos               (0UL)                     /*!< CHEN (Bit 0)                                          */
#define DMA_CH0CTL_CHEN_Msk               (0x1UL)                   /*!< CHEN (Bitfield-Mask: 0x01)                            */
#define DMA_CH0CTL_FTFIE_Pos              (1UL)                     /*!< FTFIE (Bit 1)                                         */
#define DMA_CH0CTL_FTFIE_Msk              (0x2UL)                   /*!< FTFIE (Bitfield-Mask: 0x01)                           */
#define DMA_CH0CTL_HTFIE_Pos              (2UL)                     /*!< HTFIE (Bit 2)                                         */
#define DMA_CH0CTL_HTFIE_Msk              (0x4UL)                   /*!< HTFIE (Bitfield-Mask: 0x01)                           */
#define DMA_CH0CTL_ERRIE_Pos              (3UL)                     /*!< ERRIE (Bit 3)                                         */
#define DMA_CH0CTL_ERRIE_Msk              (0x8UL)                   /*!< ERRIE (Bitfield-Mask: 0x01)                           */
#define DMA_CH0CTL_DIR_Pos                (4UL)                     /*!< DIR (Bit 4)                                           */
#define DMA_CH0CTL_DIR_Msk                (0x10UL)                  /*!< DIR (Bitfield-Mask: 0x01)                             */
#define DMA_CH0CTL_CMEN_Pos               (5UL)                     /*!< CMEN (Bit 5)                                          */
#define DMA_CH0CTL_CMEN_Msk               (0x20UL)                  /*!< CMEN (Bitfield-Mask: 0x01)                            */
#define DMA_CH0CTL_PNAGA_Pos              (6UL)                     /*!< PNAGA (Bit 6)                                         */
#define DMA_CH0CTL_PNAGA_Msk              (0x40UL)                  /*!< PNAGA (Bitfield-Mask: 0x01)                           */
#define DMA_CH0CTL_MNAGA_Pos              (7UL)                     /*!< MNAGA (Bit 7)                                         */
#define DMA_CH0CTL_MNAGA_Msk              (0x80UL)                  /*!< MNAGA (Bitfield-Mask: 0x01)                           */
#define DMA_CH0CTL_PWIDTH_Pos             (8UL)                     /*!< PWIDTH (Bit 8)                                        */
#define DMA_CH0CTL_PWIDTH_Msk             (0x300UL)                 /*!< PWIDTH (Bitfield-Mask: 0x03)                          */
#define DMA_CH0CTL_MWIDTH_Pos             (10UL)                    /*!< MWIDTH (Bit 10)                                       */
#define DMA_CH0CTL_MWIDTH_Msk             (0xc00UL)                 /*!< MWIDTH (Bitfield-Mask: 0x03)                          */
#define DMA_CH0CTL_PRIO_Pos               (12UL)                    /*!< PRIO (Bit 12)                                         */
#define DMA_CH0CTL_PRIO_Msk               (0x3000UL)                /*!< PRIO (Bitfield-Mask: 0x03)                            */
#define DMA_CH0CTL_M2M_Pos                (14UL)                    /*!< M2M (Bit 14)                                          */
#define DMA_CH0CTL_M2M_Msk                (0x4000UL)                /*!< M2M (Bitfield-Mask: 0x01)                             */
/* ========================================================  CH0CNT  ========================================================= */
#define DMA_CH0CNT_CNT_Pos                (0UL)                     /*!< CNT (Bit 0)                                           */
#define DMA_CH0CNT_CNT_Msk                (0xffffUL)                /*!< CNT (Bitfield-Mask: 0xffff)                           */
/* =======================================================  CH0PADDR  ======================================================== */
#define DMA_CH0PADDR_PADDR_Pos            (0UL)                     /*!< PADDR (Bit 0)                                         */
#define DMA_CH0PADDR_PADDR_Msk            (0xffffffffUL)            /*!< PADDR (Bitfield-Mask: 0xffffffff)                     */
/* =======================================================  CH0MADDR  ======================================================== */
#define DMA_CH0MADDR_MADDR_Pos            (0UL)                     /*!< MADDR (Bit 0)                                         */
#define DMA_CH0MADDR_MADDR_Msk            (0xffffffffUL)            /*!< MADDR (Bitfield-Mask: 0xffffffff)                     */
/* ========================================================  CH1CTL  ========================================================= */
#define DMA_CH1CTL_CHEN_Pos               (0UL)                     /*!< CHEN (Bit 0)                                          */
#define DMA_CH1CTL_CHEN_Msk               (0x1UL)                   /*!< CHEN (Bitfield-Mask: 0x01)                            */
#define DMA_CH1CTL_FTFIE_Pos              (1UL)                     /*!< FTFIE (Bit 1)                                         */
#define DMA_CH1CTL_FTFIE_Msk              (0x2UL)                   /*!< FTFIE (Bitfield-Mask: 0x01)                           */
#define DMA_CH1CTL_HTFIE_Pos              (2UL)                     /*!< HTFIE (Bit 2)                                         */
#define DMA_CH1CTL_HTFIE_Msk              (0x4UL)                   /*!< HTFIE (Bitfield-Mask: 0x01)                           */
#define DMA_CH1CTL_ERRIE_Pos              (3UL)                     /*!< ERRIE (Bit 3)                                         */
#define DMA_CH1CTL_ERRIE_Msk              (0x8UL)                   /*!< ERRIE (Bitfield-Mask: 0x01)                           */
#define DMA_CH1CTL_DIR_Pos                (4UL)                     /*!< DIR (Bit 4)                                           */
#define DMA_CH1CTL_DIR_Msk                (0x10UL)                  /*!< DIR (Bitfield-Mask: 0x01)                             */
#define DMA_CH1CTL_CMEN_Pos               (5UL)                     /*!< CMEN (Bit 5)                                          */
#define DMA_CH1CTL_CMEN_Msk               (0x20UL)                  /*!< CMEN (Bitfield-Mask: 0x01)                            */
#define DMA_CH1CTL_PNAGA_Pos              (6UL)                     /*!< PNAGA (Bit 6)                                         */
#define DMA_CH1CTL_PNAGA_Msk              (0x40UL)                  /*!< PNAGA (Bitfield-Mask: 0x01)                           */
#define DMA_CH1CTL_MNAGA_Pos              (7UL)                     /*!< MNAGA (Bit 7)                                         */
#define DMA_CH1CTL_MNAGA_Msk              (0x80UL)                  /*!< MNAGA (Bitfield-Mask: 0x01)                           */
#define DMA_CH1CTL_PWIDTH_Pos             (8UL)                     /*!< PWIDTH (Bit 8)                                        */
#define DMA_CH1CTL_PWIDTH_Msk             (0x300UL)                 /*!< PWIDTH (Bitfield-Mask: 0x03)                          */
#define DMA_CH1CTL_MWIDTH_Pos             (10UL)                    /*!< MWIDTH (Bit 10)                                       */
#define DMA_CH1CTL_MWIDTH_Msk             (0xc00UL)                 /*!< MWIDTH (Bitfield-Mask: 0x03)                          */
#define DMA_CH1CTL_PRIO_Pos               (12UL)                    /*!< PRIO (Bit 12)                                         */
#define DMA_CH1CTL_PRIO_Msk               (0x3000UL)                /*!< PRIO (Bitfield-Mask: 0x03)                            */
#define DMA_CH1CTL_M2M_Pos                (14UL)                    /*!< M2M (Bit 14)                                          */
#define DMA_CH1CTL_M2M_Msk                (0x4000UL)                /*!< M2M (Bitfield-Mask: 0x01)                             */
/* ========================================================  CH1CNT  ========================================================= */
#define DMA_CH1CNT_CNT_Pos                (0UL)                     /*!< CNT (Bit 0)                                           */
#define DMA_CH1CNT_CNT_Msk                (0xffffUL)                /*!< CNT (Bitfield-Mask: 0xffff)                           */
/* =======================================================  CH1PADDR  ======================================================== */
#define DMA_CH1PADDR_PADDR_Pos            (0UL)                     /*!< PADDR (Bit 0)                                         */
#define DMA_CH1PADDR_PADDR_Msk            (0xffffffffUL)            /*!< PADDR (Bitfield-Mask: 0xffffffff)                     */
/* =======================================================  CH1MADDR  ======================================================== */
#define DMA_CH1MADDR_MADDR_Pos            (0UL)                     /*!< MADDR (Bit 0)                                         */
#define DMA_CH1MADDR_MADDR_Msk            (0xffffffffUL)            /*!< MADDR (Bitfield-Mask: 0xffffffff)                     */
/* ========================================================  CH2CTL  ========================================================= */
#define DMA_CH2CTL_CHEN_Pos               (0UL)                     /*!< CHEN (Bit 0)                                          */
