RIOT-OS/RIOT/cpu/gd32f3x0/include/gd32f3x0_periph.h
/* ==========================================================  WS  =========================================================== */
#define FMC_WS_WSCNT_Pos                  (0UL)                     /*!< WSCNT (Bit 0)                                         */
#define FMC_WS_WSCNT_Msk                  (0x7UL)                   /*!< WSCNT (Bitfield-Mask: 0x07)                           */
/* ==========================================================  KEY  ========================================================== */
#define FMC_KEY_KEY_Pos                   (0UL)                     /*!< KEY (Bit 0)                                           */
#define FMC_KEY_KEY_Msk                   (0xffffffffUL)            /*!< KEY (Bitfield-Mask: 0xffffffff)                       */
/* =========================================================  OBKEY  ========================================================= */
#define FMC_OBKEY_OBKEY_Pos               (0UL)                     /*!< OBKEY (Bit 0)                                         */
#define FMC_OBKEY_OBKEY_Msk               (0xffffffffUL)            /*!< OBKEY (Bitfield-Mask: 0xffffffff)                     */
/* =========================================================  STAT  ========================================================== */
#define FMC_STAT_ENDF_Pos                 (5UL)                     /*!< ENDF (Bit 5)                                          */
#define FMC_STAT_ENDF_Msk                 (0x20UL)                  /*!< ENDF (Bitfield-Mask: 0x01)                            */
#define FMC_STAT_WPERR_Pos                (4UL)                     /*!< WPERR (Bit 4)                                         */
#define FMC_STAT_WPERR_Msk                (0x10UL)                  /*!< WPERR (Bitfield-Mask: 0x01)                           */
#define FMC_STAT_PGERR_Pos                (2UL)                     /*!< PGERR (Bit 2)                                         */
#define FMC_STAT_PGERR_Msk                (0x4UL)                   /*!< PGERR (Bitfield-Mask: 0x01)                           */
#define FMC_STAT_BUSY_Pos                 (0UL)                     /*!< BUSY (Bit 0)                                          */
#define FMC_STAT_BUSY_Msk                 (0x1UL)                   /*!< BUSY (Bitfield-Mask: 0x01)                            */
/* ==========================================================  CTL  ========================================================== */
#define FMC_CTL_OBRLD_Pos                 (13UL)                    /*!< OBRLD (Bit 13)                                        */
#define FMC_CTL_OBRLD_Msk                 (0x2000UL)                /*!< OBRLD (Bitfield-Mask: 0x01)                           */
#define FMC_CTL_ENDIE_Pos                 (12UL)                    /*!< ENDIE (Bit 12)                                        */
#define FMC_CTL_ENDIE_Msk                 (0x1000UL)                /*!< ENDIE (Bitfield-Mask: 0x01)                           */
#define FMC_CTL_ERRIE_Pos                 (10UL)                    /*!< ERRIE (Bit 10)                                        */
#define FMC_CTL_ERRIE_Msk                 (0x400UL)                 /*!< ERRIE (Bitfield-Mask: 0x01)                           */
#define FMC_CTL_OBWEN_Pos                 (9UL)                     /*!< OBWEN (Bit 9)                                         */
#define FMC_CTL_OBWEN_Msk                 (0x200UL)                 /*!< OBWEN (Bitfield-Mask: 0x01)                           */
#define FMC_CTL_LK_Pos                    (7UL)                     /*!< LK (Bit 7)                                            */
#define FMC_CTL_LK_Msk                    (0x80UL)                  /*!< LK (Bitfield-Mask: 0x01)                              */
#define FMC_CTL_START_Pos                 (6UL)                     /*!< START (Bit 6)                                         */
#define FMC_CTL_START_Msk                 (0x40UL)                  /*!< START (Bitfield-Mask: 0x01)                           */
#define FMC_CTL_OBER_Pos                  (5UL)                     /*!< OBER (Bit 5)                                          */
#define FMC_CTL_OBER_Msk                  (0x20UL)                  /*!< OBER (Bitfield-Mask: 0x01)                            */
#define FMC_CTL_OBPG_Pos                  (4UL)                     /*!< OBPG (Bit 4)                                          */
#define FMC_CTL_OBPG_Msk                  (0x10UL)                  /*!< OBPG (Bitfield-Mask: 0x01)                            */
#define FMC_CTL_MER_Pos                   (2UL)                     /*!< MER (Bit 2)                                           */
#define FMC_CTL_MER_Msk                   (0x4UL)                   /*!< MER (Bitfield-Mask: 0x01)                             */
#define FMC_CTL_PER_Pos                   (1UL)                     /*!< PER (Bit 1)                                           */
#define FMC_CTL_PER_Msk                   (0x2UL)                   /*!< PER (Bitfield-Mask: 0x01)                             */
#define FMC_CTL_PG_Pos                    (0UL)                     /*!< PG (Bit 0)                                            */
#define FMC_CTL_PG_Msk                    (0x1UL)                   /*!< PG (Bitfield-Mask: 0x01)                              */
/* =========================================================  ADDR  ========================================================== */
#define FMC_ADDR_ADDR_Pos                 (0UL)                     /*!< ADDR (Bit 0)                                          */
#define FMC_ADDR_ADDR_Msk                 (0xffffffffUL)            /*!< ADDR (Bitfield-Mask: 0xffffffff)                      */
/* ========================================================  OBSTAT  ========================================================= */
#define FMC_OBSTAT_OB_DATA_Pos            (16UL)                    /*!< OB_DATA (Bit 16)                                      */
#define FMC_OBSTAT_OB_DATA_Msk            (0xffff0000UL)            /*!< OB_DATA (Bitfield-Mask: 0xffff)                       */
#define FMC_OBSTAT_OB_USER_Pos            (8UL)                     /*!< OB_USER (Bit 8)                                       */
#define FMC_OBSTAT_OB_USER_Msk            (0xff00UL)                /*!< OB_USER (Bitfield-Mask: 0xff)                         */
#define FMC_OBSTAT_PLEVEL_Pos             (1UL)                     /*!< PLEVEL (Bit 1)                                        */
#define FMC_OBSTAT_PLEVEL_Msk             (0x6UL)                   /*!< PLEVEL (Bitfield-Mask: 0x03)                          */
#define FMC_OBSTAT_OBERR_Pos              (0UL)                     /*!< OBERR (Bit 0)                                         */
#define FMC_OBSTAT_OBERR_Msk              (0x1UL)                   /*!< OBERR (Bitfield-Mask: 0x01)                           */
/* ==========================================================  WP  =========================================================== */
#define FMC_WP_OB_WP_Pos                  (0UL)                     /*!< OB_WP (Bit 0)                                         */
#define FMC_WP_OB_WP_Msk                  (0xffffUL)                /*!< OB_WP (Bitfield-Mask: 0xffff)                         */
/* =========================================================  WSEN  ========================================================== */
#define FMC_WSEN_WSEN_Pos                 (0UL)                     /*!< WSEN (Bit 0)                                          */
#define FMC_WSEN_WSEN_Msk                 (0x1UL)                   /*!< WSEN (Bitfield-Mask: 0x01)                            */
#define FMC_WSEN_BPEN_Pos                 (1UL)                     /*!< BPEN (Bit 1)                                          */
#define FMC_WSEN_BPEN_Msk                 (0x2UL)                   /*!< BPEN (Bitfield-Mask: 0x01)                            */
/* ==========================================================  PID  ========================================================== */
#define FMC_PID_PID_Pos                   (0UL)                     /*!< PID (Bit 0)                                           */
#define FMC_PID_PID_Msk                   (0xffffffffUL)            /*!< PID (Bitfield-Mask: 0xffffffff)                       */


/* =========================================================================================================================== */
/* ================                                           FWDGT                                           ================ */
/* =========================================================================================================================== */

/* ==========================================================  CTL  ========================================================== */
#define FWDGT_CTL_CMD_Pos                 (0UL)                     /*!< CMD (Bit 0)                                           */
#define FWDGT_CTL_CMD_Msk                 (0xffffUL)                /*!< CMD (Bitfield-Mask: 0xffff)                           */
/* ==========================================================  PSC  ========================================================== */
#define FWDGT_PSC_PSC_Pos                 (0UL)                     /*!< PSC (Bit 0)                                           */
#define FWDGT_PSC_PSC_Msk                 (0x7UL)                   /*!< PSC (Bitfield-Mask: 0x07)                             */
/* ==========================================================  RLD  ========================================================== */
#define FWDGT_RLD_RLD_Pos                 (0UL)                     /*!< RLD (Bit 0)                                           */
#define FWDGT_RLD_RLD_Msk                 (0xfffUL)                 /*!< RLD (Bitfield-Mask: 0xfff)                            */
/* =========================================================  STAT  ========================================================== */
#define FWDGT_STAT_PUD_Pos                (0UL)                     /*!< PUD (Bit 0)                                           */
#define FWDGT_STAT_PUD_Msk                (0x1UL)                   /*!< PUD (Bitfield-Mask: 0x01)                             */
#define FWDGT_STAT_RUD_Pos                (1UL)                     /*!< RUD (Bit 1)                                           */
#define FWDGT_STAT_RUD_Msk                (0x2UL)                   /*!< RUD (Bitfield-Mask: 0x01)                             */
#define FWDGT_STAT_WUD_Pos                (2UL)                     /*!< WUD (Bit 2)                                           */
#define FWDGT_STAT_WUD_Msk                (0x4UL)                   /*!< WUD (Bitfield-Mask: 0x01)                             */
/* ==========================================================  WND  ========================================================== */
#define FWDGT_WND_WND_Pos                 (0UL)                     /*!< WND (Bit 0)                                           */
#define FWDGT_WND_WND_Msk                 (0xfffUL)                 /*!< WND (Bitfield-Mask: 0xfff)                            */


/* =========================================================================================================================== */
/* ================                                           GPIOA                                           ================ */
/* =========================================================================================================================== */

