RIOT-OS/RIOT/cpu/gd32f3x0/include/gd32f3x0_periph.h
#define GPIOA_TG_TG1_Pos                  (1UL)                     /*!< TG1 (Bit 1)                                           */
#define GPIOA_TG_TG1_Msk                  (0x2UL)                   /*!< TG1 (Bitfield-Mask: 0x01)                             */
#define GPIOA_TG_TG2_Pos                  (2UL)                     /*!< TG2 (Bit 2)                                           */
#define GPIOA_TG_TG2_Msk                  (0x4UL)                   /*!< TG2 (Bitfield-Mask: 0x01)                             */
#define GPIOA_TG_TG3_Pos                  (3UL)                     /*!< TG3 (Bit 3)                                           */
#define GPIOA_TG_TG3_Msk                  (0x8UL)                   /*!< TG3 (Bitfield-Mask: 0x01)                             */
#define GPIOA_TG_TG4_Pos                  (4UL)                     /*!< TG4 (Bit 4)                                           */
#define GPIOA_TG_TG4_Msk                  (0x10UL)                  /*!< TG4 (Bitfield-Mask: 0x01)                             */
#define GPIOA_TG_TG5_Pos                  (5UL)                     /*!< TG5 (Bit 5)                                           */
#define GPIOA_TG_TG5_Msk                  (0x20UL)                  /*!< TG5 (Bitfield-Mask: 0x01)                             */
#define GPIOA_TG_TG6_Pos                  (6UL)                     /*!< TG6 (Bit 6)                                           */
#define GPIOA_TG_TG6_Msk                  (0x40UL)                  /*!< TG6 (Bitfield-Mask: 0x01)                             */
#define GPIOA_TG_TG7_Pos                  (7UL)                     /*!< TG7 (Bit 7)                                           */
#define GPIOA_TG_TG7_Msk                  (0x80UL)                  /*!< TG7 (Bitfield-Mask: 0x01)                             */
#define GPIOA_TG_TG8_Pos                  (8UL)                     /*!< TG8 (Bit 8)                                           */
#define GPIOA_TG_TG8_Msk                  (0x100UL)                 /*!< TG8 (Bitfield-Mask: 0x01)                             */
#define GPIOA_TG_TG9_Pos                  (9UL)                     /*!< TG9 (Bit 9)                                           */
#define GPIOA_TG_TG9_Msk                  (0x200UL)                 /*!< TG9 (Bitfield-Mask: 0x01)                             */
#define GPIOA_TG_TG10_Pos                 (10UL)                    /*!< TG10 (Bit 10)                                         */
#define GPIOA_TG_TG10_Msk                 (0x400UL)                 /*!< TG10 (Bitfield-Mask: 0x01)                            */
#define GPIOA_TG_TG11_Pos                 (11UL)                    /*!< TG11 (Bit 11)                                         */
#define GPIOA_TG_TG11_Msk                 (0x800UL)                 /*!< TG11 (Bitfield-Mask: 0x01)                            */
#define GPIOA_TG_TG12_Pos                 (12UL)                    /*!< TG12 (Bit 12)                                         */
#define GPIOA_TG_TG12_Msk                 (0x1000UL)                /*!< TG12 (Bitfield-Mask: 0x01)                            */
#define GPIOA_TG_TG13_Pos                 (13UL)                    /*!< TG13 (Bit 13)                                         */
#define GPIOA_TG_TG13_Msk                 (0x2000UL)                /*!< TG13 (Bitfield-Mask: 0x01)                            */
#define GPIOA_TG_TG14_Pos                 (14UL)                    /*!< TG14 (Bit 14)                                         */
#define GPIOA_TG_TG14_Msk                 (0x4000UL)                /*!< TG14 (Bitfield-Mask: 0x01)                            */
#define GPIOA_TG_TG15_Pos                 (15UL)                    /*!< TG15 (Bit 15)                                         */
#define GPIOA_TG_TG15_Msk                 (0x8000UL)                /*!< TG15 (Bitfield-Mask: 0x01)                            */
/* =========================================================  OSPD1  ========================================================= */
#define GPIOA_OSPD1_SPD0_Pos              (0UL)                     /*!< SPD0 (Bit 0)                                          */
#define GPIOA_OSPD1_SPD0_Msk              (0x1UL)                   /*!< SPD0 (Bitfield-Mask: 0x01)                            */
#define GPIOA_OSPD1_SPD1_Pos              (1UL)                     /*!< SPD1 (Bit 1)                                          */
#define GPIOA_OSPD1_SPD1_Msk              (0x2UL)                   /*!< SPD1 (Bitfield-Mask: 0x01)                            */
#define GPIOA_OSPD1_SPD2_Pos              (2UL)                     /*!< SPD2 (Bit 2)                                          */
#define GPIOA_OSPD1_SPD2_Msk              (0x4UL)                   /*!< SPD2 (Bitfield-Mask: 0x01)                            */
#define GPIOA_OSPD1_SPD3_Pos              (3UL)                     /*!< SPD3 (Bit 3)                                          */
#define GPIOA_OSPD1_SPD3_Msk              (0x8UL)                   /*!< SPD3 (Bitfield-Mask: 0x01)                            */
#define GPIOA_OSPD1_SPD4_Pos              (4UL)                     /*!< SPD4 (Bit 4)                                          */
#define GPIOA_OSPD1_SPD4_Msk              (0x10UL)                  /*!< SPD4 (Bitfield-Mask: 0x01)                            */
#define GPIOA_OSPD1_SPD5_Pos              (5UL)                     /*!< SPD5 (Bit 5)                                          */
#define GPIOA_OSPD1_SPD5_Msk              (0x20UL)                  /*!< SPD5 (Bitfield-Mask: 0x01)                            */
#define GPIOA_OSPD1_SPD6_Pos              (6UL)                     /*!< SPD6 (Bit 6)                                          */
#define GPIOA_OSPD1_SPD6_Msk              (0x40UL)                  /*!< SPD6 (Bitfield-Mask: 0x01)                            */
#define GPIOA_OSPD1_SPD7_Pos              (7UL)                     /*!< SPD7 (Bit 7)                                          */
#define GPIOA_OSPD1_SPD7_Msk              (0x80UL)                  /*!< SPD7 (Bitfield-Mask: 0x01)                            */
#define GPIOA_OSPD1_SPD8_Pos              (8UL)                     /*!< SPD8 (Bit 8)                                          */
#define GPIOA_OSPD1_SPD8_Msk              (0x100UL)                 /*!< SPD8 (Bitfield-Mask: 0x01)                            */
#define GPIOA_OSPD1_SPD9_Pos              (9UL)                     /*!< SPD9 (Bit 9)                                          */
#define GPIOA_OSPD1_SPD9_Msk              (0x200UL)                 /*!< SPD9 (Bitfield-Mask: 0x01)                            */
#define GPIOA_OSPD1_SPD10_Pos             (10UL)                    /*!< SPD10 (Bit 10)                                        */
#define GPIOA_OSPD1_SPD10_Msk             (0x400UL)                 /*!< SPD10 (Bitfield-Mask: 0x01)                           */
#define GPIOA_OSPD1_SPD11_Pos             (11UL)                    /*!< SPD11 (Bit 11)                                        */
#define GPIOA_OSPD1_SPD11_Msk             (0x800UL)                 /*!< SPD11 (Bitfield-Mask: 0x01)                           */
#define GPIOA_OSPD1_SPD12_Pos             (12UL)                    /*!< SPD12 (Bit 12)                                        */
#define GPIOA_OSPD1_SPD12_Msk             (0x1000UL)                /*!< SPD12 (Bitfield-Mask: 0x01)                           */
#define GPIOA_OSPD1_SPD13_Pos             (13UL)                    /*!< SPD13 (Bit 13)                                        */
#define GPIOA_OSPD1_SPD13_Msk             (0x2000UL)                /*!< SPD13 (Bitfield-Mask: 0x01)                           */
#define GPIOA_OSPD1_SPD14_Pos             (14UL)                    /*!< SPD14 (Bit 14)                                        */
#define GPIOA_OSPD1_SPD14_Msk             (0x4000UL)                /*!< SPD14 (Bitfield-Mask: 0x01)                           */
#define GPIOA_OSPD1_SPD15_Pos             (15UL)                    /*!< SPD15 (Bit 15)                                        */
#define GPIOA_OSPD1_SPD15_Msk             (0x8000UL)                /*!< SPD15 (Bitfield-Mask: 0x01)                           */


/* =========================================================================================================================== */
/* ================                                           GPIOB                                           ================ */
/* =========================================================================================================================== */

