RIOT-OS/RIOT/cpu/gd32f3x0/include/gd32f3x0_periph.h
#define GPIOF_ISTAT_ISTAT4_Msk            (0x10UL)                  /*!< ISTAT4 (Bitfield-Mask: 0x01)                          */
#define GPIOF_ISTAT_ISTAT3_Pos            (3UL)                     /*!< ISTAT3 (Bit 3)                                        */
#define GPIOF_ISTAT_ISTAT3_Msk            (0x8UL)                   /*!< ISTAT3 (Bitfield-Mask: 0x01)                          */
#define GPIOF_ISTAT_ISTAT2_Pos            (2UL)                     /*!< ISTAT2 (Bit 2)                                        */
#define GPIOF_ISTAT_ISTAT2_Msk            (0x4UL)                   /*!< ISTAT2 (Bitfield-Mask: 0x01)                          */
#define GPIOF_ISTAT_ISTAT1_Pos            (1UL)                     /*!< ISTAT1 (Bit 1)                                        */
#define GPIOF_ISTAT_ISTAT1_Msk            (0x2UL)                   /*!< ISTAT1 (Bitfield-Mask: 0x01)                          */
#define GPIOF_ISTAT_ISTAT0_Pos            (0UL)                     /*!< ISTAT0 (Bit 0)                                        */
#define GPIOF_ISTAT_ISTAT0_Msk            (0x1UL)                   /*!< ISTAT0 (Bitfield-Mask: 0x01)                          */
/* =========================================================  OCTL  ========================================================== */
#define GPIOF_OCTL_OCTL15_Pos             (15UL)                    /*!< OCTL15 (Bit 15)                                       */
#define GPIOF_OCTL_OCTL15_Msk             (0x8000UL)                /*!< OCTL15 (Bitfield-Mask: 0x01)                          */
#define GPIOF_OCTL_OCTL14_Pos             (14UL)                    /*!< OCTL14 (Bit 14)                                       */
#define GPIOF_OCTL_OCTL14_Msk             (0x4000UL)                /*!< OCTL14 (Bitfield-Mask: 0x01)                          */
#define GPIOF_OCTL_OCTL13_Pos             (13UL)                    /*!< OCTL13 (Bit 13)                                       */
#define GPIOF_OCTL_OCTL13_Msk             (0x2000UL)                /*!< OCTL13 (Bitfield-Mask: 0x01)                          */
#define GPIOF_OCTL_OCTL12_Pos             (12UL)                    /*!< OCTL12 (Bit 12)                                       */
#define GPIOF_OCTL_OCTL12_Msk             (0x1000UL)                /*!< OCTL12 (Bitfield-Mask: 0x01)                          */
#define GPIOF_OCTL_OCTL11_Pos             (11UL)                    /*!< OCTL11 (Bit 11)                                       */
#define GPIOF_OCTL_OCTL11_Msk             (0x800UL)                 /*!< OCTL11 (Bitfield-Mask: 0x01)                          */
#define GPIOF_OCTL_OCTL10_Pos             (10UL)                    /*!< OCTL10 (Bit 10)                                       */
#define GPIOF_OCTL_OCTL10_Msk             (0x400UL)                 /*!< OCTL10 (Bitfield-Mask: 0x01)                          */
#define GPIOF_OCTL_OCTL9_Pos              (9UL)                     /*!< OCTL9 (Bit 9)                                         */
#define GPIOF_OCTL_OCTL9_Msk              (0x200UL)                 /*!< OCTL9 (Bitfield-Mask: 0x01)                           */
#define GPIOF_OCTL_OCTL8_Pos              (8UL)                     /*!< OCTL8 (Bit 8)                                         */
#define GPIOF_OCTL_OCTL8_Msk              (0x100UL)                 /*!< OCTL8 (Bitfield-Mask: 0x01)                           */
#define GPIOF_OCTL_OCTL7_Pos              (7UL)                     /*!< OCTL7 (Bit 7)                                         */
#define GPIOF_OCTL_OCTL7_Msk              (0x80UL)                  /*!< OCTL7 (Bitfield-Mask: 0x01)                           */
#define GPIOF_OCTL_OCTL6_Pos              (6UL)                     /*!< OCTL6 (Bit 6)                                         */
#define GPIOF_OCTL_OCTL6_Msk              (0x40UL)                  /*!< OCTL6 (Bitfield-Mask: 0x01)                           */
#define GPIOF_OCTL_OCTL5_Pos              (5UL)                     /*!< OCTL5 (Bit 5)                                         */
#define GPIOF_OCTL_OCTL5_Msk              (0x20UL)                  /*!< OCTL5 (Bitfield-Mask: 0x01)                           */
#define GPIOF_OCTL_OCTL4_Pos              (4UL)                     /*!< OCTL4 (Bit 4)                                         */
#define GPIOF_OCTL_OCTL4_Msk              (0x10UL)                  /*!< OCTL4 (Bitfield-Mask: 0x01)                           */
#define GPIOF_OCTL_OCTL3_Pos              (3UL)                     /*!< OCTL3 (Bit 3)                                         */
#define GPIOF_OCTL_OCTL3_Msk              (0x8UL)                   /*!< OCTL3 (Bitfield-Mask: 0x01)                           */
#define GPIOF_OCTL_OCTL2_Pos              (2UL)                     /*!< OCTL2 (Bit 2)                                         */
#define GPIOF_OCTL_OCTL2_Msk              (0x4UL)                   /*!< OCTL2 (Bitfield-Mask: 0x01)                           */
#define GPIOF_OCTL_OCTL1_Pos              (1UL)                     /*!< OCTL1 (Bit 1)                                         */
#define GPIOF_OCTL_OCTL1_Msk              (0x2UL)                   /*!< OCTL1 (Bitfield-Mask: 0x01)                           */
#define GPIOF_OCTL_OCTL0_Pos              (0UL)                     /*!< OCTL0 (Bit 0)                                         */
#define GPIOF_OCTL_OCTL0_Msk              (0x1UL)                   /*!< OCTL0 (Bitfield-Mask: 0x01)                           */
/* ==========================================================  BOP  ========================================================== */
#define GPIOF_BOP_CR15_Pos                (31UL)                    /*!< CR15 (Bit 31)                                         */
#define GPIOF_BOP_CR15_Msk                (0x80000000UL)            /*!< CR15 (Bitfield-Mask: 0x01)                            */
#define GPIOF_BOP_CR14_Pos                (30UL)                    /*!< CR14 (Bit 30)                                         */
#define GPIOF_BOP_CR14_Msk                (0x40000000UL)            /*!< CR14 (Bitfield-Mask: 0x01)                            */
#define GPIOF_BOP_CR13_Pos                (29UL)                    /*!< CR13 (Bit 29)                                         */
#define GPIOF_BOP_CR13_Msk                (0x20000000UL)            /*!< CR13 (Bitfield-Mask: 0x01)                            */
#define GPIOF_BOP_CR12_Pos                (28UL)                    /*!< CR12 (Bit 28)                                         */
#define GPIOF_BOP_CR12_Msk                (0x10000000UL)            /*!< CR12 (Bitfield-Mask: 0x01)                            */
#define GPIOF_BOP_CR11_Pos                (27UL)                    /*!< CR11 (Bit 27)                                         */
#define GPIOF_BOP_CR11_Msk                (0x8000000UL)             /*!< CR11 (Bitfield-Mask: 0x01)                            */
#define GPIOF_BOP_CR10_Pos                (26UL)                    /*!< CR10 (Bit 26)                                         */
#define GPIOF_BOP_CR10_Msk                (0x4000000UL)             /*!< CR10 (Bitfield-Mask: 0x01)                            */
#define GPIOF_BOP_CR9_Pos                 (25UL)                    /*!< CR9 (Bit 25)                                          */
#define GPIOF_BOP_CR9_Msk                 (0x2000000UL)             /*!< CR9 (Bitfield-Mask: 0x01)                             */
#define GPIOF_BOP_CR8_Pos                 (24UL)                    /*!< CR8 (Bit 24)                                          */
#define GPIOF_BOP_CR8_Msk                 (0x1000000UL)             /*!< CR8 (Bitfield-Mask: 0x01)                             */
#define GPIOF_BOP_CR7_Pos                 (23UL)                    /*!< CR7 (Bit 23)                                          */
#define GPIOF_BOP_CR7_Msk                 (0x800000UL)              /*!< CR7 (Bitfield-Mask: 0x01)                             */
#define GPIOF_BOP_CR6_Pos                 (22UL)                    /*!< CR6 (Bit 22)                                          */
#define GPIOF_BOP_CR6_Msk                 (0x400000UL)              /*!< CR6 (Bitfield-Mask: 0x01)                             */
#define GPIOF_BOP_CR5_Pos                 (21UL)                    /*!< CR5 (Bit 21)                                          */
#define GPIOF_BOP_CR5_Msk                 (0x200000UL)              /*!< CR5 (Bitfield-Mask: 0x01)                             */
#define GPIOF_BOP_CR4_Pos                 (20UL)                    /*!< CR4 (Bit 20)                                          */
#define GPIOF_BOP_CR4_Msk                 (0x100000UL)              /*!< CR4 (Bitfield-Mask: 0x01)                             */
#define GPIOF_BOP_CR3_Pos                 (19UL)                    /*!< CR3 (Bit 19)                                          */
#define GPIOF_BOP_CR3_Msk                 (0x80000UL)               /*!< CR3 (Bitfield-Mask: 0x01)                             */
#define GPIOF_BOP_CR2_Pos                 (18UL)                    /*!< CR2 (Bit 18)                                          */
#define GPIOF_BOP_CR2_Msk                 (0x40000UL)               /*!< CR2 (Bitfield-Mask: 0x01)                             */
#define GPIOF_BOP_CR1_Pos                 (17UL)                    /*!< CR1 (Bit 17)                                          */
#define GPIOF_BOP_CR1_Msk                 (0x20000UL)               /*!< CR1 (Bitfield-Mask: 0x01)                             */
#define GPIOF_BOP_CR0_Pos                 (16UL)                    /*!< CR0 (Bit 16)                                          */
#define GPIOF_BOP_CR0_Msk                 (0x10000UL)               /*!< CR0 (Bitfield-Mask: 0x01)                             */
#define GPIOF_BOP_BOP15_Pos               (15UL)                    /*!< BOP15 (Bit 15)                                        */
#define GPIOF_BOP_BOP15_Msk               (0x8000UL)                /*!< BOP15 (Bitfield-Mask: 0x01)                           */
#define GPIOF_BOP_BOP14_Pos               (14UL)                    /*!< BOP14 (Bit 14)                                        */
#define GPIOF_BOP_BOP14_Msk               (0x4000UL)                /*!< BOP14 (Bitfield-Mask: 0x01)                           */
#define GPIOF_BOP_BOP13_Pos               (13UL)                    /*!< BOP13 (Bit 13)                                        */
#define GPIOF_BOP_BOP13_Msk               (0x2000UL)                /*!< BOP13 (Bitfield-Mask: 0x01)                           */
#define GPIOF_BOP_BOP12_Pos               (12UL)                    /*!< BOP12 (Bit 12)                                        */
#define GPIOF_BOP_BOP12_Msk               (0x1000UL)                /*!< BOP12 (Bitfield-Mask: 0x01)                           */
#define GPIOF_BOP_BOP11_Pos               (11UL)                    /*!< BOP11 (Bit 11)                                        */
#define GPIOF_BOP_BOP11_Msk               (0x800UL)                 /*!< BOP11 (Bitfield-Mask: 0x01)                           */
#define GPIOF_BOP_BOP10_Pos               (10UL)                    /*!< BOP10 (Bit 10)                                        */
#define GPIOF_BOP_BOP10_Msk               (0x400UL)                 /*!< BOP10 (Bitfield-Mask: 0x01)                           */
#define GPIOF_BOP_BOP9_Pos                (9UL)                     /*!< BOP9 (Bit 9)                                          */
#define GPIOF_BOP_BOP9_Msk                (0x200UL)                 /*!< BOP9 (Bitfield-Mask: 0x01)                            */
#define GPIOF_BOP_BOP8_Pos                (8UL)                     /*!< BOP8 (Bit 8)                                          */
#define GPIOF_BOP_BOP8_Msk                (0x100UL)                 /*!< BOP8 (Bitfield-Mask: 0x01)                            */
#define GPIOF_BOP_BOP7_Pos                (7UL)                     /*!< BOP7 (Bit 7)                                          */
#define GPIOF_BOP_BOP7_Msk                (0x80UL)                  /*!< BOP7 (Bitfield-Mask: 0x01)                            */
#define GPIOF_BOP_BOP6_Pos                (6UL)                     /*!< BOP6 (Bit 6)                                          */
#define GPIOF_BOP_BOP6_Msk                (0x40UL)                  /*!< BOP6 (Bitfield-Mask: 0x01)                            */
#define GPIOF_BOP_BOP5_Pos                (5UL)                     /*!< BOP5 (Bit 5)                                          */
#define GPIOF_BOP_BOP5_Msk                (0x20UL)                  /*!< BOP5 (Bitfield-Mask: 0x01)                            */
#define GPIOF_BOP_BOP4_Pos                (4UL)                     /*!< BOP4 (Bit 4)                                          */
#define GPIOF_BOP_BOP4_Msk                (0x10UL)                  /*!< BOP4 (Bitfield-Mask: 0x01)                            */
#define GPIOF_BOP_BOP3_Pos                (3UL)                     /*!< BOP3 (Bit 3)                                          */
#define GPIOF_BOP_BOP3_Msk                (0x8UL)                   /*!< BOP3 (Bitfield-Mask: 0x01)                            */
#define GPIOF_BOP_BOP2_Pos                (2UL)                     /*!< BOP2 (Bit 2)                                          */
#define GPIOF_BOP_BOP2_Msk                (0x4UL)                   /*!< BOP2 (Bitfield-Mask: 0x01)                            */
#define GPIOF_BOP_BOP1_Pos                (1UL)                     /*!< BOP1 (Bit 1)                                          */
#define GPIOF_BOP_BOP1_Msk                (0x2UL)                   /*!< BOP1 (Bitfield-Mask: 0x01)                            */
#define GPIOF_BOP_BOP0_Pos                (0UL)                     /*!< BOP0 (Bit 0)                                          */
#define GPIOF_BOP_BOP0_Msk                (0x1UL)                   /*!< BOP0 (Bitfield-Mask: 0x01)                            */
/* ==========================================================  BC  =========================================================== */
#define GPIOF_BC_CR0_Pos                  (0UL)                     /*!< CR0 (Bit 0)                                           */
#define GPIOF_BC_CR0_Msk                  (0x1UL)                   /*!< CR0 (Bitfield-Mask: 0x01)                             */
#define GPIOF_BC_CR1_Pos                  (1UL)                     /*!< CR1 (Bit 1)                                           */
#define GPIOF_BC_CR1_Msk                  (0x2UL)                   /*!< CR1 (Bitfield-Mask: 0x01)                             */
#define GPIOF_BC_CR2_Pos                  (2UL)                     /*!< CR2 (Bit 2)                                           */
#define GPIOF_BC_CR2_Msk                  (0x4UL)                   /*!< CR2 (Bitfield-Mask: 0x01)                             */
#define GPIOF_BC_CR3_Pos                  (3UL)                     /*!< CR3 (Bit 3)                                           */
#define GPIOF_BC_CR3_Msk                  (0x8UL)                   /*!< CR3 (Bitfield-Mask: 0x01)                             */
#define GPIOF_BC_CR4_Pos                  (4UL)                     /*!< CR4 (Bit 4)                                           */
#define GPIOF_BC_CR4_Msk                  (0x10UL)                  /*!< CR4 (Bitfield-Mask: 0x01)                             */
#define GPIOF_BC_CR5_Pos                  (5UL)                     /*!< CR5 (Bit 5)                                           */
#define GPIOF_BC_CR5_Msk                  (0x20UL)                  /*!< CR5 (Bitfield-Mask: 0x01)                             */
#define GPIOF_BC_CR6_Pos                  (6UL)                     /*!< CR6 (Bit 6)                                           */
#define GPIOF_BC_CR6_Msk                  (0x40UL)                  /*!< CR6 (Bitfield-Mask: 0x01)                             */
#define GPIOF_BC_CR7_Pos                  (7UL)                     /*!< CR7 (Bit 7)                                           */
#define GPIOF_BC_CR7_Msk                  (0x80UL)                  /*!< CR7 (Bitfield-Mask: 0x01)                             */
#define GPIOF_BC_CR8_Pos                  (8UL)                     /*!< CR8 (Bit 8)                                           */
#define GPIOF_BC_CR8_Msk                  (0x100UL)                 /*!< CR8 (Bitfield-Mask: 0x01)                             */
#define GPIOF_BC_CR9_Pos                  (9UL)                     /*!< CR9 (Bit 9)                                           */
#define GPIOF_BC_CR9_Msk                  (0x200UL)                 /*!< CR9 (Bitfield-Mask: 0x01)                             */
#define GPIOF_BC_CR10_Pos                 (10UL)                    /*!< CR10 (Bit 10)                                         */
#define GPIOF_BC_CR10_Msk                 (0x400UL)                 /*!< CR10 (Bitfield-Mask: 0x01)                            */
#define GPIOF_BC_CR11_Pos                 (11UL)                    /*!< CR11 (Bit 11)                                         */
#define GPIOF_BC_CR11_Msk                 (0x800UL)                 /*!< CR11 (Bitfield-Mask: 0x01)                            */
#define GPIOF_BC_CR12_Pos                 (12UL)                    /*!< CR12 (Bit 12)                                         */
#define GPIOF_BC_CR12_Msk                 (0x1000UL)                /*!< CR12 (Bitfield-Mask: 0x01)                            */
#define GPIOF_BC_CR13_Pos                 (13UL)                    /*!< CR13 (Bit 13)                                         */
#define GPIOF_BC_CR13_Msk                 (0x2000UL)                /*!< CR13 (Bitfield-Mask: 0x01)                            */
#define GPIOF_BC_CR14_Pos                 (14UL)                    /*!< CR14 (Bit 14)                                         */
#define GPIOF_BC_CR14_Msk                 (0x4000UL)                /*!< CR14 (Bitfield-Mask: 0x01)                            */
#define GPIOF_BC_CR15_Pos                 (15UL)                    /*!< CR15 (Bit 15)                                         */
#define GPIOF_BC_CR15_Msk                 (0x8000UL)                /*!< CR15 (Bitfield-Mask: 0x01)                            */
/* ==========================================================  TG  =========================================================== */
#define GPIOF_TG_TG0_Pos                  (0UL)                     /*!< TG0 (Bit 0)                                           */
#define GPIOF_TG_TG0_Msk                  (0x1UL)                   /*!< TG0 (Bitfield-Mask: 0x01)                             */
#define GPIOF_TG_TG1_Pos                  (1UL)                     /*!< TG1 (Bit 1)                                           */
#define GPIOF_TG_TG1_Msk                  (0x2UL)                   /*!< TG1 (Bitfield-Mask: 0x01)                             */
#define GPIOF_TG_TG2_Pos                  (2UL)                     /*!< TG2 (Bit 2)                                           */
#define GPIOF_TG_TG2_Msk                  (0x4UL)                   /*!< TG2 (Bitfield-Mask: 0x01)                             */
#define GPIOF_TG_TG3_Pos                  (3UL)                     /*!< TG3 (Bit 3)                                           */
#define GPIOF_TG_TG3_Msk                  (0x8UL)                   /*!< TG3 (Bitfield-Mask: 0x01)                             */
#define GPIOF_TG_TG4_Pos                  (4UL)                     /*!< TG4 (Bit 4)                                           */
#define GPIOF_TG_TG4_Msk                  (0x10UL)                  /*!< TG4 (Bitfield-Mask: 0x01)                             */
#define GPIOF_TG_TG5_Pos                  (5UL)                     /*!< TG5 (Bit 5)                                           */
#define GPIOF_TG_TG5_Msk                  (0x20UL)                  /*!< TG5 (Bitfield-Mask: 0x01)                             */
#define GPIOF_TG_TG6_Pos                  (6UL)                     /*!< TG6 (Bit 6)                                           */
#define GPIOF_TG_TG6_Msk                  (0x40UL)                  /*!< TG6 (Bitfield-Mask: 0x01)                             */
#define GPIOF_TG_TG7_Pos                  (7UL)                     /*!< TG7 (Bit 7)                                           */
#define GPIOF_TG_TG7_Msk                  (0x80UL)                  /*!< TG7 (Bitfield-Mask: 0x01)                             */
#define GPIOF_TG_TG8_Pos                  (8UL)                     /*!< TG8 (Bit 8)                                           */
#define GPIOF_TG_TG8_Msk                  (0x100UL)                 /*!< TG8 (Bitfield-Mask: 0x01)                             */
#define GPIOF_TG_TG9_Pos                  (9UL)                     /*!< TG9 (Bit 9)                                           */
#define GPIOF_TG_TG9_Msk                  (0x200UL)                 /*!< TG9 (Bitfield-Mask: 0x01)                             */
#define GPIOF_TG_TG10_Pos                 (10UL)                    /*!< TG10 (Bit 10)                                         */
#define GPIOF_TG_TG10_Msk                 (0x400UL)                 /*!< TG10 (Bitfield-Mask: 0x01)                            */
#define GPIOF_TG_TG11_Pos                 (11UL)                    /*!< TG11 (Bit 11)                                         */
#define GPIOF_TG_TG11_Msk                 (0x800UL)                 /*!< TG11 (Bitfield-Mask: 0x01)                            */
#define GPIOF_TG_TG12_Pos                 (12UL)                    /*!< TG12 (Bit 12)                                         */
#define GPIOF_TG_TG12_Msk                 (0x1000UL)                /*!< TG12 (Bitfield-Mask: 0x01)                            */
#define GPIOF_TG_TG13_Pos                 (13UL)                    /*!< TG13 (Bit 13)                                         */
#define GPIOF_TG_TG13_Msk                 (0x2000UL)                /*!< TG13 (Bitfield-Mask: 0x01)                            */
#define GPIOF_TG_TG14_Pos                 (14UL)                    /*!< TG14 (Bit 14)                                         */
#define GPIOF_TG_TG14_Msk                 (0x4000UL)                /*!< TG14 (Bitfield-Mask: 0x01)                            */
#define GPIOF_TG_TG15_Pos                 (15UL)                    /*!< TG15 (Bit 15)                                         */
#define GPIOF_TG_TG15_Msk                 (0x8000UL)                /*!< TG15 (Bitfield-Mask: 0x01)                            */
/* =========================================================  OSPD1  ========================================================= */
#define GPIOF_OSPD1_SPD0_Pos              (0UL)                     /*!< SPD0 (Bit 0)                                          */
#define GPIOF_OSPD1_SPD0_Msk              (0x1UL)                   /*!< SPD0 (Bitfield-Mask: 0x01)                            */
#define GPIOF_OSPD1_SPD1_Pos              (1UL)                     /*!< SPD1 (Bit 1)                                          */
#define GPIOF_OSPD1_SPD1_Msk              (0x2UL)                   /*!< SPD1 (Bitfield-Mask: 0x01)                            */
#define GPIOF_OSPD1_SPD2_Pos              (2UL)                     /*!< SPD2 (Bit 2)                                          */
#define GPIOF_OSPD1_SPD2_Msk              (0x4UL)                   /*!< SPD2 (Bitfield-Mask: 0x01)                            */
#define GPIOF_OSPD1_SPD3_Pos              (3UL)                     /*!< SPD3 (Bit 3)                                          */
#define GPIOF_OSPD1_SPD3_Msk              (0x8UL)                   /*!< SPD3 (Bitfield-Mask: 0x01)                            */
#define GPIOF_OSPD1_SPD4_Pos              (4UL)                     /*!< SPD4 (Bit 4)                                          */
#define GPIOF_OSPD1_SPD4_Msk              (0x10UL)                  /*!< SPD4 (Bitfield-Mask: 0x01)                            */
