RIOT-OS/RIOT/cpu/gd32f3x0/include/gd32f3x0_periph.h
#define GPIOF_OSPD1_SPD5_Pos              (5UL)                     /*!< SPD5 (Bit 5)                                          */
#define GPIOF_OSPD1_SPD5_Msk              (0x20UL)                  /*!< SPD5 (Bitfield-Mask: 0x01)                            */
#define GPIOF_OSPD1_SPD6_Pos              (6UL)                     /*!< SPD6 (Bit 6)                                          */
#define GPIOF_OSPD1_SPD6_Msk              (0x40UL)                  /*!< SPD6 (Bitfield-Mask: 0x01)                            */
#define GPIOF_OSPD1_SPD7_Pos              (7UL)                     /*!< SPD7 (Bit 7)                                          */
#define GPIOF_OSPD1_SPD7_Msk              (0x80UL)                  /*!< SPD7 (Bitfield-Mask: 0x01)                            */
#define GPIOF_OSPD1_SPD8_Pos              (8UL)                     /*!< SPD8 (Bit 8)                                          */
#define GPIOF_OSPD1_SPD8_Msk              (0x100UL)                 /*!< SPD8 (Bitfield-Mask: 0x01)                            */
#define GPIOF_OSPD1_SPD9_Pos              (9UL)                     /*!< SPD9 (Bit 9)                                          */
#define GPIOF_OSPD1_SPD9_Msk              (0x200UL)                 /*!< SPD9 (Bitfield-Mask: 0x01)                            */
#define GPIOF_OSPD1_SPD10_Pos             (10UL)                    /*!< SPD10 (Bit 10)                                        */
#define GPIOF_OSPD1_SPD10_Msk             (0x400UL)                 /*!< SPD10 (Bitfield-Mask: 0x01)                           */
#define GPIOF_OSPD1_SPD11_Pos             (11UL)                    /*!< SPD11 (Bit 11)                                        */
#define GPIOF_OSPD1_SPD11_Msk             (0x800UL)                 /*!< SPD11 (Bitfield-Mask: 0x01)                           */
#define GPIOF_OSPD1_SPD12_Pos             (12UL)                    /*!< SPD12 (Bit 12)                                        */
#define GPIOF_OSPD1_SPD12_Msk             (0x1000UL)                /*!< SPD12 (Bitfield-Mask: 0x01)                           */
#define GPIOF_OSPD1_SPD13_Pos             (13UL)                    /*!< SPD13 (Bit 13)                                        */
#define GPIOF_OSPD1_SPD13_Msk             (0x2000UL)                /*!< SPD13 (Bitfield-Mask: 0x01)                           */
#define GPIOF_OSPD1_SPD14_Pos             (14UL)                    /*!< SPD14 (Bit 14)                                        */
#define GPIOF_OSPD1_SPD14_Msk             (0x4000UL)                /*!< SPD14 (Bitfield-Mask: 0x01)                           */
#define GPIOF_OSPD1_SPD15_Pos             (15UL)                    /*!< SPD15 (Bit 15)                                        */
#define GPIOF_OSPD1_SPD15_Msk             (0x8000UL)                /*!< SPD15 (Bitfield-Mask: 0x01)                           */


/* =========================================================================================================================== */
/* ================                                           I2C0                                            ================ */
/* =========================================================================================================================== */

/* =========================================================  CTL0  ========================================================== */
#define I2C0_CTL0_SRESET_Pos              (15UL)                    /*!< SRESET (Bit 15)                                       */
#define I2C0_CTL0_SRESET_Msk              (0x8000UL)                /*!< SRESET (Bitfield-Mask: 0x01)                          */
#define I2C0_CTL0_SALT_Pos                (13UL)                    /*!< SALT (Bit 13)                                         */
#define I2C0_CTL0_SALT_Msk                (0x2000UL)                /*!< SALT (Bitfield-Mask: 0x01)                            */
#define I2C0_CTL0_PECTRANS_Pos            (12UL)                    /*!< PECTRANS (Bit 12)                                     */
#define I2C0_CTL0_PECTRANS_Msk            (0x1000UL)                /*!< PECTRANS (Bitfield-Mask: 0x01)                        */
#define I2C0_CTL0_POAP_Pos                (11UL)                    /*!< POAP (Bit 11)                                         */
#define I2C0_CTL0_POAP_Msk                (0x800UL)                 /*!< POAP (Bitfield-Mask: 0x01)                            */
#define I2C0_CTL0_ACKEN_Pos               (10UL)                    /*!< ACKEN (Bit 10)                                        */
#define I2C0_CTL0_ACKEN_Msk               (0x400UL)                 /*!< ACKEN (Bitfield-Mask: 0x01)                           */
#define I2C0_CTL0_STOP_Pos                (9UL)                     /*!< STOP (Bit 9)                                          */
#define I2C0_CTL0_STOP_Msk                (0x200UL)                 /*!< STOP (Bitfield-Mask: 0x01)                            */
#define I2C0_CTL0_START_Pos               (8UL)                     /*!< START (Bit 8)                                         */
#define I2C0_CTL0_START_Msk               (0x100UL)                 /*!< START (Bitfield-Mask: 0x01)                           */
#define I2C0_CTL0_SS_Pos                  (7UL)                     /*!< SS (Bit 7)                                            */
#define I2C0_CTL0_SS_Msk                  (0x80UL)                  /*!< SS (Bitfield-Mask: 0x01)                              */
#define I2C0_CTL0_GCEN_Pos                (6UL)                     /*!< GCEN (Bit 6)                                          */
#define I2C0_CTL0_GCEN_Msk                (0x40UL)                  /*!< GCEN (Bitfield-Mask: 0x01)                            */
#define I2C0_CTL0_PECEN_Pos               (5UL)                     /*!< PECEN (Bit 5)                                         */
#define I2C0_CTL0_PECEN_Msk               (0x20UL)                  /*!< PECEN (Bitfield-Mask: 0x01)                           */
#define I2C0_CTL0_ARPEN_Pos               (4UL)                     /*!< ARPEN (Bit 4)                                         */
#define I2C0_CTL0_ARPEN_Msk               (0x10UL)                  /*!< ARPEN (Bitfield-Mask: 0x01)                           */
#define I2C0_CTL0_SMBSEL_Pos              (3UL)                     /*!< SMBSEL (Bit 3)                                        */
#define I2C0_CTL0_SMBSEL_Msk              (0x8UL)                   /*!< SMBSEL (Bitfield-Mask: 0x01)                          */
#define I2C0_CTL0_SMBEN_Pos               (1UL)                     /*!< SMBEN (Bit 1)                                         */
#define I2C0_CTL0_SMBEN_Msk               (0x2UL)                   /*!< SMBEN (Bitfield-Mask: 0x01)                           */
#define I2C0_CTL0_I2CEN_Pos               (0UL)                     /*!< I2CEN (Bit 0)                                         */
#define I2C0_CTL0_I2CEN_Msk               (0x1UL)                   /*!< I2CEN (Bitfield-Mask: 0x01)                           */
/* =========================================================  CTL1  ========================================================== */
#define I2C0_CTL1_DMALST_Pos              (12UL)                    /*!< DMALST (Bit 12)                                       */
#define I2C0_CTL1_DMALST_Msk              (0x1000UL)                /*!< DMALST (Bitfield-Mask: 0x01)                          */
#define I2C0_CTL1_DMAON_Pos               (11UL)                    /*!< DMAON (Bit 11)                                        */
#define I2C0_CTL1_DMAON_Msk               (0x800UL)                 /*!< DMAON (Bitfield-Mask: 0x01)                           */
#define I2C0_CTL1_BUFIE_Pos               (10UL)                    /*!< BUFIE (Bit 10)                                        */
#define I2C0_CTL1_BUFIE_Msk               (0x400UL)                 /*!< BUFIE (Bitfield-Mask: 0x01)                           */
#define I2C0_CTL1_EVIE_Pos                (9UL)                     /*!< EVIE (Bit 9)                                          */
#define I2C0_CTL1_EVIE_Msk                (0x200UL)                 /*!< EVIE (Bitfield-Mask: 0x01)                            */
#define I2C0_CTL1_ERRIE_Pos               (8UL)                     /*!< ERRIE (Bit 8)                                         */
#define I2C0_CTL1_ERRIE_Msk               (0x100UL)                 /*!< ERRIE (Bitfield-Mask: 0x01)                           */
#define I2C0_CTL1_I2CCLK_Pos              (0UL)                     /*!< I2CCLK (Bit 0)                                        */
#define I2C0_CTL1_I2CCLK_Msk              (0x3fUL)                  /*!< I2CCLK (Bitfield-Mask: 0x3f)                          */
/* ========================================================  SADDR0  ========================================================= */
#define I2C0_SADDR0_ADDFORMAT_Pos         (15UL)                    /*!< ADDFORMAT (Bit 15)                                    */
#define I2C0_SADDR0_ADDFORMAT_Msk         (0x8000UL)                /*!< ADDFORMAT (Bitfield-Mask: 0x01)                       */
#define I2C0_SADDR0_ADDRESS_Pos           (0UL)                     /*!< ADDRESS (Bit 0)                                       */
#define I2C0_SADDR0_ADDRESS_Msk           (0x3ffUL)                 /*!< ADDRESS (Bitfield-Mask: 0x3ff)                        */
/* ========================================================  SADDR1  ========================================================= */
#define I2C0_SADDR1_ADDRESS2_Pos          (1UL)                     /*!< ADDRESS2 (Bit 1)                                      */
#define I2C0_SADDR1_ADDRESS2_Msk          (0xfeUL)                  /*!< ADDRESS2 (Bitfield-Mask: 0x7f)                        */
#define I2C0_SADDR1_DUADEN_Pos            (0UL)                     /*!< DUADEN (Bit 0)                                        */
#define I2C0_SADDR1_DUADEN_Msk            (0x1UL)                   /*!< DUADEN (Bitfield-Mask: 0x01)                          */
/* =========================================================  DATA  ========================================================== */
#define I2C0_DATA_TRB_Pos                 (0UL)                     /*!< TRB (Bit 0)                                           */
#define I2C0_DATA_TRB_Msk                 (0xffUL)                  /*!< TRB (Bitfield-Mask: 0xff)                             */
/* =========================================================  STAT0  ========================================================= */
#define I2C0_STAT0_SMBALT_Pos             (15UL)                    /*!< SMBALT (Bit 15)                                       */
#define I2C0_STAT0_SMBALT_Msk             (0x8000UL)                /*!< SMBALT (Bitfield-Mask: 0x01)                          */
#define I2C0_STAT0_SMBTO_Pos              (14UL)                    /*!< SMBTO (Bit 14)                                        */
#define I2C0_STAT0_SMBTO_Msk              (0x4000UL)                /*!< SMBTO (Bitfield-Mask: 0x01)                           */
#define I2C0_STAT0_PECERR_Pos             (12UL)                    /*!< PECERR (Bit 12)                                       */
#define I2C0_STAT0_PECERR_Msk             (0x1000UL)                /*!< PECERR (Bitfield-Mask: 0x01)                          */
#define I2C0_STAT0_OUERR_Pos              (11UL)                    /*!< OUERR (Bit 11)                                        */
#define I2C0_STAT0_OUERR_Msk              (0x800UL)                 /*!< OUERR (Bitfield-Mask: 0x01)                           */
#define I2C0_STAT0_AERR_Pos               (10UL)                    /*!< AERR (Bit 10)                                         */
#define I2C0_STAT0_AERR_Msk               (0x400UL)                 /*!< AERR (Bitfield-Mask: 0x01)                            */
#define I2C0_STAT0_LOSTARB_Pos            (9UL)                     /*!< LOSTARB (Bit 9)                                       */
#define I2C0_STAT0_LOSTARB_Msk            (0x200UL)                 /*!< LOSTARB (Bitfield-Mask: 0x01)                         */
#define I2C0_STAT0_BERR_Pos               (8UL)                     /*!< BERR (Bit 8)                                          */
#define I2C0_STAT0_BERR_Msk               (0x100UL)                 /*!< BERR (Bitfield-Mask: 0x01)                            */
#define I2C0_STAT0_TBE_Pos                (7UL)                     /*!< TBE (Bit 7)                                           */
#define I2C0_STAT0_TBE_Msk                (0x80UL)                  /*!< TBE (Bitfield-Mask: 0x01)                             */
#define I2C0_STAT0_RBNE_Pos               (6UL)                     /*!< RBNE (Bit 6)                                          */
#define I2C0_STAT0_RBNE_Msk               (0x40UL)                  /*!< RBNE (Bitfield-Mask: 0x01)                            */
#define I2C0_STAT0_STPDET_Pos             (4UL)                     /*!< STPDET (Bit 4)                                        */
#define I2C0_STAT0_STPDET_Msk             (0x10UL)                  /*!< STPDET (Bitfield-Mask: 0x01)                          */
#define I2C0_STAT0_ADD10SEND_Pos          (3UL)                     /*!< ADD10SEND (Bit 3)                                     */
#define I2C0_STAT0_ADD10SEND_Msk          (0x8UL)                   /*!< ADD10SEND (Bitfield-Mask: 0x01)                       */
#define I2C0_STAT0_BTC_Pos                (2UL)                     /*!< BTC (Bit 2)                                           */
#define I2C0_STAT0_BTC_Msk                (0x4UL)                   /*!< BTC (Bitfield-Mask: 0x01)                             */
#define I2C0_STAT0_ADDSEND_Pos            (1UL)                     /*!< ADDSEND (Bit 1)                                       */
#define I2C0_STAT0_ADDSEND_Msk            (0x2UL)                   /*!< ADDSEND (Bitfield-Mask: 0x01)                         */
#define I2C0_STAT0_SBSEND_Pos             (0UL)                     /*!< SBSEND (Bit 0)                                        */
#define I2C0_STAT0_SBSEND_Msk             (0x1UL)                   /*!< SBSEND (Bitfield-Mask: 0x01)                          */
/* =========================================================  STAT1  ========================================================= */
#define I2C0_STAT1_PECV_Pos               (8UL)                     /*!< PECV (Bit 8)                                          */
#define I2C0_STAT1_PECV_Msk               (0xff00UL)                /*!< PECV (Bitfield-Mask: 0xff)                            */
#define I2C0_STAT1_DUMODF_Pos             (7UL)                     /*!< DUMODF (Bit 7)                                        */
#define I2C0_STAT1_DUMODF_Msk             (0x80UL)                  /*!< DUMODF (Bitfield-Mask: 0x01)                          */
#define I2C0_STAT1_HSTSMB_Pos             (6UL)                     /*!< HSTSMB (Bit 6)                                        */
#define I2C0_STAT1_HSTSMB_Msk             (0x40UL)                  /*!< HSTSMB (Bitfield-Mask: 0x01)                          */
#define I2C0_STAT1_DEFSMB_Pos             (5UL)                     /*!< DEFSMB (Bit 5)                                        */
#define I2C0_STAT1_DEFSMB_Msk             (0x20UL)                  /*!< DEFSMB (Bitfield-Mask: 0x01)                          */
#define I2C0_STAT1_RXGC_Pos               (4UL)                     /*!< RXGC (Bit 4)                                          */
#define I2C0_STAT1_RXGC_Msk               (0x10UL)                  /*!< RXGC (Bitfield-Mask: 0x01)                            */
#define I2C0_STAT1_TR_Pos                 (2UL)                     /*!< TR (Bit 2)                                            */
#define I2C0_STAT1_TR_Msk                 (0x4UL)                   /*!< TR (Bitfield-Mask: 0x01)                              */
#define I2C0_STAT1_I2CBSY_Pos             (1UL)                     /*!< I2CBSY (Bit 1)                                        */
#define I2C0_STAT1_I2CBSY_Msk             (0x2UL)                   /*!< I2CBSY (Bitfield-Mask: 0x01)                          */
#define I2C0_STAT1_MASTER_Pos             (0UL)                     /*!< MASTER (Bit 0)                                        */
#define I2C0_STAT1_MASTER_Msk             (0x1UL)                   /*!< MASTER (Bitfield-Mask: 0x01)                          */
/* =========================================================  CKCFG  ========================================================= */
#define I2C0_CKCFG_FAST_Pos               (15UL)                    /*!< FAST (Bit 15)                                         */
#define I2C0_CKCFG_FAST_Msk               (0x8000UL)                /*!< FAST (Bitfield-Mask: 0x01)                            */
#define I2C0_CKCFG_DTCY_Pos               (14UL)                    /*!< DTCY (Bit 14)                                         */
#define I2C0_CKCFG_DTCY_Msk               (0x4000UL)                /*!< DTCY (Bitfield-Mask: 0x01)                            */
#define I2C0_CKCFG_CLKC_Pos               (0UL)                     /*!< CLKC (Bit 0)                                          */
#define I2C0_CKCFG_CLKC_Msk               (0xfffUL)                 /*!< CLKC (Bitfield-Mask: 0xfff)                           */
/* ==========================================================  RT  =========================================================== */
#define I2C0_RT_RISETIME_Pos              (0UL)                     /*!< RISETIME (Bit 0)                                      */
#define I2C0_RT_RISETIME_Msk              (0x3fUL)                  /*!< RISETIME (Bitfield-Mask: 0x3f)                        */
/* ========================================================  FMPCFG  ========================================================= */
#define I2C0_FMPCFG_FMPEN_Pos             (0UL)                     /*!< FMPEN (Bit 0)                                         */
#define I2C0_FMPCFG_FMPEN_Msk             (0x1UL)                   /*!< FMPEN (Bitfield-Mask: 0x01)                           */


/* =========================================================================================================================== */
/* ================                                           NVIC                                            ================ */
/* =========================================================================================================================== */

