RIOT-OS/RIOT/cpu/gd32f3x0/include/gd32f3x0_periph.h
/* =========================================================  ISER  ========================================================== */
#define NVIC_ISER_SETENA_Pos              (0UL)                     /*!< SETENA (Bit 0)                                        */
#define NVIC_ISER_SETENA_Msk              (0xffffffffUL)            /*!< SETENA (Bitfield-Mask: 0xffffffff)                    */
/* =========================================================  ICER  ========================================================== */
#define NVIC_ICER_CLRENA_Pos              (0UL)                     /*!< CLRENA (Bit 0)                                        */
#define NVIC_ICER_CLRENA_Msk              (0xffffffffUL)            /*!< CLRENA (Bitfield-Mask: 0xffffffff)                    */
/* =========================================================  ISPR  ========================================================== */
#define NVIC_ISPR_SETPEND_Pos             (0UL)                     /*!< SETPEND (Bit 0)                                       */
#define NVIC_ISPR_SETPEND_Msk             (0xffffffffUL)            /*!< SETPEND (Bitfield-Mask: 0xffffffff)                   */
/* =========================================================  ICPR  ========================================================== */
#define NVIC_ICPR_CLRPEND_Pos             (0UL)                     /*!< CLRPEND (Bit 0)                                       */
#define NVIC_ICPR_CLRPEND_Msk             (0xffffffffUL)            /*!< CLRPEND (Bitfield-Mask: 0xffffffff)                   */
/* =========================================================  IABR  ========================================================== */
#define NVIC_IABR_IABR_Pos                (0UL)                     /*!< IABR (Bit 0)                                          */
#define NVIC_IABR_IABR_Msk                (0xffffffffUL)            /*!< IABR (Bitfield-Mask: 0xffffffff)                      */
/* =========================================================  IPR0  ========================================================== */
#define NVIC_IPR0_PRI_00_Pos              (0UL)                     /*!< PRI_00 (Bit 0)                                        */
#define NVIC_IPR0_PRI_00_Msk              (0xffUL)                  /*!< PRI_00 (Bitfield-Mask: 0xff)                          */
/* =========================================================  IPR1  ========================================================== */
#define NVIC_IPR1_PRI_01_Pos              (0UL)                     /*!< PRI_01 (Bit 0)                                        */
#define NVIC_IPR1_PRI_01_Msk              (0xffUL)                  /*!< PRI_01 (Bitfield-Mask: 0xff)                          */
/* =========================================================  IPR2  ========================================================== */
#define NVIC_IPR2_PRI_02_Pos              (0UL)                     /*!< PRI_02 (Bit 0)                                        */
#define NVIC_IPR2_PRI_02_Msk              (0xffUL)                  /*!< PRI_02 (Bitfield-Mask: 0xff)                          */
/* =========================================================  IPR3  ========================================================== */
#define NVIC_IPR3_PRI_03_Pos              (0UL)                     /*!< PRI_03 (Bit 0)                                        */
#define NVIC_IPR3_PRI_03_Msk              (0xffUL)                  /*!< PRI_03 (Bitfield-Mask: 0xff)                          */
/* =========================================================  IPR4  ========================================================== */
#define NVIC_IPR4_PRI_04_Pos              (0UL)                     /*!< PRI_04 (Bit 0)                                        */
#define NVIC_IPR4_PRI_04_Msk              (0xffUL)                  /*!< PRI_04 (Bitfield-Mask: 0xff)                          */
/* =========================================================  IPR5  ========================================================== */
#define NVIC_IPR5_PRI_05_Pos              (0UL)                     /*!< PRI_05 (Bit 0)                                        */
#define NVIC_IPR5_PRI_05_Msk              (0xffUL)                  /*!< PRI_05 (Bitfield-Mask: 0xff)                          */
/* =========================================================  IPR6  ========================================================== */
#define NVIC_IPR6_PRI_06_Pos              (0UL)                     /*!< PRI_06 (Bit 0)                                        */
#define NVIC_IPR6_PRI_06_Msk              (0xffUL)                  /*!< PRI_06 (Bitfield-Mask: 0xff)                          */
/* =========================================================  IPR7  ========================================================== */
#define NVIC_IPR7_PRI_07_Pos              (0UL)                     /*!< PRI_07 (Bit 0)                                        */
#define NVIC_IPR7_PRI_07_Msk              (0xffUL)                  /*!< PRI_07 (Bitfield-Mask: 0xff)                          */
/* =========================================================  IPR8  ========================================================== */
#define NVIC_IPR8_PRI_08_Pos              (0UL)                     /*!< PRI_08 (Bit 0)                                        */
#define NVIC_IPR8_PRI_08_Msk              (0xffUL)                  /*!< PRI_08 (Bitfield-Mask: 0xff)                          */
/* =========================================================  IPR9  ========================================================== */
#define NVIC_IPR9_PRI_09_Pos              (0UL)                     /*!< PRI_09 (Bit 0)                                        */
#define NVIC_IPR9_PRI_09_Msk              (0xffUL)                  /*!< PRI_09 (Bitfield-Mask: 0xff)                          */
/* =========================================================  IPR10  ========================================================= */
#define NVIC_IPR10_PRI_10_Pos             (0UL)                     /*!< PRI_10 (Bit 0)                                        */
#define NVIC_IPR10_PRI_10_Msk             (0xffUL)                  /*!< PRI_10 (Bitfield-Mask: 0xff)                          */
/* =========================================================  IPR11  ========================================================= */
#define NVIC_IPR11_PRI_11_Pos             (0UL)                     /*!< PRI_11 (Bit 0)                                        */
#define NVIC_IPR11_PRI_11_Msk             (0xffUL)                  /*!< PRI_11 (Bitfield-Mask: 0xff)                          */
/* =========================================================  IPR12  ========================================================= */
#define NVIC_IPR12_PRI_12_Pos             (0UL)                     /*!< PRI_12 (Bit 0)                                        */
#define NVIC_IPR12_PRI_12_Msk             (0xffUL)                  /*!< PRI_12 (Bitfield-Mask: 0xff)                          */
/* =========================================================  IPR13  ========================================================= */
#define NVIC_IPR13_PRI_13_Pos             (0UL)                     /*!< PRI_13 (Bit 0)                                        */
#define NVIC_IPR13_PRI_13_Msk             (0xffUL)                  /*!< PRI_13 (Bitfield-Mask: 0xff)                          */
/* =========================================================  IPR14  ========================================================= */
#define NVIC_IPR14_PRI_14_Pos             (0UL)                     /*!< PRI_14 (Bit 0)                                        */
#define NVIC_IPR14_PRI_14_Msk             (0xffUL)                  /*!< PRI_14 (Bitfield-Mask: 0xff)                          */
/* =========================================================  IPR15  ========================================================= */
#define NVIC_IPR15_PRI_15_Pos             (0UL)                     /*!< PRI_15 (Bit 0)                                        */
#define NVIC_IPR15_PRI_15_Msk             (0xffUL)                  /*!< PRI_15 (Bitfield-Mask: 0xff)                          */
/* =========================================================  IPR16  ========================================================= */
#define NVIC_IPR16_PRI_16_Pos             (0UL)                     /*!< PRI_16 (Bit 0)                                        */
#define NVIC_IPR16_PRI_16_Msk             (0xffUL)                  /*!< PRI_16 (Bitfield-Mask: 0xff)                          */
/* =========================================================  IPR17  ========================================================= */
#define NVIC_IPR17_PRI_17_Pos             (0UL)                     /*!< PRI_17 (Bit 0)                                        */
#define NVIC_IPR17_PRI_17_Msk             (0xffUL)                  /*!< PRI_17 (Bitfield-Mask: 0xff)                          */
/* =========================================================  IPR18  ========================================================= */
#define NVIC_IPR18_PRI_18_Pos             (0UL)                     /*!< PRI_18 (Bit 0)                                        */
#define NVIC_IPR18_PRI_18_Msk             (0xffUL)                  /*!< PRI_18 (Bitfield-Mask: 0xff)                          */
/* =========================================================  IPR19  ========================================================= */
#define NVIC_IPR19_PRI_19_Pos             (0UL)                     /*!< PRI_19 (Bit 0)                                        */
#define NVIC_IPR19_PRI_19_Msk             (0xffUL)                  /*!< PRI_19 (Bitfield-Mask: 0xff)                          */
/* =========================================================  IPR20  ========================================================= */
#define NVIC_IPR20_PRI_20_Pos             (0UL)                     /*!< PRI_20 (Bit 0)                                        */
#define NVIC_IPR20_PRI_20_Msk             (0xffUL)                  /*!< PRI_20 (Bitfield-Mask: 0xff)                          */
/* =========================================================  IPR21  ========================================================= */
#define NVIC_IPR21_PRI_21_Pos             (0UL)                     /*!< PRI_21 (Bit 0)                                        */
#define NVIC_IPR21_PRI_21_Msk             (0xffUL)                  /*!< PRI_21 (Bitfield-Mask: 0xff)                          */
/* =========================================================  IPR22  ========================================================= */
#define NVIC_IPR22_PRI_22_Pos             (0UL)                     /*!< PRI_22 (Bit 0)                                        */
#define NVIC_IPR22_PRI_22_Msk             (0xffUL)                  /*!< PRI_22 (Bitfield-Mask: 0xff)                          */
/* =========================================================  IPR23  ========================================================= */
#define NVIC_IPR23_PRI_23_Pos             (0UL)                     /*!< PRI_23 (Bit 0)                                        */
#define NVIC_IPR23_PRI_23_Msk             (0xffUL)                  /*!< PRI_23 (Bitfield-Mask: 0xff)                          */
/* =========================================================  IPR24  ========================================================= */
#define NVIC_IPR24_PRI_24_Pos             (0UL)                     /*!< PRI_24 (Bit 0)                                        */
#define NVIC_IPR24_PRI_24_Msk             (0xffUL)                  /*!< PRI_24 (Bitfield-Mask: 0xff)                          */
/* =========================================================  IPR25  ========================================================= */
#define NVIC_IPR25_PRI_25_Pos             (0UL)                     /*!< PRI_25 (Bit 0)                                        */
#define NVIC_IPR25_PRI_25_Msk             (0xffUL)                  /*!< PRI_25 (Bitfield-Mask: 0xff)                          */
/* =========================================================  IPR26  ========================================================= */
#define NVIC_IPR26_PRI_26_Pos             (0UL)                     /*!< PRI_26 (Bit 0)                                        */
#define NVIC_IPR26_PRI_26_Msk             (0xffUL)                  /*!< PRI_26 (Bitfield-Mask: 0xff)                          */
/* =========================================================  IPR27  ========================================================= */
#define NVIC_IPR27_PRI_27_Pos             (0UL)                     /*!< PRI_27 (Bit 0)                                        */
#define NVIC_IPR27_PRI_27_Msk             (0xffUL)                  /*!< PRI_27 (Bitfield-Mask: 0xff)                          */
/* =========================================================  IPR28  ========================================================= */
#define NVIC_IPR28_PRI_28_Pos             (0UL)                     /*!< PRI_28 (Bit 0)                                        */
#define NVIC_IPR28_PRI_28_Msk             (0xffUL)                  /*!< PRI_28 (Bitfield-Mask: 0xff)                          */
/* =========================================================  IPR29  ========================================================= */
#define NVIC_IPR29_PRI_29_Pos             (0UL)                     /*!< PRI_29 (Bit 0)                                        */
#define NVIC_IPR29_PRI_29_Msk             (0xffUL)                  /*!< PRI_29 (Bitfield-Mask: 0xff)                          */
/* =========================================================  IPR30  ========================================================= */
#define NVIC_IPR30_PRI_30_Pos             (0UL)                     /*!< PRI_30 (Bit 0)                                        */
#define NVIC_IPR30_PRI_30_Msk             (0xffUL)                  /*!< PRI_30 (Bitfield-Mask: 0xff)                          */
/* =========================================================  IPR31  ========================================================= */
#define NVIC_IPR31_PRI_31_Pos             (0UL)                     /*!< PRI_31 (Bit 0)                                        */
#define NVIC_IPR31_PRI_31_Msk             (0xffUL)                  /*!< PRI_31 (Bitfield-Mask: 0xff)                          */
/* =========================================================  IPR32  ========================================================= */
#define NVIC_IPR32_PRI_32_Pos             (0UL)                     /*!< PRI_32 (Bit 0)                                        */
#define NVIC_IPR32_PRI_32_Msk             (0xffUL)                  /*!< PRI_32 (Bitfield-Mask: 0xff)                          */
/* =========================================================  IPR33  ========================================================= */
#define NVIC_IPR33_PRI_33_Pos             (0UL)                     /*!< PRI_33 (Bit 0)                                        */
#define NVIC_IPR33_PRI_33_Msk             (0xffUL)                  /*!< PRI_33 (Bitfield-Mask: 0xff)                          */
/* =========================================================  IPR34  ========================================================= */
#define NVIC_IPR34_PRI_34_Pos             (0UL)                     /*!< PRI_34 (Bit 0)                                        */
#define NVIC_IPR34_PRI_34_Msk             (0xffUL)                  /*!< PRI_34 (Bitfield-Mask: 0xff)                          */
/* =========================================================  IPR35  ========================================================= */
#define NVIC_IPR35_PRI_35_Pos             (0UL)                     /*!< PRI_35 (Bit 0)                                        */
#define NVIC_IPR35_PRI_35_Msk             (0xffUL)                  /*!< PRI_35 (Bitfield-Mask: 0xff)                          */
/* =========================================================  IPR36  ========================================================= */
#define NVIC_IPR36_PRI_36_Pos             (0UL)                     /*!< PRI_36 (Bit 0)                                        */
#define NVIC_IPR36_PRI_36_Msk             (0xffUL)                  /*!< PRI_36 (Bitfield-Mask: 0xff)                          */
/* =========================================================  IPR37  ========================================================= */
#define NVIC_IPR37_PRI_37_Pos             (0UL)                     /*!< PRI_37 (Bit 0)                                        */
#define NVIC_IPR37_PRI_37_Msk             (0xffUL)                  /*!< PRI_37 (Bitfield-Mask: 0xff)                          */
/* =========================================================  IPR38  ========================================================= */
#define NVIC_IPR38_PRI_38_Pos             (0UL)                     /*!< PRI_38 (Bit 0)                                        */
#define NVIC_IPR38_PRI_38_Msk             (0xffUL)                  /*!< PRI_38 (Bitfield-Mask: 0xff)                          */
/* =========================================================  IPR39  ========================================================= */
#define NVIC_IPR39_PRI_39_Pos             (0UL)                     /*!< PRI_39 (Bit 0)                                        */
#define NVIC_IPR39_PRI_39_Msk             (0xffUL)                  /*!< PRI_39 (Bitfield-Mask: 0xff)                          */
/* =========================================================  IPR40  ========================================================= */
#define NVIC_IPR40_PRI_40_Pos             (0UL)                     /*!< PRI_40 (Bit 0)                                        */
#define NVIC_IPR40_PRI_40_Msk             (0xffUL)                  /*!< PRI_40 (Bitfield-Mask: 0xff)                          */
/* =========================================================  IPR41  ========================================================= */
#define NVIC_IPR41_PRI_41_Pos             (0UL)                     /*!< PRI_41 (Bit 0)                                        */
#define NVIC_IPR41_PRI_41_Msk             (0xffUL)                  /*!< PRI_41 (Bitfield-Mask: 0xff)                          */
/* =========================================================  IPR42  ========================================================= */
#define NVIC_IPR42_PRI_42_Pos             (0UL)                     /*!< PRI_42 (Bit 0)                                        */
#define NVIC_IPR42_PRI_42_Msk             (0xffUL)                  /*!< PRI_42 (Bitfield-Mask: 0xff)                          */
/* =========================================================  IPR43  ========================================================= */
#define NVIC_IPR43_PRI_43_Pos             (0UL)                     /*!< PRI_43 (Bit 0)                                        */
#define NVIC_IPR43_PRI_43_Msk             (0xffUL)                  /*!< PRI_43 (Bitfield-Mask: 0xff)                          */
/* =========================================================  IPR44  ========================================================= */
#define NVIC_IPR44_PRI_44_Pos             (0UL)                     /*!< PRI_44 (Bit 0)                                        */
#define NVIC_IPR44_PRI_44_Msk             (0xffUL)                  /*!< PRI_44 (Bitfield-Mask: 0xff)                          */
/* =========================================================  IPR45  ========================================================= */
#define NVIC_IPR45_PRI_45_Pos             (0UL)                     /*!< PRI_45 (Bit 0)                                        */
#define NVIC_IPR45_PRI_45_Msk             (0xffUL)                  /*!< PRI_45 (Bitfield-Mask: 0xff)                          */
/* =========================================================  IPR46  ========================================================= */
#define NVIC_IPR46_PRI_46_Pos             (0UL)                     /*!< PRI_46 (Bit 0)                                        */
#define NVIC_IPR46_PRI_46_Msk             (0xffUL)                  /*!< PRI_46 (Bitfield-Mask: 0xff)                          */
/* =========================================================  IPR47  ========================================================= */
#define NVIC_IPR47_PRI_47_Pos             (0UL)                     /*!< PRI_47 (Bit 0)                                        */
#define NVIC_IPR47_PRI_47_Msk             (0xffUL)                  /*!< PRI_47 (Bitfield-Mask: 0xff)                          */
/* =========================================================  IPR48  ========================================================= */
#define NVIC_IPR48_PRI_48_Pos             (0UL)                     /*!< PRI_48 (Bit 0)                                        */
#define NVIC_IPR48_PRI_48_Msk             (0xffUL)                  /*!< PRI_48 (Bitfield-Mask: 0xff)                          */
/* =========================================================  IPR49  ========================================================= */
#define NVIC_IPR49_PRI_49_Pos             (0UL)                     /*!< PRI_49 (Bit 0)                                        */
#define NVIC_IPR49_PRI_49_Msk             (0xffUL)                  /*!< PRI_49 (Bitfield-Mask: 0xff)                          */
/* =========================================================  IPR50  ========================================================= */
#define NVIC_IPR50_PRI_50_Pos             (0UL)                     /*!< PRI_50 (Bit 0)                                        */
#define NVIC_IPR50_PRI_50_Msk             (0xffUL)                  /*!< PRI_50 (Bitfield-Mask: 0xff)                          */
/* =========================================================  IPR51  ========================================================= */
#define NVIC_IPR51_PRI_51_Pos             (0UL)                     /*!< PRI_51 (Bit 0)                                        */
#define NVIC_IPR51_PRI_51_Msk             (0xffUL)                  /*!< PRI_51 (Bitfield-Mask: 0xff)                          */
/* =========================================================  IPR52  ========================================================= */
#define NVIC_IPR52_PRI_52_Pos             (0UL)                     /*!< PRI_52 (Bit 0)                                        */
#define NVIC_IPR52_PRI_52_Msk             (0xffUL)                  /*!< PRI_52 (Bitfield-Mask: 0xff)                          */
/* =========================================================  IPR53  ========================================================= */
#define NVIC_IPR53_PRI_53_Pos             (0UL)                     /*!< PRI_53 (Bit 0)                                        */
#define NVIC_IPR53_PRI_53_Msk             (0xffUL)                  /*!< PRI_53 (Bitfield-Mask: 0xff)                          */
/* =========================================================  IPR54  ========================================================= */
#define NVIC_IPR54_PRI_54_Pos             (0UL)                     /*!< PRI_54 (Bit 0)                                        */
#define NVIC_IPR54_PRI_54_Msk             (0xffUL)                  /*!< PRI_54 (Bitfield-Mask: 0xff)                          */
/* =========================================================  IPR55  ========================================================= */
#define NVIC_IPR55_PRI_55_Pos             (0UL)                     /*!< PRI_55 (Bit 0)                                        */
#define NVIC_IPR55_PRI_55_Msk             (0xffUL)                  /*!< PRI_55 (Bitfield-Mask: 0xff)                          */
/* =========================================================  IPR56  ========================================================= */
