RIOT-OS/RIOT/cpu/gd32f3x0/include/gd32f3x0_periph.h
#define NVIC_IPR56_PRI_56_Pos             (0UL)                     /*!< PRI_56 (Bit 0)                                        */
#define NVIC_IPR56_PRI_56_Msk             (0xffUL)                  /*!< PRI_56 (Bitfield-Mask: 0xff)                          */
/* =========================================================  IPR57  ========================================================= */
#define NVIC_IPR57_PRI_57_Pos             (0UL)                     /*!< PRI_57 (Bit 0)                                        */
#define NVIC_IPR57_PRI_57_Msk             (0xffUL)                  /*!< PRI_57 (Bitfield-Mask: 0xff)                          */
/* =========================================================  IPR58  ========================================================= */
#define NVIC_IPR58_PRI_58_Pos             (0UL)                     /*!< PRI_58 (Bit 0)                                        */
#define NVIC_IPR58_PRI_58_Msk             (0xffUL)                  /*!< PRI_58 (Bitfield-Mask: 0xff)                          */
/* =========================================================  IPR59  ========================================================= */
#define NVIC_IPR59_PRI_59_Pos             (0UL)                     /*!< PRI_59 (Bit 0)                                        */
#define NVIC_IPR59_PRI_59_Msk             (0xffUL)                  /*!< PRI_59 (Bitfield-Mask: 0xff)                          */
/* =========================================================  IPR60  ========================================================= */
#define NVIC_IPR60_PRI_60_Pos             (0UL)                     /*!< PRI_60 (Bit 0)                                        */
#define NVIC_IPR60_PRI_60_Msk             (0xffUL)                  /*!< PRI_60 (Bitfield-Mask: 0xff)                          */
/* =========================================================  IPR61  ========================================================= */
#define NVIC_IPR61_PRI_61_Pos             (0UL)                     /*!< PRI_61 (Bit 0)                                        */
#define NVIC_IPR61_PRI_61_Msk             (0xffUL)                  /*!< PRI_61 (Bitfield-Mask: 0xff)                          */
/* =========================================================  IPR62  ========================================================= */
#define NVIC_IPR62_PRI_62_Pos             (0UL)                     /*!< PRI_62 (Bit 0)                                        */
#define NVIC_IPR62_PRI_62_Msk             (0xffUL)                  /*!< PRI_62 (Bitfield-Mask: 0xff)                          */
/* =========================================================  IPR63  ========================================================= */
#define NVIC_IPR63_PRI_63_Pos             (0UL)                     /*!< PRI_63 (Bit 0)                                        */
#define NVIC_IPR63_PRI_63_Msk             (0xffUL)                  /*!< PRI_63 (Bitfield-Mask: 0xff)                          */
/* =========================================================  IPR64  ========================================================= */
#define NVIC_IPR64_PRI_64_Pos             (0UL)                     /*!< PRI_64 (Bit 0)                                        */
#define NVIC_IPR64_PRI_64_Msk             (0xffUL)                  /*!< PRI_64 (Bitfield-Mask: 0xff)                          */
/* =========================================================  IPR65  ========================================================= */
#define NVIC_IPR65_PRI_65_Pos             (0UL)                     /*!< PRI_65 (Bit 0)                                        */
#define NVIC_IPR65_PRI_65_Msk             (0xffUL)                  /*!< PRI_65 (Bitfield-Mask: 0xff)                          */
/* =========================================================  IPR66  ========================================================= */
#define NVIC_IPR66_PRI_66_Pos             (0UL)                     /*!< PRI_66 (Bit 0)                                        */
#define NVIC_IPR66_PRI_66_Msk             (0xffUL)                  /*!< PRI_66 (Bitfield-Mask: 0xff)                          */
/* =========================================================  IPR67  ========================================================= */
#define NVIC_IPR67_PRI_67_Pos             (0UL)                     /*!< PRI_67 (Bit 0)                                        */
#define NVIC_IPR67_PRI_67_Msk             (0xffUL)                  /*!< PRI_67 (Bitfield-Mask: 0xff)                          */
/* =========================================================  IPR68  ========================================================= */
#define NVIC_IPR68_PRI_68_Pos             (0UL)                     /*!< PRI_68 (Bit 0)                                        */
#define NVIC_IPR68_PRI_68_Msk             (0xffUL)                  /*!< PRI_68 (Bitfield-Mask: 0xff)                          */
/* =========================================================  IPR69  ========================================================= */
#define NVIC_IPR69_PRI_69_Pos             (0UL)                     /*!< PRI_69 (Bit 0)                                        */
#define NVIC_IPR69_PRI_69_Msk             (0xffUL)                  /*!< PRI_69 (Bitfield-Mask: 0xff)                          */
/* =========================================================  IPR70  ========================================================= */
#define NVIC_IPR70_PRI_70_Pos             (0UL)                     /*!< PRI_70 (Bit 0)                                        */
#define NVIC_IPR70_PRI_70_Msk             (0xffUL)                  /*!< PRI_70 (Bitfield-Mask: 0xff)                          */
/* =========================================================  IPR71  ========================================================= */
#define NVIC_IPR71_PRI_71_Pos             (0UL)                     /*!< PRI_71 (Bit 0)                                        */
#define NVIC_IPR71_PRI_71_Msk             (0xffUL)                  /*!< PRI_71 (Bitfield-Mask: 0xff)                          */
/* =========================================================  IPR72  ========================================================= */
#define NVIC_IPR72_PRI_72_Pos             (0UL)                     /*!< PRI_72 (Bit 0)                                        */
#define NVIC_IPR72_PRI_72_Msk             (0xffUL)                  /*!< PRI_72 (Bitfield-Mask: 0xff)                          */
/* =========================================================  IPR73  ========================================================= */
#define NVIC_IPR73_PRI_73_Pos             (0UL)                     /*!< PRI_73 (Bit 0)                                        */
#define NVIC_IPR73_PRI_73_Msk             (0xffUL)                  /*!< PRI_73 (Bitfield-Mask: 0xff)                          */
/* =========================================================  STIR  ========================================================== */
#define NVIC_STIR_STIR_Pos                (0UL)                     /*!< STIR (Bit 0)                                          */
#define NVIC_STIR_STIR_Msk                (0xffffffffUL)            /*!< STIR (Bitfield-Mask: 0xffffffff)                      */


/* =========================================================================================================================== */
/* ================                                            PMU                                            ================ */
/* =========================================================================================================================== */

/* ==========================================================  CTL  ========================================================== */
#define PMU_CTL_LDEN_Pos                  (18UL)                    /*!< LDEN (Bit 18)                                         */
#define PMU_CTL_LDEN_Msk                  (0xc0000UL)               /*!< LDEN (Bitfield-Mask: 0x03)                            */
#define PMU_CTL_HDS_Pos                   (17UL)                    /*!< HDS (Bit 17)                                          */
#define PMU_CTL_HDS_Msk                   (0x20000UL)               /*!< HDS (Bitfield-Mask: 0x01)                             */
#define PMU_CTL_HDEN_Pos                  (16UL)                    /*!< HDEN (Bit 16)                                         */
#define PMU_CTL_HDEN_Msk                  (0x10000UL)               /*!< HDEN (Bitfield-Mask: 0x01)                            */
#define PMU_CTL_LDOVS_Pos                 (14UL)                    /*!< LDOVS (Bit 14)                                        */
#define PMU_CTL_LDOVS_Msk                 (0xc000UL)                /*!< LDOVS (Bitfield-Mask: 0x03)                           */
#define PMU_CTL_LDNP_Pos                  (11UL)                    /*!< LDNP (Bit 11)                                         */
#define PMU_CTL_LDNP_Msk                  (0x800UL)                 /*!< LDNP (Bitfield-Mask: 0x01)                            */
#define PMU_CTL_LDLP_Pos                  (10UL)                    /*!< LDLP (Bit 10)                                         */
#define PMU_CTL_LDLP_Msk                  (0x400UL)                 /*!< LDLP (Bitfield-Mask: 0x01)                            */
#define PMU_CTL_BKPWEN_Pos                (8UL)                     /*!< BKPWEN (Bit 8)                                        */
#define PMU_CTL_BKPWEN_Msk                (0x100UL)                 /*!< BKPWEN (Bitfield-Mask: 0x01)                          */
#define PMU_CTL_LVDT_Pos                  (5UL)                     /*!< LVDT (Bit 5)                                          */
#define PMU_CTL_LVDT_Msk                  (0xe0UL)                  /*!< LVDT (Bitfield-Mask: 0x07)                            */
#define PMU_CTL_LVDEN_Pos                 (4UL)                     /*!< LVDEN (Bit 4)                                         */
#define PMU_CTL_LVDEN_Msk                 (0x10UL)                  /*!< LVDEN (Bitfield-Mask: 0x01)                           */
#define PMU_CTL_STBRST_Pos                (3UL)                     /*!< STBRST (Bit 3)                                        */
#define PMU_CTL_STBRST_Msk                (0x8UL)                   /*!< STBRST (Bitfield-Mask: 0x01)                          */
#define PMU_CTL_WURST_Pos                 (2UL)                     /*!< WURST (Bit 2)                                         */
#define PMU_CTL_WURST_Msk                 (0x4UL)                   /*!< WURST (Bitfield-Mask: 0x01)                           */
#define PMU_CTL_STBMOD_Pos                (1UL)                     /*!< STBMOD (Bit 1)                                        */
#define PMU_CTL_STBMOD_Msk                (0x2UL)                   /*!< STBMOD (Bitfield-Mask: 0x01)                          */
#define PMU_CTL_LDOLP_Pos                 (0UL)                     /*!< LDOLP (Bit 0)                                         */
#define PMU_CTL_LDOLP_Msk                 (0x1UL)                   /*!< LDOLP (Bitfield-Mask: 0x01)                           */
/* ==========================================================  CS  =========================================================== */
#define PMU_CS_LDRF_Pos                   (18UL)                    /*!< LDRF (Bit 18)                                         */
#define PMU_CS_LDRF_Msk                   (0xc0000UL)               /*!< LDRF (Bitfield-Mask: 0x03)                            */
#define PMU_CS_HDSRF_Pos                  (17UL)                    /*!< HDSRF (Bit 17)                                        */
#define PMU_CS_HDSRF_Msk                  (0x20000UL)               /*!< HDSRF (Bitfield-Mask: 0x01)                           */
#define PMU_CS_HDRF_Pos                   (16UL)                    /*!< HDRF (Bit 16)                                         */
#define PMU_CS_HDRF_Msk                   (0x10000UL)               /*!< HDRF (Bitfield-Mask: 0x01)                            */
#define PMU_CS_LDOVSRF_Pos                (15UL)                    /*!< LDOVSRF (Bit 15)                                      */
#define PMU_CS_LDOVSRF_Msk                (0x8000UL)                /*!< LDOVSRF (Bitfield-Mask: 0x01)                         */
#define PMU_CS_WUPEN6_Pos                 (14UL)                    /*!< WUPEN6 (Bit 14)                                       */
#define PMU_CS_WUPEN6_Msk                 (0x4000UL)                /*!< WUPEN6 (Bitfield-Mask: 0x01)                          */
#define PMU_CS_WUPEN5_Pos                 (13UL)                    /*!< WUPEN5 (Bit 13)                                       */
#define PMU_CS_WUPEN5_Msk                 (0x2000UL)                /*!< WUPEN5 (Bitfield-Mask: 0x01)                          */
#define PMU_CS_WUPEN4_Pos                 (12UL)                    /*!< WUPEN4 (Bit 12)                                       */
#define PMU_CS_WUPEN4_Msk                 (0x1000UL)                /*!< WUPEN4 (Bitfield-Mask: 0x01)                          */
#define PMU_CS_WUPEN1_Pos                 (9UL)                     /*!< WUPEN1 (Bit 9)                                        */
#define PMU_CS_WUPEN1_Msk                 (0x200UL)                 /*!< WUPEN1 (Bitfield-Mask: 0x01)                          */
#define PMU_CS_WUPEN0_Pos                 (8UL)                     /*!< WUPEN0 (Bit 8)                                        */
#define PMU_CS_WUPEN0_Msk                 (0x100UL)                 /*!< WUPEN0 (Bitfield-Mask: 0x01)                          */
#define PMU_CS_LVDF_Pos                   (2UL)                     /*!< LVDF (Bit 2)                                          */
#define PMU_CS_LVDF_Msk                   (0x4UL)                   /*!< LVDF (Bitfield-Mask: 0x01)                            */
#define PMU_CS_STBF_Pos                   (1UL)                     /*!< STBF (Bit 1)                                          */
#define PMU_CS_STBF_Msk                   (0x2UL)                   /*!< STBF (Bitfield-Mask: 0x01)                            */
#define PMU_CS_WUF_Pos                    (0UL)                     /*!< WUF (Bit 0)                                           */
#define PMU_CS_WUF_Msk                    (0x1UL)                   /*!< WUF (Bitfield-Mask: 0x01)                             */


/* =========================================================================================================================== */
/* ================                                            RCU                                            ================ */
/* =========================================================================================================================== */

