RIOT-OS/RIOT/cpu/gd32f3x0/include/gd32f3x0_periph.h
/* =========================================================  CTL0  ========================================================== */
#define RCU_CTL0_PLLSTB_Pos               (25UL)                    /*!< PLLSTB (Bit 25)                                       */
#define RCU_CTL0_PLLSTB_Msk               (0x2000000UL)             /*!< PLLSTB (Bitfield-Mask: 0x01)                          */
#define RCU_CTL0_PLLEN_Pos                (24UL)                    /*!< PLLEN (Bit 24)                                        */
#define RCU_CTL0_PLLEN_Msk                (0x1000000UL)             /*!< PLLEN (Bitfield-Mask: 0x01)                           */
#define RCU_CTL0_CKMEN_Pos                (19UL)                    /*!< CKMEN (Bit 19)                                        */
#define RCU_CTL0_CKMEN_Msk                (0x80000UL)               /*!< CKMEN (Bitfield-Mask: 0x01)                           */
#define RCU_CTL0_HXTALBPS_Pos             (18UL)                    /*!< HXTALBPS (Bit 18)                                     */
#define RCU_CTL0_HXTALBPS_Msk             (0x40000UL)               /*!< HXTALBPS (Bitfield-Mask: 0x01)                        */
#define RCU_CTL0_HXTALSTB_Pos             (17UL)                    /*!< HXTALSTB (Bit 17)                                     */
#define RCU_CTL0_HXTALSTB_Msk             (0x20000UL)               /*!< HXTALSTB (Bitfield-Mask: 0x01)                        */
#define RCU_CTL0_HXTALEN_Pos              (16UL)                    /*!< HXTALEN (Bit 16)                                      */
#define RCU_CTL0_HXTALEN_Msk              (0x10000UL)               /*!< HXTALEN (Bitfield-Mask: 0x01)                         */
#define RCU_CTL0_IRC8MCALIB_Pos           (8UL)                     /*!< IRC8MCALIB (Bit 8)                                    */
#define RCU_CTL0_IRC8MCALIB_Msk           (0xff00UL)                /*!< IRC8MCALIB (Bitfield-Mask: 0xff)                      */
#define RCU_CTL0_IRC8MADJ_Pos             (3UL)                     /*!< IRC8MADJ (Bit 3)                                      */
#define RCU_CTL0_IRC8MADJ_Msk             (0xf8UL)                  /*!< IRC8MADJ (Bitfield-Mask: 0x1f)                        */
#define RCU_CTL0_IRC8MSTB_Pos             (1UL)                     /*!< IRC8MSTB (Bit 1)                                      */
#define RCU_CTL0_IRC8MSTB_Msk             (0x2UL)                   /*!< IRC8MSTB (Bitfield-Mask: 0x01)                        */
#define RCU_CTL0_IRC8MEN_Pos              (0UL)                     /*!< IRC8MEN (Bit 0)                                       */
#define RCU_CTL0_IRC8MEN_Msk              (0x1UL)                   /*!< IRC8MEN (Bitfield-Mask: 0x01)                         */
/* =========================================================  CFG0  ========================================================== */
#define RCU_CFG0_PLLDV_Pos                (31UL)                    /*!< PLLDV (Bit 31)                                        */
#define RCU_CFG0_PLLDV_Msk                (0x80000000UL)            /*!< PLLDV (Bitfield-Mask: 0x01)                           */
#define RCU_CFG0_CKOUTDIV_Pos             (28UL)                    /*!< CKOUTDIV (Bit 28)                                     */
#define RCU_CFG0_CKOUTDIV_Msk             (0x70000000UL)            /*!< CKOUTDIV (Bitfield-Mask: 0x07)                        */
#define RCU_CFG0_PLLMF_MSB_Pos            (27UL)                    /*!< PLLMF_MSB (Bit 27)                                    */
#define RCU_CFG0_PLLMF_MSB_Msk            (0x8000000UL)             /*!< PLLMF_MSB (Bitfield-Mask: 0x01)                       */
#define RCU_CFG0_CKOUTSEL_Pos             (24UL)                    /*!< CKOUTSEL (Bit 24)                                     */
#define RCU_CFG0_CKOUTSEL_Msk             (0x7000000UL)             /*!< CKOUTSEL (Bitfield-Mask: 0x07)                        */
#define RCU_CFG0_USBFSPSC_Pos             (22UL)                    /*!< USBFSPSC (Bit 22)                                     */
#define RCU_CFG0_USBFSPSC_Msk             (0xc00000UL)              /*!< USBFSPSC (Bitfield-Mask: 0x03)                        */
#define RCU_CFG0_PLLMF_Pos                (18UL)                    /*!< PLLMF (Bit 18)                                        */
#define RCU_CFG0_PLLMF_Msk                (0x3c0000UL)              /*!< PLLMF (Bitfield-Mask: 0x0f)                           */
#define RCU_CFG0_PLLPREDV_Pos             (17UL)                    /*!< PLLPREDV (Bit 17)                                     */
#define RCU_CFG0_PLLPREDV_Msk             (0x20000UL)               /*!< PLLPREDV (Bitfield-Mask: 0x01)                        */
#define RCU_CFG0_PLLSEL_Pos               (16UL)                    /*!< PLLSEL (Bit 16)                                       */
#define RCU_CFG0_PLLSEL_Msk               (0x10000UL)               /*!< PLLSEL (Bitfield-Mask: 0x01)                          */
#define RCU_CFG0_ADCPSC_Pos               (14UL)                    /*!< ADCPSC (Bit 14)                                       */
#define RCU_CFG0_ADCPSC_Msk               (0xc000UL)                /*!< ADCPSC (Bitfield-Mask: 0x03)                          */
#define RCU_CFG0_APB2PSC_Pos              (11UL)                    /*!< APB2PSC (Bit 11)                                      */
#define RCU_CFG0_APB2PSC_Msk              (0x3800UL)                /*!< APB2PSC (Bitfield-Mask: 0x07)                         */
#define RCU_CFG0_APB1PSC_Pos              (8UL)                     /*!< APB1PSC (Bit 8)                                       */
#define RCU_CFG0_APB1PSC_Msk              (0x700UL)                 /*!< APB1PSC (Bitfield-Mask: 0x07)                         */
#define RCU_CFG0_AHBPSC_Pos               (4UL)                     /*!< AHBPSC (Bit 4)                                        */
#define RCU_CFG0_AHBPSC_Msk               (0xf0UL)                  /*!< AHBPSC (Bitfield-Mask: 0x0f)                          */
#define RCU_CFG0_SCSS_Pos                 (2UL)                     /*!< SCSS (Bit 2)                                          */
#define RCU_CFG0_SCSS_Msk                 (0xcUL)                   /*!< SCSS (Bitfield-Mask: 0x03)                            */
#define RCU_CFG0_SCS_Pos                  (0UL)                     /*!< SCS (Bit 0)                                           */
#define RCU_CFG0_SCS_Msk                  (0x3UL)                   /*!< SCS (Bitfield-Mask: 0x03)                             */
/* ==========================================================  INT  ========================================================== */
#define RCU_INT_CKMIC_Pos                 (23UL)                    /*!< CKMIC (Bit 23)                                        */
#define RCU_INT_CKMIC_Msk                 (0x800000UL)              /*!< CKMIC (Bitfield-Mask: 0x01)                           */
#define RCU_INT_IRC28MSTBIC_Pos           (21UL)                    /*!< IRC28MSTBIC (Bit 21)                                  */
#define RCU_INT_IRC28MSTBIC_Msk           (0x200000UL)              /*!< IRC28MSTBIC (Bitfield-Mask: 0x01)                     */
#define RCU_INT_PLLSTBIC_Pos              (20UL)                    /*!< PLLSTBIC (Bit 20)                                     */
#define RCU_INT_PLLSTBIC_Msk              (0x100000UL)              /*!< PLLSTBIC (Bitfield-Mask: 0x01)                        */
#define RCU_INT_HXTALSTBIC_Pos            (19UL)                    /*!< HXTALSTBIC (Bit 19)                                   */
#define RCU_INT_HXTALSTBIC_Msk            (0x80000UL)               /*!< HXTALSTBIC (Bitfield-Mask: 0x01)                      */
#define RCU_INT_IRC8MSTBIC_Pos            (18UL)                    /*!< IRC8MSTBIC (Bit 18)                                   */
#define RCU_INT_IRC8MSTBIC_Msk            (0x40000UL)               /*!< IRC8MSTBIC (Bitfield-Mask: 0x01)                      */
#define RCU_INT_LXTALSTBIC_Pos            (17UL)                    /*!< LXTALSTBIC (Bit 17)                                   */
#define RCU_INT_LXTALSTBIC_Msk            (0x20000UL)               /*!< LXTALSTBIC (Bitfield-Mask: 0x01)                      */
#define RCU_INT_IRC40KSTBIC_Pos           (16UL)                    /*!< IRC40KSTBIC (Bit 16)                                  */
#define RCU_INT_IRC40KSTBIC_Msk           (0x10000UL)               /*!< IRC40KSTBIC (Bitfield-Mask: 0x01)                     */
#define RCU_INT_IRC28MSTBIE_Pos           (13UL)                    /*!< IRC28MSTBIE (Bit 13)                                  */
#define RCU_INT_IRC28MSTBIE_Msk           (0x2000UL)                /*!< IRC28MSTBIE (Bitfield-Mask: 0x01)                     */
#define RCU_INT_PLLSTBIE_Pos              (12UL)                    /*!< PLLSTBIE (Bit 12)                                     */
#define RCU_INT_PLLSTBIE_Msk              (0x1000UL)                /*!< PLLSTBIE (Bitfield-Mask: 0x01)                        */
#define RCU_INT_HXTALSTBIE_Pos            (11UL)                    /*!< HXTALSTBIE (Bit 11)                                   */
#define RCU_INT_HXTALSTBIE_Msk            (0x800UL)                 /*!< HXTALSTBIE (Bitfield-Mask: 0x01)                      */
#define RCU_INT_IRC8MSTBIE_Pos            (10UL)                    /*!< IRC8MSTBIE (Bit 10)                                   */
#define RCU_INT_IRC8MSTBIE_Msk            (0x400UL)                 /*!< IRC8MSTBIE (Bitfield-Mask: 0x01)                      */
#define RCU_INT_LXTALSTBIE_Pos            (9UL)                     /*!< LXTALSTBIE (Bit 9)                                    */
#define RCU_INT_LXTALSTBIE_Msk            (0x200UL)                 /*!< LXTALSTBIE (Bitfield-Mask: 0x01)                      */
#define RCU_INT_IRC40KSTBIE_Pos           (8UL)                     /*!< IRC40KSTBIE (Bit 8)                                   */
#define RCU_INT_IRC40KSTBIE_Msk           (0x100UL)                 /*!< IRC40KSTBIE (Bitfield-Mask: 0x01)                     */
#define RCU_INT_CKMIF_Pos                 (7UL)                     /*!< CKMIF (Bit 7)                                         */
#define RCU_INT_CKMIF_Msk                 (0x80UL)                  /*!< CKMIF (Bitfield-Mask: 0x01)                           */
#define RCU_INT_IRC28MSTBIF_Pos           (5UL)                     /*!< IRC28MSTBIF (Bit 5)                                   */
#define RCU_INT_IRC28MSTBIF_Msk           (0x20UL)                  /*!< IRC28MSTBIF (Bitfield-Mask: 0x01)                     */
#define RCU_INT_PLLSTBIF_Pos              (4UL)                     /*!< PLLSTBIF (Bit 4)                                      */
#define RCU_INT_PLLSTBIF_Msk              (0x10UL)                  /*!< PLLSTBIF (Bitfield-Mask: 0x01)                        */
#define RCU_INT_HXTALSTBIF_Pos            (3UL)                     /*!< HXTALSTBIF (Bit 3)                                    */
#define RCU_INT_HXTALSTBIF_Msk            (0x8UL)                   /*!< HXTALSTBIF (Bitfield-Mask: 0x01)                      */
#define RCU_INT_IRC8MSTBIF_Pos            (2UL)                     /*!< IRC8MSTBIF (Bit 2)                                    */
#define RCU_INT_IRC8MSTBIF_Msk            (0x4UL)                   /*!< IRC8MSTBIF (Bitfield-Mask: 0x01)                      */
#define RCU_INT_LXTALSTBIF_Pos            (1UL)                     /*!< LXTALSTBIF (Bit 1)                                    */
#define RCU_INT_LXTALSTBIF_Msk            (0x2UL)                   /*!< LXTALSTBIF (Bitfield-Mask: 0x01)                      */
#define RCU_INT_IRC40KSTBIF_Pos           (0UL)                     /*!< IRC40KSTBIF (Bit 0)                                   */
#define RCU_INT_IRC40KSTBIF_Msk           (0x1UL)                   /*!< IRC40KSTBIF (Bitfield-Mask: 0x01)                     */
/* ========================================================  APB2RST  ======================================================== */
#define RCU_APB2RST_TIMER16RST_Pos        (18UL)                    /*!< TIMER16RST (Bit 18)                                   */
#define RCU_APB2RST_TIMER16RST_Msk        (0x40000UL)               /*!< TIMER16RST (Bitfield-Mask: 0x01)                      */
#define RCU_APB2RST_TIMER15RST_Pos        (17UL)                    /*!< TIMER15RST (Bit 17)                                   */
#define RCU_APB2RST_TIMER15RST_Msk        (0x20000UL)               /*!< TIMER15RST (Bitfield-Mask: 0x01)                      */
#define RCU_APB2RST_TIMER14RST_Pos        (16UL)                    /*!< TIMER14RST (Bit 16)                                   */
#define RCU_APB2RST_TIMER14RST_Msk        (0x10000UL)               /*!< TIMER14RST (Bitfield-Mask: 0x01)                      */
#define RCU_APB2RST_USART0RST_Pos         (14UL)                    /*!< USART0RST (Bit 14)                                    */
#define RCU_APB2RST_USART0RST_Msk         (0x4000UL)                /*!< USART0RST (Bitfield-Mask: 0x01)                       */
#define RCU_APB2RST_SPI0RST_Pos           (12UL)                    /*!< SPI0RST (Bit 12)                                      */
#define RCU_APB2RST_SPI0RST_Msk           (0x1000UL)                /*!< SPI0RST (Bitfield-Mask: 0x01)                         */
#define RCU_APB2RST_TIMER0RST_Pos         (11UL)                    /*!< TIMER0RST (Bit 11)                                    */
#define RCU_APB2RST_TIMER0RST_Msk         (0x800UL)                 /*!< TIMER0RST (Bitfield-Mask: 0x01)                       */
#define RCU_APB2RST_ADCRST_Pos            (9UL)                     /*!< ADCRST (Bit 9)                                        */
#define RCU_APB2RST_ADCRST_Msk            (0x200UL)                 /*!< ADCRST (Bitfield-Mask: 0x01)                          */
#define RCU_APB2RST_CFGCMPRST_Pos         (0UL)                     /*!< CFGCMPRST (Bit 0)                                     */
#define RCU_APB2RST_CFGCMPRST_Msk         (0x1UL)                   /*!< CFGCMPRST (Bitfield-Mask: 0x01)                       */
/* ========================================================  APB1RST  ======================================================== */
#define RCU_APB1RST_CECRST_Pos            (30UL)                    /*!< CECRST (Bit 30)                                       */
#define RCU_APB1RST_CECRST_Msk            (0x40000000UL)            /*!< CECRST (Bitfield-Mask: 0x01)                          */
#define RCU_APB1RST_DACRST_Pos            (29UL)                    /*!< DACRST (Bit 29)                                       */
#define RCU_APB1RST_DACRST_Msk            (0x20000000UL)            /*!< DACRST (Bitfield-Mask: 0x01)                          */
#define RCU_APB1RST_PMURST_Pos            (28UL)                    /*!< PMURST (Bit 28)                                       */
#define RCU_APB1RST_PMURST_Msk            (0x10000000UL)            /*!< PMURST (Bitfield-Mask: 0x01)                          */
#define RCU_APB1RST_I2C1RST_Pos           (22UL)                    /*!< I2C1RST (Bit 22)                                      */
#define RCU_APB1RST_I2C1RST_Msk           (0x400000UL)              /*!< I2C1RST (Bitfield-Mask: 0x01)                         */
#define RCU_APB1RST_I2C0RST_Pos           (21UL)                    /*!< I2C0RST (Bit 21)                                      */
#define RCU_APB1RST_I2C0RST_Msk           (0x200000UL)              /*!< I2C0RST (Bitfield-Mask: 0x01)                         */
#define RCU_APB1RST_USART1RST_Pos         (17UL)                    /*!< USART1RST (Bit 17)                                    */
#define RCU_APB1RST_USART1RST_Msk         (0x20000UL)               /*!< USART1RST (Bitfield-Mask: 0x01)                       */
#define RCU_APB1RST_SPI1RST_Pos           (14UL)                    /*!< SPI1RST (Bit 14)                                      */
#define RCU_APB1RST_SPI1RST_Msk           (0x4000UL)                /*!< SPI1RST (Bitfield-Mask: 0x01)                         */
#define RCU_APB1RST_WWDGTRST_Pos          (11UL)                    /*!< WWDGTRST (Bit 11)                                     */
#define RCU_APB1RST_WWDGTRST_Msk          (0x800UL)                 /*!< WWDGTRST (Bitfield-Mask: 0x01)                        */
#define RCU_APB1RST_TIMER13RST_Pos        (8UL)                     /*!< TIMER13RST (Bit 8)                                    */
#define RCU_APB1RST_TIMER13RST_Msk        (0x100UL)                 /*!< TIMER13RST (Bitfield-Mask: 0x01)                      */
#define RCU_APB1RST_TIMER5RST_Pos         (4UL)                     /*!< TIMER5RST (Bit 4)                                     */
#define RCU_APB1RST_TIMER5RST_Msk         (0x10UL)                  /*!< TIMER5RST (Bitfield-Mask: 0x01)                       */
#define RCU_APB1RST_TIMER2RST_Pos         (1UL)                     /*!< TIMER2RST (Bit 1)                                     */
#define RCU_APB1RST_TIMER2RST_Msk         (0x2UL)                   /*!< TIMER2RST (Bitfield-Mask: 0x01)                       */
#define RCU_APB1RST_TIMER1RST_Pos         (0UL)                     /*!< TIMER1RST (Bit 0)                                     */
#define RCU_APB1RST_TIMER1RST_Msk         (0x1UL)                   /*!< TIMER1RST (Bitfield-Mask: 0x01)                       */
/* =========================================================  AHBEN  ========================================================= */
#define RCU_AHBEN_TSIEN_Pos               (24UL)                    /*!< TSIEN (Bit 24)                                        */
#define RCU_AHBEN_TSIEN_Msk               (0x1000000UL)             /*!< TSIEN (Bitfield-Mask: 0x01)                           */
#define RCU_AHBEN_PFEN_Pos                (22UL)                    /*!< PFEN (Bit 22)                                         */
#define RCU_AHBEN_PFEN_Msk                (0x400000UL)              /*!< PFEN (Bitfield-Mask: 0x01)                            */
#define RCU_AHBEN_PDEN_Pos                (20UL)                    /*!< PDEN (Bit 20)                                         */
#define RCU_AHBEN_PDEN_Msk                (0x100000UL)              /*!< PDEN (Bitfield-Mask: 0x01)                            */
#define RCU_AHBEN_PCEN_Pos                (19UL)                    /*!< PCEN (Bit 19)                                         */
#define RCU_AHBEN_PCEN_Msk                (0x80000UL)               /*!< PCEN (Bitfield-Mask: 0x01)                            */
#define RCU_AHBEN_PBEN_Pos                (18UL)                    /*!< PBEN (Bit 18)                                         */
#define RCU_AHBEN_PBEN_Msk                (0x40000UL)               /*!< PBEN (Bitfield-Mask: 0x01)                            */
#define RCU_AHBEN_PAEN_Pos                (17UL)                    /*!< PAEN (Bit 17)                                         */
#define RCU_AHBEN_PAEN_Msk                (0x20000UL)               /*!< PAEN (Bitfield-Mask: 0x01)                            */
#define RCU_AHBEN_USBFSEN_Pos             (12UL)                    /*!< USBFSEN (Bit 12)                                      */
#define RCU_AHBEN_USBFSEN_Msk             (0x1000UL)                /*!< USBFSEN (Bitfield-Mask: 0x01)                         */
#define RCU_AHBEN_CRCEN_Pos               (6UL)                     /*!< CRCEN (Bit 6)                                         */
#define RCU_AHBEN_CRCEN_Msk               (0x40UL)                  /*!< CRCEN (Bitfield-Mask: 0x01)                           */
#define RCU_AHBEN_FMCSPEN_Pos             (4UL)                     /*!< FMCSPEN (Bit 4)                                       */
#define RCU_AHBEN_FMCSPEN_Msk             (0x10UL)                  /*!< FMCSPEN (Bitfield-Mask: 0x01)                         */
#define RCU_AHBEN_SRAMSPEN_Pos            (2UL)                     /*!< SRAMSPEN (Bit 2)                                      */
#define RCU_AHBEN_SRAMSPEN_Msk            (0x4UL)                   /*!< SRAMSPEN (Bitfield-Mask: 0x01)                        */
#define RCU_AHBEN_DMAEN_Pos               (0UL)                     /*!< DMAEN (Bit 0)                                         */
#define RCU_AHBEN_DMAEN_Msk               (0x1UL)                   /*!< DMAEN (Bitfield-Mask: 0x01)                           */
/* ========================================================  APB2EN  ========================================================= */
#define RCU_APB2EN_TIMER16EN_Pos          (18UL)                    /*!< TIMER16EN (Bit 18)                                    */
#define RCU_APB2EN_TIMER16EN_Msk          (0x40000UL)               /*!< TIMER16EN (Bitfield-Mask: 0x01)                       */
#define RCU_APB2EN_TIMER15EN_Pos          (17UL)                    /*!< TIMER15EN (Bit 17)                                    */
#define RCU_APB2EN_TIMER15EN_Msk          (0x20000UL)               /*!< TIMER15EN (Bitfield-Mask: 0x01)                       */
#define RCU_APB2EN_TIMER14EN_Pos          (16UL)                    /*!< TIMER14EN (Bit 16)                                    */
#define RCU_APB2EN_TIMER14EN_Msk          (0x10000UL)               /*!< TIMER14EN (Bitfield-Mask: 0x01)                       */
#define RCU_APB2EN_USART0EN_Pos           (14UL)                    /*!< USART0EN (Bit 14)                                     */
#define RCU_APB2EN_USART0EN_Msk           (0x4000UL)                /*!< USART0EN (Bitfield-Mask: 0x01)                        */
#define RCU_APB2EN_SPI0EN_Pos             (12UL)                    /*!< SPI0EN (Bit 12)                                       */
#define RCU_APB2EN_SPI0EN_Msk             (0x1000UL)                /*!< SPI0EN (Bitfield-Mask: 0x01)                          */
#define RCU_APB2EN_TIMER0EN_Pos           (11UL)                    /*!< TIMER0EN (Bit 11)                                     */
#define RCU_APB2EN_TIMER0EN_Msk           (0x800UL)                 /*!< TIMER0EN (Bitfield-Mask: 0x01)                        */
#define RCU_APB2EN_ADCEN_Pos              (9UL)                     /*!< ADCEN (Bit 9)                                         */
#define RCU_APB2EN_ADCEN_Msk              (0x200UL)                 /*!< ADCEN (Bitfield-Mask: 0x01)                           */
#define RCU_APB2EN_CFGCMPEN_Pos           (0UL)                     /*!< CFGCMPEN (Bit 0)                                      */
#define RCU_APB2EN_CFGCMPEN_Msk           (0x1UL)                   /*!< CFGCMPEN (Bitfield-Mask: 0x01)                        */
/* ========================================================  APB1EN  ========================================================= */
#define RCU_APB1EN_CECEN_Pos              (30UL)                    /*!< CECEN (Bit 30)                                        */
#define RCU_APB1EN_CECEN_Msk              (0x40000000UL)            /*!< CECEN (Bitfield-Mask: 0x01)                           */
#define RCU_APB1EN_DACEN_Pos              (29UL)                    /*!< DACEN (Bit 29)                                        */
#define RCU_APB1EN_DACEN_Msk              (0x20000000UL)            /*!< DACEN (Bitfield-Mask: 0x01)                           */
#define RCU_APB1EN_PMUEN_Pos              (28UL)                    /*!< PMUEN (Bit 28)                                        */
#define RCU_APB1EN_PMUEN_Msk              (0x10000000UL)            /*!< PMUEN (Bitfield-Mask: 0x01)                           */
#define RCU_APB1EN_I2C1EN_Pos             (22UL)                    /*!< I2C1EN (Bit 22)                                       */
#define RCU_APB1EN_I2C1EN_Msk             (0x400000UL)              /*!< I2C1EN (Bitfield-Mask: 0x01)                          */
#define RCU_APB1EN_I2C0EN_Pos             (21UL)                    /*!< I2C0EN (Bit 21)                                       */
#define RCU_APB1EN_I2C0EN_Msk             (0x200000UL)              /*!< I2C0EN (Bitfield-Mask: 0x01)                          */
