RIOT-OS/RIOT/cpu/gd32f3x0/include/gd32f3x0_periph.h
#define RCU_APB1EN_USART1EN_Pos           (17UL)                    /*!< USART1EN (Bit 17)                                     */
#define RCU_APB1EN_USART1EN_Msk           (0x20000UL)               /*!< USART1EN (Bitfield-Mask: 0x01)                        */
#define RCU_APB1EN_SPI1EN_Pos             (14UL)                    /*!< SPI1EN (Bit 14)                                       */
#define RCU_APB1EN_SPI1EN_Msk             (0x4000UL)                /*!< SPI1EN (Bitfield-Mask: 0x01)                          */
#define RCU_APB1EN_WWDGTEN_Pos            (11UL)                    /*!< WWDGTEN (Bit 11)                                      */
#define RCU_APB1EN_WWDGTEN_Msk            (0x800UL)                 /*!< WWDGTEN (Bitfield-Mask: 0x01)                         */
#define RCU_APB1EN_TIMER13EN_Pos          (8UL)                     /*!< TIMER13EN (Bit 8)                                     */
#define RCU_APB1EN_TIMER13EN_Msk          (0x100UL)                 /*!< TIMER13EN (Bitfield-Mask: 0x01)                       */
#define RCU_APB1EN_TIMER5EN_Pos           (4UL)                     /*!< TIMER5EN (Bit 4)                                      */
#define RCU_APB1EN_TIMER5EN_Msk           (0x10UL)                  /*!< TIMER5EN (Bitfield-Mask: 0x01)                        */
#define RCU_APB1EN_TIMER2EN_Pos           (1UL)                     /*!< TIMER2EN (Bit 1)                                      */
#define RCU_APB1EN_TIMER2EN_Msk           (0x2UL)                   /*!< TIMER2EN (Bitfield-Mask: 0x01)                        */
#define RCU_APB1EN_TIMER1EN_Pos           (0UL)                     /*!< TIMER1EN (Bit 0)                                      */
#define RCU_APB1EN_TIMER1EN_Msk           (0x1UL)                   /*!< TIMER1EN (Bitfield-Mask: 0x01)                        */
/* =========================================================  BDCTL  ========================================================= */
#define RCU_BDCTL_BKPRST_Pos              (16UL)                    /*!< BKPRST (Bit 16)                                       */
#define RCU_BDCTL_BKPRST_Msk              (0x10000UL)               /*!< BKPRST (Bitfield-Mask: 0x01)                          */
#define RCU_BDCTL_RTCEN_Pos               (15UL)                    /*!< RTCEN (Bit 15)                                        */
#define RCU_BDCTL_RTCEN_Msk               (0x8000UL)                /*!< RTCEN (Bitfield-Mask: 0x01)                           */
#define RCU_BDCTL_RTCSRC_Pos              (8UL)                     /*!< RTCSRC (Bit 8)                                        */
#define RCU_BDCTL_RTCSRC_Msk              (0x300UL)                 /*!< RTCSRC (Bitfield-Mask: 0x03)                          */
#define RCU_BDCTL_LXTALDRI_Pos            (3UL)                     /*!< LXTALDRI (Bit 3)                                      */
#define RCU_BDCTL_LXTALDRI_Msk            (0x18UL)                  /*!< LXTALDRI (Bitfield-Mask: 0x03)                        */
#define RCU_BDCTL_LXTALBPS_Pos            (2UL)                     /*!< LXTALBPS (Bit 2)                                      */
#define RCU_BDCTL_LXTALBPS_Msk            (0x4UL)                   /*!< LXTALBPS (Bitfield-Mask: 0x01)                        */
#define RCU_BDCTL_LXTALSTB_Pos            (1UL)                     /*!< LXTALSTB (Bit 1)                                      */
#define RCU_BDCTL_LXTALSTB_Msk            (0x2UL)                   /*!< LXTALSTB (Bitfield-Mask: 0x01)                        */
#define RCU_BDCTL_LXTALEN_Pos             (0UL)                     /*!< LXTALEN (Bit 0)                                       */
#define RCU_BDCTL_LXTALEN_Msk             (0x1UL)                   /*!< LXTALEN (Bitfield-Mask: 0x01)                         */
/* ========================================================  RSTSCK  ========================================================= */
#define RCU_RSTSCK_LPRSTF_Pos             (31UL)                    /*!< LPRSTF (Bit 31)                                       */
#define RCU_RSTSCK_LPRSTF_Msk             (0x80000000UL)            /*!< LPRSTF (Bitfield-Mask: 0x01)                          */
#define RCU_RSTSCK_WWDGTRSTF_Pos          (30UL)                    /*!< WWDGTRSTF (Bit 30)                                    */
#define RCU_RSTSCK_WWDGTRSTF_Msk          (0x40000000UL)            /*!< WWDGTRSTF (Bitfield-Mask: 0x01)                       */
#define RCU_RSTSCK_FWDGTRSTF_Pos          (29UL)                    /*!< FWDGTRSTF (Bit 29)                                    */
#define RCU_RSTSCK_FWDGTRSTF_Msk          (0x20000000UL)            /*!< FWDGTRSTF (Bitfield-Mask: 0x01)                       */
#define RCU_RSTSCK_SWRSTF_Pos             (28UL)                    /*!< SWRSTF (Bit 28)                                       */
#define RCU_RSTSCK_SWRSTF_Msk             (0x10000000UL)            /*!< SWRSTF (Bitfield-Mask: 0x01)                          */
#define RCU_RSTSCK_PORRSTF_Pos            (27UL)                    /*!< PORRSTF (Bit 27)                                      */
#define RCU_RSTSCK_PORRSTF_Msk            (0x8000000UL)             /*!< PORRSTF (Bitfield-Mask: 0x01)                         */
#define RCU_RSTSCK_EPRSTF_Pos             (26UL)                    /*!< EPRSTF (Bit 26)                                       */
#define RCU_RSTSCK_EPRSTF_Msk             (0x4000000UL)             /*!< EPRSTF (Bitfield-Mask: 0x01)                          */
#define RCU_RSTSCK_OBLRSTF_Pos            (25UL)                    /*!< OBLRSTF (Bit 25)                                      */
#define RCU_RSTSCK_OBLRSTF_Msk            (0x2000000UL)             /*!< OBLRSTF (Bitfield-Mask: 0x01)                         */
#define RCU_RSTSCK_RSTFC_Pos              (24UL)                    /*!< RSTFC (Bit 24)                                        */
#define RCU_RSTSCK_RSTFC_Msk              (0x1000000UL)             /*!< RSTFC (Bitfield-Mask: 0x01)                           */
#define RCU_RSTSCK_V12RSTF_Pos            (23UL)                    /*!< V12RSTF (Bit 23)                                      */
#define RCU_RSTSCK_V12RSTF_Msk            (0x800000UL)              /*!< V12RSTF (Bitfield-Mask: 0x01)                         */
#define RCU_RSTSCK_IRC40KSTB_Pos          (1UL)                     /*!< IRC40KSTB (Bit 1)                                     */
#define RCU_RSTSCK_IRC40KSTB_Msk          (0x2UL)                   /*!< IRC40KSTB (Bitfield-Mask: 0x01)                       */
#define RCU_RSTSCK_IRC40KEN_Pos           (0UL)                     /*!< IRC40KEN (Bit 0)                                      */
#define RCU_RSTSCK_IRC40KEN_Msk           (0x1UL)                   /*!< IRC40KEN (Bitfield-Mask: 0x01)                        */
/* ========================================================  AHBRST  ========================================================= */
#define RCU_AHBRST_TSIRST_Pos             (24UL)                    /*!< TSIRST (Bit 24)                                       */
#define RCU_AHBRST_TSIRST_Msk             (0x1000000UL)             /*!< TSIRST (Bitfield-Mask: 0x01)                          */
#define RCU_AHBRST_PFRST_Pos              (22UL)                    /*!< PFRST (Bit 22)                                        */
#define RCU_AHBRST_PFRST_Msk              (0x400000UL)              /*!< PFRST (Bitfield-Mask: 0x01)                           */
#define RCU_AHBRST_PDRST_Pos              (20UL)                    /*!< PDRST (Bit 20)                                        */
#define RCU_AHBRST_PDRST_Msk              (0x100000UL)              /*!< PDRST (Bitfield-Mask: 0x01)                           */
#define RCU_AHBRST_PCRST_Pos              (19UL)                    /*!< PCRST (Bit 19)                                        */
#define RCU_AHBRST_PCRST_Msk              (0x80000UL)               /*!< PCRST (Bitfield-Mask: 0x01)                           */
#define RCU_AHBRST_PBRST_Pos              (18UL)                    /*!< PBRST (Bit 18)                                        */
#define RCU_AHBRST_PBRST_Msk              (0x40000UL)               /*!< PBRST (Bitfield-Mask: 0x01)                           */
#define RCU_AHBRST_PARST_Pos              (17UL)                    /*!< PARST (Bit 17)                                        */
#define RCU_AHBRST_PARST_Msk              (0x20000UL)               /*!< PARST (Bitfield-Mask: 0x01)                           */
#define RCU_AHBRST_USBFSRST_Pos           (12UL)                    /*!< USBFSRST (Bit 12)                                     */
#define RCU_AHBRST_USBFSRST_Msk           (0x1000UL)                /*!< USBFSRST (Bitfield-Mask: 0x01)                        */
/* =========================================================  CFG1  ========================================================== */
#define RCU_CFG1_PLLMF_Pos                (31UL)                    /*!< PLLMF (Bit 31)                                        */
#define RCU_CFG1_PLLMF_Msk                (0x80000000UL)            /*!< PLLMF (Bitfield-Mask: 0x01)                           */
#define RCU_CFG1_PLLPRESEL_Pos            (30UL)                    /*!< PLLPRESEL (Bit 30)                                    */
#define RCU_CFG1_PLLPRESEL_Msk            (0x40000000UL)            /*!< PLLPRESEL (Bitfield-Mask: 0x01)                       */
#define RCU_CFG1_PREDV_Pos                (0UL)                     /*!< PREDV (Bit 0)                                         */
#define RCU_CFG1_PREDV_Msk                (0xfUL)                   /*!< PREDV (Bitfield-Mask: 0x0f)                           */
/* =========================================================  CFG2  ========================================================== */
#define RCU_CFG2_ADCPSC_Pos               (31UL)                    /*!< ADCPSC (Bit 31)                                       */
#define RCU_CFG2_ADCPSC_Msk               (0x80000000UL)            /*!< ADCPSC (Bitfield-Mask: 0x01)                          */
#define RCU_CFG2_USBFSPSC_Pos             (30UL)                    /*!< USBFSPSC (Bit 30)                                     */
#define RCU_CFG2_USBFSPSC_Msk             (0x40000000UL)            /*!< USBFSPSC (Bitfield-Mask: 0x01)                        */
#define RCU_CFG2_IRC28MDIV_Pos            (16UL)                    /*!< IRC28MDIV (Bit 16)                                    */
#define RCU_CFG2_IRC28MDIV_Msk            (0x10000UL)               /*!< IRC28MDIV (Bitfield-Mask: 0x01)                       */
#define RCU_CFG2_ADCSEL_Pos               (8UL)                     /*!< ADCSEL (Bit 8)                                        */
#define RCU_CFG2_ADCSEL_Msk               (0x100UL)                 /*!< ADCSEL (Bitfield-Mask: 0x01)                          */
#define RCU_CFG2_CECSEL_Pos               (6UL)                     /*!< CECSEL (Bit 6)                                        */
#define RCU_CFG2_CECSEL_Msk               (0x40UL)                  /*!< CECSEL (Bitfield-Mask: 0x01)                          */
#define RCU_CFG2_USART0SEL_Pos            (0UL)                     /*!< USART0SEL (Bit 0)                                     */
#define RCU_CFG2_USART0SEL_Msk            (0x3UL)                   /*!< USART0SEL (Bitfield-Mask: 0x03)                       */
/* =========================================================  CTL1  ========================================================== */
#define RCU_CTL1_IRC28MCALIB_Pos          (8UL)                     /*!< IRC28MCALIB (Bit 8)                                   */
#define RCU_CTL1_IRC28MCALIB_Msk          (0xff00UL)                /*!< IRC28MCALIB (Bitfield-Mask: 0xff)                     */
#define RCU_CTL1_IRC28MADJ_Pos            (3UL)                     /*!< IRC28MADJ (Bit 3)                                     */
#define RCU_CTL1_IRC28MADJ_Msk            (0xf8UL)                  /*!< IRC28MADJ (Bitfield-Mask: 0x1f)                       */
#define RCU_CTL1_IRC28MSTB_Pos            (1UL)                     /*!< IRC28MSTB (Bit 1)                                     */
#define RCU_CTL1_IRC28MSTB_Msk            (0x2UL)                   /*!< IRC28MSTB (Bitfield-Mask: 0x01)                       */
#define RCU_CTL1_IRC28MEN_Pos             (0UL)                     /*!< IRC28MEN (Bit 0)                                      */
#define RCU_CTL1_IRC28MEN_Msk             (0x1UL)                   /*!< IRC28MEN (Bitfield-Mask: 0x01)                        */
/* ========================================================  ADDCTL  ========================================================= */
#define RCU_ADDCTL_IRC48MCALIB_Pos        (24UL)                    /*!< IRC48MCALIB (Bit 24)                                  */
#define RCU_ADDCTL_IRC48MCALIB_Msk        (0xff000000UL)            /*!< IRC48MCALIB (Bitfield-Mask: 0xff)                     */
#define RCU_ADDCTL_IRC48MSTB_Pos          (17UL)                    /*!< IRC48MSTB (Bit 17)                                    */
#define RCU_ADDCTL_IRC48MSTB_Msk          (0x20000UL)               /*!< IRC48MSTB (Bitfield-Mask: 0x01)                       */
#define RCU_ADDCTL_IRC48MEN_Pos           (16UL)                    /*!< IRC48MEN (Bit 16)                                     */
#define RCU_ADDCTL_IRC48MEN_Msk           (0x10000UL)               /*!< IRC48MEN (Bitfield-Mask: 0x01)                        */
#define RCU_ADDCTL_CK48MSEL_Pos           (0UL)                     /*!< CK48MSEL (Bit 0)                                      */
#define RCU_ADDCTL_CK48MSEL_Msk           (0x1UL)                   /*!< CK48MSEL (Bitfield-Mask: 0x01)                        */
/* ========================================================  ADDINT  ========================================================= */
#define RCU_ADDINT_IRC48MSTBIC_Pos        (22UL)                    /*!< IRC48MSTBIC (Bit 22)                                  */
#define RCU_ADDINT_IRC48MSTBIC_Msk        (0x400000UL)              /*!< IRC48MSTBIC (Bitfield-Mask: 0x01)                     */
#define RCU_ADDINT_IRC48MSTBIE_Pos        (14UL)                    /*!< IRC48MSTBIE (Bit 14)                                  */
#define RCU_ADDINT_IRC48MSTBIE_Msk        (0x4000UL)                /*!< IRC48MSTBIE (Bitfield-Mask: 0x01)                     */
#define RCU_ADDINT_IRC48MSTBIF_Pos        (6UL)                     /*!< IRC48MSTBIF (Bit 6)                                   */
#define RCU_ADDINT_IRC48MSTBIF_Msk        (0x40UL)                  /*!< IRC48MSTBIF (Bitfield-Mask: 0x01)                     */
/* =======================================================  ADDAPB1EN  ======================================================= */
#define RCU_ADDAPB1EN_CTCEN_Pos           (27UL)                    /*!< CTCEN (Bit 27)                                        */
#define RCU_ADDAPB1EN_CTCEN_Msk           (0x8000000UL)             /*!< CTCEN (Bitfield-Mask: 0x01)                           */
/* ======================================================  ADDAPB1RST  ======================================================= */
#define RCU_ADDAPB1RST_CTCRST_Pos         (27UL)                    /*!< CTCRST (Bit 27)                                       */
#define RCU_ADDAPB1RST_CTCRST_Msk         (0x8000000UL)             /*!< CTCRST (Bitfield-Mask: 0x01)                          */
/* =========================================================  VKEY  ========================================================== */
#define RCU_VKEY_KEY_Pos                  (0UL)                     /*!< KEY (Bit 0)                                           */
#define RCU_VKEY_KEY_Msk                  (0xffffffffUL)            /*!< KEY (Bitfield-Mask: 0xffffffff)                       */
/* ==========================================================  DSV  ========================================================== */
#define RCU_DSV_DSLPVS_Pos                (0UL)                     /*!< DSLPVS (Bit 0)                                        */
#define RCU_DSV_DSLPVS_Msk                (0x3UL)                   /*!< DSLPVS (Bitfield-Mask: 0x03)                          */


/* =========================================================================================================================== */
/* ================                                            RTC                                            ================ */
/* =========================================================================================================================== */

