RIOT-OS/RIOT/cpu/gd32f3x0/include/gd32f3x0_periph.h
#define RTC_TAMP_PRCH_Pos                 (13UL)                    /*!< PRCH (Bit 13)                                         */
#define RTC_TAMP_PRCH_Msk                 (0x6000UL)                /*!< PRCH (Bitfield-Mask: 0x03)                            */
#define RTC_TAMP_FLT_Pos                  (11UL)                    /*!< FLT (Bit 11)                                          */
#define RTC_TAMP_FLT_Msk                  (0x1800UL)                /*!< FLT (Bitfield-Mask: 0x03)                             */
#define RTC_TAMP_FREQ_Pos                 (8UL)                     /*!< FREQ (Bit 8)                                          */
#define RTC_TAMP_FREQ_Msk                 (0x700UL)                 /*!< FREQ (Bitfield-Mask: 0x07)                            */
#define RTC_TAMP_TPTS_Pos                 (7UL)                     /*!< TPTS (Bit 7)                                          */
#define RTC_TAMP_TPTS_Msk                 (0x80UL)                  /*!< TPTS (Bitfield-Mask: 0x01)                            */
#define RTC_TAMP_TP1EG_Pos                (4UL)                     /*!< TP1EG (Bit 4)                                         */
#define RTC_TAMP_TP1EG_Msk                (0x10UL)                  /*!< TP1EG (Bitfield-Mask: 0x01)                           */
#define RTC_TAMP_TP1EN_Pos                (3UL)                     /*!< TP1EN (Bit 3)                                         */
#define RTC_TAMP_TP1EN_Msk                (0x8UL)                   /*!< TP1EN (Bitfield-Mask: 0x01)                           */
#define RTC_TAMP_TPIE_Pos                 (2UL)                     /*!< TPIE (Bit 2)                                          */
#define RTC_TAMP_TPIE_Msk                 (0x4UL)                   /*!< TPIE (Bitfield-Mask: 0x01)                            */
#define RTC_TAMP_TP0EG_Pos                (1UL)                     /*!< TP0EG (Bit 1)                                         */
#define RTC_TAMP_TP0EG_Msk                (0x2UL)                   /*!< TP0EG (Bitfield-Mask: 0x01)                           */
#define RTC_TAMP_TP0EN_Pos                (0UL)                     /*!< TP0EN (Bit 0)                                         */
#define RTC_TAMP_TP0EN_Msk                (0x1UL)                   /*!< TP0EN (Bitfield-Mask: 0x01)                           */
/* ========================================================  ALRM0SS  ======================================================== */
#define RTC_ALRM0SS_MSKSSC_Pos            (24UL)                    /*!< MSKSSC (Bit 24)                                       */
#define RTC_ALRM0SS_MSKSSC_Msk            (0xf000000UL)             /*!< MSKSSC (Bitfield-Mask: 0x0f)                          */
#define RTC_ALRM0SS_SSC_Pos               (0UL)                     /*!< SSC (Bit 0)                                           */
#define RTC_ALRM0SS_SSC_Msk               (0x7fffUL)                /*!< SSC (Bitfield-Mask: 0x7fff)                           */
/* =========================================================  BKP0  ========================================================== */
#define RTC_BKP0_DATA_Pos                 (0UL)                     /*!< DATA (Bit 0)                                          */
#define RTC_BKP0_DATA_Msk                 (0xffffffffUL)            /*!< DATA (Bitfield-Mask: 0xffffffff)                      */
/* =========================================================  BKP1  ========================================================== */
#define RTC_BKP1_DATA_Pos                 (0UL)                     /*!< DATA (Bit 0)                                          */
#define RTC_BKP1_DATA_Msk                 (0xffffffffUL)            /*!< DATA (Bitfield-Mask: 0xffffffff)                      */
/* =========================================================  BKP2  ========================================================== */
#define RTC_BKP2_DATA_Pos                 (0UL)                     /*!< DATA (Bit 0)                                          */
#define RTC_BKP2_DATA_Msk                 (0xffffffffUL)            /*!< DATA (Bitfield-Mask: 0xffffffff)                      */
/* =========================================================  BKP3  ========================================================== */
#define RTC_BKP3_DATA_Pos                 (0UL)                     /*!< DATA (Bit 0)                                          */
#define RTC_BKP3_DATA_Msk                 (0xffffffffUL)            /*!< DATA (Bitfield-Mask: 0xffffffff)                      */
/* =========================================================  BKP4  ========================================================== */
#define RTC_BKP4_DATA_Pos                 (0UL)                     /*!< DATA (Bit 0)                                          */
#define RTC_BKP4_DATA_Msk                 (0xffffffffUL)            /*!< DATA (Bitfield-Mask: 0xffffffff)                      */


/* =========================================================================================================================== */
/* ================                                           SPI0                                            ================ */
/* =========================================================================================================================== */

/* =========================================================  CTL0  ========================================================== */
#define SPI0_CTL0_BDEN_Pos                (15UL)                    /*!< BDEN (Bit 15)                                         */
#define SPI0_CTL0_BDEN_Msk                (0x8000UL)                /*!< BDEN (Bitfield-Mask: 0x01)                            */
#define SPI0_CTL0_BDOEN_Pos               (14UL)                    /*!< BDOEN (Bit 14)                                        */
#define SPI0_CTL0_BDOEN_Msk               (0x4000UL)                /*!< BDOEN (Bitfield-Mask: 0x01)                           */
#define SPI0_CTL0_CRCEN_Pos               (13UL)                    /*!< CRCEN (Bit 13)                                        */
#define SPI0_CTL0_CRCEN_Msk               (0x2000UL)                /*!< CRCEN (Bitfield-Mask: 0x01)                           */
#define SPI0_CTL0_CRCNT_Pos               (12UL)                    /*!< CRCNT (Bit 12)                                        */
#define SPI0_CTL0_CRCNT_Msk               (0x1000UL)                /*!< CRCNT (Bitfield-Mask: 0x01)                           */
#define SPI0_CTL0_FF16_Pos                (11UL)                    /*!< FF16 (Bit 11)                                         */
#define SPI0_CTL0_FF16_Msk                (0x800UL)                 /*!< FF16 (Bitfield-Mask: 0x01)                            */
#define SPI0_CTL0_RO_Pos                  (10UL)                    /*!< RO (Bit 10)                                           */
#define SPI0_CTL0_RO_Msk                  (0x400UL)                 /*!< RO (Bitfield-Mask: 0x01)                              */
#define SPI0_CTL0_SWNSSEN_Pos             (9UL)                     /*!< SWNSSEN (Bit 9)                                       */
#define SPI0_CTL0_SWNSSEN_Msk             (0x200UL)                 /*!< SWNSSEN (Bitfield-Mask: 0x01)                         */
#define SPI0_CTL0_SWNSS_Pos               (8UL)                     /*!< SWNSS (Bit 8)                                         */
#define SPI0_CTL0_SWNSS_Msk               (0x100UL)                 /*!< SWNSS (Bitfield-Mask: 0x01)                           */
#define SPI0_CTL0_LF_Pos                  (7UL)                     /*!< LF (Bit 7)                                            */
#define SPI0_CTL0_LF_Msk                  (0x80UL)                  /*!< LF (Bitfield-Mask: 0x01)                              */
#define SPI0_CTL0_SPIEN_Pos               (6UL)                     /*!< SPIEN (Bit 6)                                         */
#define SPI0_CTL0_SPIEN_Msk               (0x40UL)                  /*!< SPIEN (Bitfield-Mask: 0x01)                           */
#define SPI0_CTL0_PSC_Pos                 (3UL)                     /*!< PSC (Bit 3)                                           */
#define SPI0_CTL0_PSC_Msk                 (0x38UL)                  /*!< PSC (Bitfield-Mask: 0x07)                             */
#define SPI0_CTL0_MSTMOD_Pos              (2UL)                     /*!< MSTMOD (Bit 2)                                        */
#define SPI0_CTL0_MSTMOD_Msk              (0x4UL)                   /*!< MSTMOD (Bitfield-Mask: 0x01)                          */
#define SPI0_CTL0_CKPL_Pos                (1UL)                     /*!< CKPL (Bit 1)                                          */
#define SPI0_CTL0_CKPL_Msk                (0x2UL)                   /*!< CKPL (Bitfield-Mask: 0x01)                            */
#define SPI0_CTL0_CKPH_Pos                (0UL)                     /*!< CKPH (Bit 0)                                          */
#define SPI0_CTL0_CKPH_Msk                (0x1UL)                   /*!< CKPH (Bitfield-Mask: 0x01)                            */
/* =========================================================  CTL1  ========================================================== */
#define SPI0_CTL1_TBEIE_Pos               (7UL)                     /*!< TBEIE (Bit 7)                                         */
#define SPI0_CTL1_TBEIE_Msk               (0x80UL)                  /*!< TBEIE (Bitfield-Mask: 0x01)                           */
#define SPI0_CTL1_RBNEIE_Pos              (6UL)                     /*!< RBNEIE (Bit 6)                                        */
#define SPI0_CTL1_RBNEIE_Msk              (0x40UL)                  /*!< RBNEIE (Bitfield-Mask: 0x01)                          */
#define SPI0_CTL1_ERRIE_Pos               (5UL)                     /*!< ERRIE (Bit 5)                                         */
#define SPI0_CTL1_ERRIE_Msk               (0x20UL)                  /*!< ERRIE (Bitfield-Mask: 0x01)                           */
#define SPI0_CTL1_TMOD_Pos                (4UL)                     /*!< TMOD (Bit 4)                                          */
#define SPI0_CTL1_TMOD_Msk                (0x10UL)                  /*!< TMOD (Bitfield-Mask: 0x01)                            */
#define SPI0_CTL1_NSSP_Pos                (3UL)                     /*!< NSSP (Bit 3)                                          */
#define SPI0_CTL1_NSSP_Msk                (0x8UL)                   /*!< NSSP (Bitfield-Mask: 0x01)                            */
#define SPI0_CTL1_NSSDRV_Pos              (2UL)                     /*!< NSSDRV (Bit 2)                                        */
#define SPI0_CTL1_NSSDRV_Msk              (0x4UL)                   /*!< NSSDRV (Bitfield-Mask: 0x01)                          */
#define SPI0_CTL1_DMATEN_Pos              (1UL)                     /*!< DMATEN (Bit 1)                                        */
#define SPI0_CTL1_DMATEN_Msk              (0x2UL)                   /*!< DMATEN (Bitfield-Mask: 0x01)                          */
#define SPI0_CTL1_DMAREN_Pos              (0UL)                     /*!< DMAREN (Bit 0)                                        */
#define SPI0_CTL1_DMAREN_Msk              (0x1UL)                   /*!< DMAREN (Bitfield-Mask: 0x01)                          */
/* =========================================================  STAT  ========================================================== */
#define SPI0_STAT_FERR_Pos                (8UL)                     /*!< FERR (Bit 8)                                          */
#define SPI0_STAT_FERR_Msk                (0x100UL)                 /*!< FERR (Bitfield-Mask: 0x01)                            */
#define SPI0_STAT_TRANS_Pos               (7UL)                     /*!< TRANS (Bit 7)                                         */
#define SPI0_STAT_TRANS_Msk               (0x80UL)                  /*!< TRANS (Bitfield-Mask: 0x01)                           */
#define SPI0_STAT_RXORERR_Pos             (6UL)                     /*!< RXORERR (Bit 6)                                       */
#define SPI0_STAT_RXORERR_Msk             (0x40UL)                  /*!< RXORERR (Bitfield-Mask: 0x01)                         */
#define SPI0_STAT_CONFERR_Pos             (5UL)                     /*!< CONFERR (Bit 5)                                       */
#define SPI0_STAT_CONFERR_Msk             (0x20UL)                  /*!< CONFERR (Bitfield-Mask: 0x01)                         */
#define SPI0_STAT_CRCERR_Pos              (4UL)                     /*!< CRCERR (Bit 4)                                        */
#define SPI0_STAT_CRCERR_Msk              (0x10UL)                  /*!< CRCERR (Bitfield-Mask: 0x01)                          */
#define SPI0_STAT_TXURERR_Pos             (3UL)                     /*!< TXURERR (Bit 3)                                       */
#define SPI0_STAT_TXURERR_Msk             (0x8UL)                   /*!< TXURERR (Bitfield-Mask: 0x01)                         */
#define SPI0_STAT_I2SCH_Pos               (2UL)                     /*!< I2SCH (Bit 2)                                         */
#define SPI0_STAT_I2SCH_Msk               (0x4UL)                   /*!< I2SCH (Bitfield-Mask: 0x01)                           */
#define SPI0_STAT_TBE_Pos                 (1UL)                     /*!< TBE (Bit 1)                                           */
#define SPI0_STAT_TBE_Msk                 (0x2UL)                   /*!< TBE (Bitfield-Mask: 0x01)                             */
#define SPI0_STAT_RBNE_Pos                (0UL)                     /*!< RBNE (Bit 0)                                          */
#define SPI0_STAT_RBNE_Msk                (0x1UL)                   /*!< RBNE (Bitfield-Mask: 0x01)                            */
/* =========================================================  DATA  ========================================================== */
#define SPI0_DATA_DATA_Pos                (0UL)                     /*!< DATA (Bit 0)                                          */
#define SPI0_DATA_DATA_Msk                (0xffffUL)                /*!< DATA (Bitfield-Mask: 0xffff)                          */
/* ========================================================  CPCPOLY  ======================================================== */
#define SPI0_CPCPOLY_CPR_Pos              (0UL)                     /*!< CPR (Bit 0)                                           */
#define SPI0_CPCPOLY_CPR_Msk              (0xffffUL)                /*!< CPR (Bitfield-Mask: 0xffff)                           */
/* =========================================================  RCRC  ========================================================== */
#define SPI0_RCRC_RCR_Pos                 (0UL)                     /*!< RCR (Bit 0)                                           */
#define SPI0_RCRC_RCR_Msk                 (0xffffUL)                /*!< RCR (Bitfield-Mask: 0xffff)                           */
/* =========================================================  TCRC  ========================================================== */
#define SPI0_TCRC_TCR_Pos                 (0UL)                     /*!< TCR (Bit 0)                                           */
#define SPI0_TCRC_TCR_Msk                 (0xffffUL)                /*!< TCR (Bitfield-Mask: 0xffff)                           */
/* ========================================================  I2SCTL  ========================================================= */
#define SPI0_I2SCTL_I2SSEL_Pos            (11UL)                    /*!< I2SSEL (Bit 11)                                       */
#define SPI0_I2SCTL_I2SSEL_Msk            (0x800UL)                 /*!< I2SSEL (Bitfield-Mask: 0x01)                          */
#define SPI0_I2SCTL_I2SEN_Pos             (10UL)                    /*!< I2SEN (Bit 10)                                        */
#define SPI0_I2SCTL_I2SEN_Msk             (0x400UL)                 /*!< I2SEN (Bitfield-Mask: 0x01)                           */
#define SPI0_I2SCTL_I2SOPMOD_Pos          (8UL)                     /*!< I2SOPMOD (Bit 8)                                      */
#define SPI0_I2SCTL_I2SOPMOD_Msk          (0x300UL)                 /*!< I2SOPMOD (Bitfield-Mask: 0x03)                        */
#define SPI0_I2SCTL_PCMSMOD_Pos           (7UL)                     /*!< PCMSMOD (Bit 7)                                       */
#define SPI0_I2SCTL_PCMSMOD_Msk           (0x80UL)                  /*!< PCMSMOD (Bitfield-Mask: 0x01)                         */
#define SPI0_I2SCTL_I2SSTD_Pos            (4UL)                     /*!< I2SSTD (Bit 4)                                        */
#define SPI0_I2SCTL_I2SSTD_Msk            (0x30UL)                  /*!< I2SSTD (Bitfield-Mask: 0x03)                          */
#define SPI0_I2SCTL_CKPL_Pos              (3UL)                     /*!< CKPL (Bit 3)                                          */
#define SPI0_I2SCTL_CKPL_Msk              (0x8UL)                   /*!< CKPL (Bitfield-Mask: 0x01)                            */
#define SPI0_I2SCTL_DTLEN_Pos             (1UL)                     /*!< DTLEN (Bit 1)                                         */
#define SPI0_I2SCTL_DTLEN_Msk             (0x6UL)                   /*!< DTLEN (Bitfield-Mask: 0x03)                           */
#define SPI0_I2SCTL_CHLEN_Pos             (0UL)                     /*!< CHLEN (Bit 0)                                         */
#define SPI0_I2SCTL_CHLEN_Msk             (0x1UL)                   /*!< CHLEN (Bitfield-Mask: 0x01)                           */
/* ========================================================  I2SPSC  ========================================================= */
#define SPI0_I2SPSC_MCKOEN_Pos            (9UL)                     /*!< MCKOEN (Bit 9)                                        */
#define SPI0_I2SPSC_MCKOEN_Msk            (0x200UL)                 /*!< MCKOEN (Bitfield-Mask: 0x01)                          */
#define SPI0_I2SPSC_OF_Pos                (8UL)                     /*!< OF (Bit 8)                                            */
#define SPI0_I2SPSC_OF_Msk                (0x100UL)                 /*!< OF (Bitfield-Mask: 0x01)                              */
#define SPI0_I2SPSC_DIV_Pos               (0UL)                     /*!< DIV (Bit 0)                                           */
#define SPI0_I2SPSC_DIV_Msk               (0xffUL)                  /*!< DIV (Bitfield-Mask: 0xff)                             */
/* =========================================================  QCTL  ========================================================== */
#define SPI0_QCTL_IO23_DRV_Pos            (2UL)                     /*!< IO23_DRV (Bit 2)                                      */
#define SPI0_QCTL_IO23_DRV_Msk            (0x4UL)                   /*!< IO23_DRV (Bitfield-Mask: 0x01)                        */
#define SPI0_QCTL_QRD_Pos                 (1UL)                     /*!< QRD (Bit 1)                                           */
#define SPI0_QCTL_QRD_Msk                 (0x2UL)                   /*!< QRD (Bitfield-Mask: 0x01)                             */
#define SPI0_QCTL_QMOD_Pos                (0UL)                     /*!< QMOD (Bit 0)                                          */
#define SPI0_QCTL_QMOD_Msk                (0x1UL)                   /*!< QMOD (Bitfield-Mask: 0x01)                            */


/* =========================================================================================================================== */
/* ================                                          SYSCFG                                           ================ */
/* =========================================================================================================================== */

