RIOT-OS/RIOT/cpu/gd32f3x0/include/gd32f3x0_periph.h
/* =========================================================  CFG0  ========================================================== */
#define SYSCFG_CFG0_PB9_HCCE_Pos          (19UL)                    /*!< PB9_HCCE (Bit 19)                                     */
#define SYSCFG_CFG0_PB9_HCCE_Msk          (0x80000UL)               /*!< PB9_HCCE (Bitfield-Mask: 0x01)                        */
#define SYSCFG_CFG0_TIMER16_DMA_RMP_Pos   (12UL)                    /*!< TIMER16_DMA_RMP (Bit 12)                              */
#define SYSCFG_CFG0_TIMER16_DMA_RMP_Msk   (0x1000UL)                /*!< TIMER16_DMA_RMP (Bitfield-Mask: 0x01)                 */
#define SYSCFG_CFG0_TIMER15_DMA_RMP_Pos   (11UL)                    /*!< TIMER15_DMA_RMP (Bit 11)                              */
#define SYSCFG_CFG0_TIMER15_DMA_RMP_Msk   (0x800UL)                 /*!< TIMER15_DMA_RMP (Bitfield-Mask: 0x01)                 */
#define SYSCFG_CFG0_USART0_RX_DMA_RMP_Pos (10UL)                    /*!< USART0_RX_DMA_RMP (Bit 10)                            */
#define SYSCFG_CFG0_USART0_RX_DMA_RMP_Msk (0x400UL)                 /*!< USART0_RX_DMA_RMP (Bitfield-Mask: 0x01)               */
#define SYSCFG_CFG0_USART0_TX_DMA_RMP_Pos (9UL)                     /*!< USART0_TX_DMA_RMP (Bit 9)                             */
#define SYSCFG_CFG0_USART0_TX_DMA_RMP_Msk (0x200UL)                 /*!< USART0_TX_DMA_RMP (Bitfield-Mask: 0x01)               */
#define SYSCFG_CFG0_ADC_DMA_RMP_Pos       (8UL)                     /*!< ADC_DMA_RMP (Bit 8)                                   */
#define SYSCFG_CFG0_ADC_DMA_RMP_Msk       (0x100UL)                 /*!< ADC_DMA_RMP (Bitfield-Mask: 0x01)                     */
#define SYSCFG_CFG0_BOOT_MODE_Pos         (0UL)                     /*!< BOOT_MODE (Bit 0)                                     */
#define SYSCFG_CFG0_BOOT_MODE_Msk         (0x3UL)                   /*!< BOOT_MODE (Bitfield-Mask: 0x03)                       */
/* ========================================================  EXTISS0  ======================================================== */
#define SYSCFG_EXTISS0_EXTI3_SS_Pos       (12UL)                    /*!< EXTI3_SS (Bit 12)                                     */
#define SYSCFG_EXTISS0_EXTI3_SS_Msk       (0xf000UL)                /*!< EXTI3_SS (Bitfield-Mask: 0x0f)                        */
#define SYSCFG_EXTISS0_EXTI2_SS_Pos       (8UL)                     /*!< EXTI2_SS (Bit 8)                                      */
#define SYSCFG_EXTISS0_EXTI2_SS_Msk       (0xf00UL)                 /*!< EXTI2_SS (Bitfield-Mask: 0x0f)                        */
#define SYSCFG_EXTISS0_EXTI1_SS_Pos       (4UL)                     /*!< EXTI1_SS (Bit 4)                                      */
#define SYSCFG_EXTISS0_EXTI1_SS_Msk       (0xf0UL)                  /*!< EXTI1_SS (Bitfield-Mask: 0x0f)                        */
#define SYSCFG_EXTISS0_EXTI0_SS_Pos       (0UL)                     /*!< EXTI0_SS (Bit 0)                                      */
#define SYSCFG_EXTISS0_EXTI0_SS_Msk       (0xfUL)                   /*!< EXTI0_SS (Bitfield-Mask: 0x0f)                        */
/* ========================================================  EXTISS1  ======================================================== */
#define SYSCFG_EXTISS1_EXTI7_SS_Pos       (12UL)                    /*!< EXTI7_SS (Bit 12)                                     */
#define SYSCFG_EXTISS1_EXTI7_SS_Msk       (0xf000UL)                /*!< EXTI7_SS (Bitfield-Mask: 0x0f)                        */
#define SYSCFG_EXTISS1_EXTI6_SS_Pos       (8UL)                     /*!< EXTI6_SS (Bit 8)                                      */
#define SYSCFG_EXTISS1_EXTI6_SS_Msk       (0xf00UL)                 /*!< EXTI6_SS (Bitfield-Mask: 0x0f)                        */
#define SYSCFG_EXTISS1_EXTI5_SS_Pos       (4UL)                     /*!< EXTI5_SS (Bit 4)                                      */
#define SYSCFG_EXTISS1_EXTI5_SS_Msk       (0xf0UL)                  /*!< EXTI5_SS (Bitfield-Mask: 0x0f)                        */
#define SYSCFG_EXTISS1_EXTI4_SS_Pos       (0UL)                     /*!< EXTI4_SS (Bit 0)                                      */
#define SYSCFG_EXTISS1_EXTI4_SS_Msk       (0xfUL)                   /*!< EXTI4_SS (Bitfield-Mask: 0x0f)                        */
/* ========================================================  EXTISS2  ======================================================== */
#define SYSCFG_EXTISS2_EXTI11_SS_Pos      (12UL)                    /*!< EXTI11_SS (Bit 12)                                    */
#define SYSCFG_EXTISS2_EXTI11_SS_Msk      (0xf000UL)                /*!< EXTI11_SS (Bitfield-Mask: 0x0f)                       */
#define SYSCFG_EXTISS2_EXTI10_SS_Pos      (8UL)                     /*!< EXTI10_SS (Bit 8)                                     */
#define SYSCFG_EXTISS2_EXTI10_SS_Msk      (0xf00UL)                 /*!< EXTI10_SS (Bitfield-Mask: 0x0f)                       */
#define SYSCFG_EXTISS2_EXTI9_SS_Pos       (4UL)                     /*!< EXTI9_SS (Bit 4)                                      */
#define SYSCFG_EXTISS2_EXTI9_SS_Msk       (0xf0UL)                  /*!< EXTI9_SS (Bitfield-Mask: 0x0f)                        */
#define SYSCFG_EXTISS2_EXTI8_SS_Pos       (0UL)                     /*!< EXTI8_SS (Bit 0)                                      */
#define SYSCFG_EXTISS2_EXTI8_SS_Msk       (0xfUL)                   /*!< EXTI8_SS (Bitfield-Mask: 0x0f)                        */
/* ========================================================  EXTISS3  ======================================================== */
#define SYSCFG_EXTISS3_EXTI15_SS_Pos      (12UL)                    /*!< EXTI15_SS (Bit 12)                                    */
#define SYSCFG_EXTISS3_EXTI15_SS_Msk      (0xf000UL)                /*!< EXTI15_SS (Bitfield-Mask: 0x0f)                       */
#define SYSCFG_EXTISS3_EXTI14_SS_Pos      (8UL)                     /*!< EXTI14_SS (Bit 8)                                     */
#define SYSCFG_EXTISS3_EXTI14_SS_Msk      (0xf00UL)                 /*!< EXTI14_SS (Bitfield-Mask: 0x0f)                       */
#define SYSCFG_EXTISS3_EXTI13_SS_Pos      (4UL)                     /*!< EXTI13_SS (Bit 4)                                     */
#define SYSCFG_EXTISS3_EXTI13_SS_Msk      (0xf0UL)                  /*!< EXTI13_SS (Bitfield-Mask: 0x0f)                       */
#define SYSCFG_EXTISS3_EXTI12_SS_Pos      (0UL)                     /*!< EXTI12_SS (Bit 0)                                     */
#define SYSCFG_EXTISS3_EXTI12_SS_Msk      (0xfUL)                   /*!< EXTI12_SS (Bitfield-Mask: 0x0f)                       */
/* =========================================================  CFG2  ========================================================== */
#define SYSCFG_CFG2_SRAM_PCEF_Pos         (8UL)                     /*!< SRAM_PCEF (Bit 8)                                     */
#define SYSCFG_CFG2_SRAM_PCEF_Msk         (0x100UL)                 /*!< SRAM_PCEF (Bitfield-Mask: 0x01)                       */
#define SYSCFG_CFG2_LVD_LOCK_Pos          (2UL)                     /*!< LVD_LOCK (Bit 2)                                      */
#define SYSCFG_CFG2_LVD_LOCK_Msk          (0x4UL)                   /*!< LVD_LOCK (Bitfield-Mask: 0x01)                        */
#define SYSCFG_CFG2_SRAM_PARITY_ERROR_LOCK_Pos (1UL)                /*!< SRAM_PARITY_ERROR_LOCK (Bit 1)                        */
#define SYSCFG_CFG2_SRAM_PARITY_ERROR_LOCK_Msk (0x2UL)              /*!< SRAM_PARITY_ERROR_LOCK (Bitfield-Mask: 0x01)          */
#define SYSCFG_CFG2_LOCKUP_LOCK_Pos       (0UL)                     /*!< LOCKUP_LOCK (Bit 0)                                   */
#define SYSCFG_CFG2_LOCKUP_LOCK_Msk       (0x1UL)                   /*!< LOCKUP_LOCK (Bitfield-Mask: 0x01)                     */
/* ========================================================  CPSCTL  ========================================================= */
#define SYSCFG_CPSCTL_CPS_RDY_Pos         (8UL)                     /*!< CPS_RDY (Bit 8)                                       */
#define SYSCFG_CPSCTL_CPS_RDY_Msk         (0x100UL)                 /*!< CPS_RDY (Bitfield-Mask: 0x01)                         */
#define SYSCFG_CPSCTL_CPS_EN_Pos          (0UL)                     /*!< CPS_EN (Bit 0)                                        */
#define SYSCFG_CPSCTL_CPS_EN_Msk          (0x1UL)                   /*!< CPS_EN (Bitfield-Mask: 0x01)                          */


/* =========================================================================================================================== */
/* ================                                          TIMER0                                           ================ */
/* =========================================================================================================================== */

