RIOT-OS/RIOT/cpu/gd32f3x0/include/gd32f3x0_periph.h
/* =========================================================  CTL0  ========================================================== */
#define TIMER13_CTL0_CKDIV_Pos            (8UL)                     /*!< CKDIV (Bit 8)                                         */
#define TIMER13_CTL0_CKDIV_Msk            (0x300UL)                 /*!< CKDIV (Bitfield-Mask: 0x03)                           */
#define TIMER13_CTL0_ARSE_Pos             (7UL)                     /*!< ARSE (Bit 7)                                          */
#define TIMER13_CTL0_ARSE_Msk             (0x80UL)                  /*!< ARSE (Bitfield-Mask: 0x01)                            */
#define TIMER13_CTL0_UPS_Pos              (2UL)                     /*!< UPS (Bit 2)                                           */
#define TIMER13_CTL0_UPS_Msk              (0x4UL)                   /*!< UPS (Bitfield-Mask: 0x01)                             */
#define TIMER13_CTL0_UPDIS_Pos            (1UL)                     /*!< UPDIS (Bit 1)                                         */
#define TIMER13_CTL0_UPDIS_Msk            (0x2UL)                   /*!< UPDIS (Bitfield-Mask: 0x01)                           */
#define TIMER13_CTL0_CEN_Pos              (0UL)                     /*!< CEN (Bit 0)                                           */
#define TIMER13_CTL0_CEN_Msk              (0x1UL)                   /*!< CEN (Bitfield-Mask: 0x01)                             */
/* =======================================================  DMAINTEN  ======================================================== */
#define TIMER13_DMAINTEN_CH0IE_Pos        (1UL)                     /*!< CH0IE (Bit 1)                                         */
#define TIMER13_DMAINTEN_CH0IE_Msk        (0x2UL)                   /*!< CH0IE (Bitfield-Mask: 0x01)                           */
#define TIMER13_DMAINTEN_UPIE_Pos         (0UL)                     /*!< UPIE (Bit 0)                                          */
#define TIMER13_DMAINTEN_UPIE_Msk         (0x1UL)                   /*!< UPIE (Bitfield-Mask: 0x01)                            */
/* =========================================================  INTF  ========================================================== */
#define TIMER13_INTF_CH0OF_Pos            (9UL)                     /*!< CH0OF (Bit 9)                                         */
#define TIMER13_INTF_CH0OF_Msk            (0x200UL)                 /*!< CH0OF (Bitfield-Mask: 0x01)                           */
#define TIMER13_INTF_CH0IF_Pos            (1UL)                     /*!< CH0IF (Bit 1)                                         */
#define TIMER13_INTF_CH0IF_Msk            (0x2UL)                   /*!< CH0IF (Bitfield-Mask: 0x01)                           */
#define TIMER13_INTF_UPIF_Pos             (0UL)                     /*!< UPIF (Bit 0)                                          */
#define TIMER13_INTF_UPIF_Msk             (0x1UL)                   /*!< UPIF (Bitfield-Mask: 0x01)                            */
/* =========================================================  SWEVG  ========================================================= */
#define TIMER13_SWEVG_CH0G_Pos            (1UL)                     /*!< CH0G (Bit 1)                                          */
#define TIMER13_SWEVG_CH0G_Msk            (0x2UL)                   /*!< CH0G (Bitfield-Mask: 0x01)                            */
#define TIMER13_SWEVG_UPG_Pos             (0UL)                     /*!< UPG (Bit 0)                                           */
#define TIMER13_SWEVG_UPG_Msk             (0x1UL)                   /*!< UPG (Bitfield-Mask: 0x01)                             */
/* =====================================================  CHCTL0_Output  ===================================================== */
#define TIMER13_CHCTL0_Output_CH0MS_Pos   (0UL)                     /*!< CH0MS (Bit 0)                                         */
#define TIMER13_CHCTL0_Output_CH0MS_Msk   (0x3UL)                   /*!< CH0MS (Bitfield-Mask: 0x03)                           */
#define TIMER13_CHCTL0_Output_CH0COMFEN_Pos (2UL)                   /*!< CH0COMFEN (Bit 2)                                     */
#define TIMER13_CHCTL0_Output_CH0COMFEN_Msk (0x4UL)                 /*!< CH0COMFEN (Bitfield-Mask: 0x01)                       */
#define TIMER13_CHCTL0_Output_CH0COMSEN_Pos (3UL)                   /*!< CH0COMSEN (Bit 3)                                     */
#define TIMER13_CHCTL0_Output_CH0COMSEN_Msk (0x8UL)                 /*!< CH0COMSEN (Bitfield-Mask: 0x01)                       */
#define TIMER13_CHCTL0_Output_CH0COMCTL_Pos (4UL)                   /*!< CH0COMCTL (Bit 4)                                     */
#define TIMER13_CHCTL0_Output_CH0COMCTL_Msk (0x70UL)                /*!< CH0COMCTL (Bitfield-Mask: 0x07)                       */
/* =====================================================  CHCTL0_Input  ====================================================== */
#define TIMER13_CHCTL0_Input_CH0CAPFLT_Pos (4UL)                    /*!< CH0CAPFLT (Bit 4)                                     */
#define TIMER13_CHCTL0_Input_CH0CAPFLT_Msk (0xf0UL)                 /*!< CH0CAPFLT (Bitfield-Mask: 0x0f)                       */
#define TIMER13_CHCTL0_Input_CH0CAPPSC_Pos (2UL)                    /*!< CH0CAPPSC (Bit 2)                                     */
#define TIMER13_CHCTL0_Input_CH0CAPPSC_Msk (0xcUL)                  /*!< CH0CAPPSC (Bitfield-Mask: 0x03)                       */
#define TIMER13_CHCTL0_Input_CH0MS_Pos    (0UL)                     /*!< CH0MS (Bit 0)                                         */
#define TIMER13_CHCTL0_Input_CH0MS_Msk    (0x3UL)                   /*!< CH0MS (Bitfield-Mask: 0x03)                           */
/* ========================================================  CHCTL2  ========================================================= */
#define TIMER13_CHCTL2_CH0NP_Pos          (3UL)                     /*!< CH0NP (Bit 3)                                         */
#define TIMER13_CHCTL2_CH0NP_Msk          (0x8UL)                   /*!< CH0NP (Bitfield-Mask: 0x01)                           */
#define TIMER13_CHCTL2_CH0P_Pos           (1UL)                     /*!< CH0P (Bit 1)                                          */
#define TIMER13_CHCTL2_CH0P_Msk           (0x2UL)                   /*!< CH0P (Bitfield-Mask: 0x01)                            */
#define TIMER13_CHCTL2_CH0EN_Pos          (0UL)                     /*!< CH0EN (Bit 0)                                         */
#define TIMER13_CHCTL2_CH0EN_Msk          (0x1UL)                   /*!< CH0EN (Bitfield-Mask: 0x01)                           */
/* ==========================================================  CNT  ========================================================== */
#define TIMER13_CNT_CNT_Pos               (0UL)                     /*!< CNT (Bit 0)                                           */
#define TIMER13_CNT_CNT_Msk               (0xffffUL)                /*!< CNT (Bitfield-Mask: 0xffff)                           */
/* ==========================================================  PSC  ========================================================== */
#define TIMER13_PSC_PSC_Pos               (0UL)                     /*!< PSC (Bit 0)                                           */
#define TIMER13_PSC_PSC_Msk               (0xffffUL)                /*!< PSC (Bitfield-Mask: 0xffff)                           */
/* ==========================================================  CAR  ========================================================== */
#define TIMER13_CAR_CARL_Pos              (0UL)                     /*!< CARL (Bit 0)                                          */
#define TIMER13_CAR_CARL_Msk              (0xffffUL)                /*!< CARL (Bitfield-Mask: 0xffff)                          */
/* =========================================================  CH0CV  ========================================================= */
#define TIMER13_CH0CV_CH0VAL_Pos          (0UL)                     /*!< CH0VAL (Bit 0)                                        */
#define TIMER13_CH0CV_CH0VAL_Msk          (0xffffUL)                /*!< CH0VAL (Bitfield-Mask: 0xffff)                        */
/* =========================================================  IRMP  ========================================================== */
#define TIMER13_IRMP_CI0_RMP_Pos          (0UL)                     /*!< CI0_RMP (Bit 0)                                       */
#define TIMER13_IRMP_CI0_RMP_Msk          (0x3UL)                   /*!< CI0_RMP (Bitfield-Mask: 0x03)                         */
/* ==========================================================  CFG  ========================================================== */
#define TIMER13_CFG_CHVSEL_Pos            (1UL)                     /*!< CHVSEL (Bit 1)                                        */
#define TIMER13_CFG_CHVSEL_Msk            (0x2UL)                   /*!< CHVSEL (Bitfield-Mask: 0x01)                          */


/* =========================================================================================================================== */
/* ================                                          TIMER14                                          ================ */
/* =========================================================================================================================== */

