RIOT-OS/RIOT/cpu/gd32f3x0/include/gd32f3x0_periph.h
/* =========================================================  CTL0  ========================================================== */
#define TSI_CTL0_CDT_Pos                  (28UL)                    /*!< CDT (Bit 28)                                          */
#define TSI_CTL0_CDT_Msk                  (0xf0000000UL)            /*!< CDT (Bitfield-Mask: 0x0f)                             */
#define TSI_CTL0_CTDT_Pos                 (24UL)                    /*!< CTDT (Bit 24)                                         */
#define TSI_CTL0_CTDT_Msk                 (0xf000000UL)             /*!< CTDT (Bitfield-Mask: 0x0f)                            */
#define TSI_CTL0_ECDT_Pos                 (17UL)                    /*!< ECDT (Bit 17)                                         */
#define TSI_CTL0_ECDT_Msk                 (0xfe0000UL)              /*!< ECDT (Bitfield-Mask: 0x7f)                            */
#define TSI_CTL0_ECEN_Pos                 (16UL)                    /*!< ECEN (Bit 16)                                         */
#define TSI_CTL0_ECEN_Msk                 (0x10000UL)               /*!< ECEN (Bitfield-Mask: 0x01)                            */
#define TSI_CTL0_ECDIV_Pos                (15UL)                    /*!< ECDIV (Bit 15)                                        */
#define TSI_CTL0_ECDIV_Msk                (0x8000UL)                /*!< ECDIV (Bitfield-Mask: 0x01)                           */
#define TSI_CTL0_CTCDIV_Pos               (12UL)                    /*!< CTCDIV (Bit 12)                                       */
#define TSI_CTL0_CTCDIV_Msk               (0x7000UL)                /*!< CTCDIV (Bitfield-Mask: 0x07)                          */
#define TSI_CTL0_MCN_Pos                  (5UL)                     /*!< MCN (Bit 5)                                           */
#define TSI_CTL0_MCN_Msk                  (0xe0UL)                  /*!< MCN (Bitfield-Mask: 0x07)                             */
#define TSI_CTL0_PINMOD_Pos               (4UL)                     /*!< PINMOD (Bit 4)                                        */
#define TSI_CTL0_PINMOD_Msk               (0x10UL)                  /*!< PINMOD (Bitfield-Mask: 0x01)                          */
#define TSI_CTL0_EGSEL_Pos                (3UL)                     /*!< EGSEL (Bit 3)                                         */
#define TSI_CTL0_EGSEL_Msk                (0x8UL)                   /*!< EGSEL (Bitfield-Mask: 0x01)                           */
#define TSI_CTL0_TRGMOD_Pos               (2UL)                     /*!< TRGMOD (Bit 2)                                        */
#define TSI_CTL0_TRGMOD_Msk               (0x4UL)                   /*!< TRGMOD (Bitfield-Mask: 0x01)                          */
#define TSI_CTL0_TSIS_Pos                 (1UL)                     /*!< TSIS (Bit 1)                                          */
#define TSI_CTL0_TSIS_Msk                 (0x2UL)                   /*!< TSIS (Bitfield-Mask: 0x01)                            */
#define TSI_CTL0_TSIEN_Pos                (0UL)                     /*!< TSIEN (Bit 0)                                         */
#define TSI_CTL0_TSIEN_Msk                (0x1UL)                   /*!< TSIEN (Bitfield-Mask: 0x01)                           */
/* =========================================================  INTEN  ========================================================= */
#define TSI_INTEN_MNERRIE_Pos             (1UL)                     /*!< MNERRIE (Bit 1)                                       */
#define TSI_INTEN_MNERRIE_Msk             (0x2UL)                   /*!< MNERRIE (Bitfield-Mask: 0x01)                         */
#define TSI_INTEN_CTCFIE_Pos              (0UL)                     /*!< CTCFIE (Bit 0)                                        */
#define TSI_INTEN_CTCFIE_Msk              (0x1UL)                   /*!< CTCFIE (Bitfield-Mask: 0x01)                          */
/* =========================================================  INTC  ========================================================== */
#define TSI_INTC_CMNERR_Pos               (1UL)                     /*!< CMNERR (Bit 1)                                        */
#define TSI_INTC_CMNERR_Msk               (0x2UL)                   /*!< CMNERR (Bitfield-Mask: 0x01)                          */
#define TSI_INTC_CCTCF_Pos                (0UL)                     /*!< CCTCF (Bit 0)                                         */
#define TSI_INTC_CCTCF_Msk                (0x1UL)                   /*!< CCTCF (Bitfield-Mask: 0x01)                           */
/* =========================================================  INTF  ========================================================== */
#define TSI_INTF_MNERR_Pos                (1UL)                     /*!< MNERR (Bit 1)                                         */
#define TSI_INTF_MNERR_Msk                (0x2UL)                   /*!< MNERR (Bitfield-Mask: 0x01)                           */
#define TSI_INTF_CTCF_Pos                 (0UL)                     /*!< CTCF (Bit 0)                                          */
#define TSI_INTF_CTCF_Msk                 (0x1UL)                   /*!< CTCF (Bitfield-Mask: 0x01)                            */
/* ==========================================================  PHM  ========================================================== */
#define TSI_PHM_G5P3_Pos                  (23UL)                    /*!< G5P3 (Bit 23)                                         */
#define TSI_PHM_G5P3_Msk                  (0x800000UL)              /*!< G5P3 (Bitfield-Mask: 0x01)                            */
#define TSI_PHM_G5P2_Pos                  (22UL)                    /*!< G5P2 (Bit 22)                                         */
#define TSI_PHM_G5P2_Msk                  (0x400000UL)              /*!< G5P2 (Bitfield-Mask: 0x01)                            */
#define TSI_PHM_G5P1_Pos                  (21UL)                    /*!< G5P1 (Bit 21)                                         */
#define TSI_PHM_G5P1_Msk                  (0x200000UL)              /*!< G5P1 (Bitfield-Mask: 0x01)                            */
#define TSI_PHM_G5P0_Pos                  (20UL)                    /*!< G5P0 (Bit 20)                                         */
#define TSI_PHM_G5P0_Msk                  (0x100000UL)              /*!< G5P0 (Bitfield-Mask: 0x01)                            */
#define TSI_PHM_G4P3_Pos                  (19UL)                    /*!< G4P3 (Bit 19)                                         */
#define TSI_PHM_G4P3_Msk                  (0x80000UL)               /*!< G4P3 (Bitfield-Mask: 0x01)                            */
#define TSI_PHM_G4P2_Pos                  (18UL)                    /*!< G4P2 (Bit 18)                                         */
#define TSI_PHM_G4P2_Msk                  (0x40000UL)               /*!< G4P2 (Bitfield-Mask: 0x01)                            */
#define TSI_PHM_G4P1_Pos                  (17UL)                    /*!< G4P1 (Bit 17)                                         */
#define TSI_PHM_G4P1_Msk                  (0x20000UL)               /*!< G4P1 (Bitfield-Mask: 0x01)                            */
#define TSI_PHM_G4P0_Pos                  (16UL)                    /*!< G4P0 (Bit 16)                                         */
#define TSI_PHM_G4P0_Msk                  (0x10000UL)               /*!< G4P0 (Bitfield-Mask: 0x01)                            */
#define TSI_PHM_G3P3_Pos                  (15UL)                    /*!< G3P3 (Bit 15)                                         */
#define TSI_PHM_G3P3_Msk                  (0x8000UL)                /*!< G3P3 (Bitfield-Mask: 0x01)                            */
#define TSI_PHM_G3P2_Pos                  (14UL)                    /*!< G3P2 (Bit 14)                                         */
#define TSI_PHM_G3P2_Msk                  (0x4000UL)                /*!< G3P2 (Bitfield-Mask: 0x01)                            */
#define TSI_PHM_G3P1_Pos                  (13UL)                    /*!< G3P1 (Bit 13)                                         */
#define TSI_PHM_G3P1_Msk                  (0x2000UL)                /*!< G3P1 (Bitfield-Mask: 0x01)                            */
#define TSI_PHM_G3P0_Pos                  (12UL)                    /*!< G3P0 (Bit 12)                                         */
#define TSI_PHM_G3P0_Msk                  (0x1000UL)                /*!< G3P0 (Bitfield-Mask: 0x01)                            */
#define TSI_PHM_G2P3_Pos                  (11UL)                    /*!< G2P3 (Bit 11)                                         */
#define TSI_PHM_G2P3_Msk                  (0x800UL)                 /*!< G2P3 (Bitfield-Mask: 0x01)                            */
#define TSI_PHM_G2P2_Pos                  (10UL)                    /*!< G2P2 (Bit 10)                                         */
#define TSI_PHM_G2P2_Msk                  (0x400UL)                 /*!< G2P2 (Bitfield-Mask: 0x01)                            */
#define TSI_PHM_G2P1_Pos                  (9UL)                     /*!< G2P1 (Bit 9)                                          */
#define TSI_PHM_G2P1_Msk                  (0x200UL)                 /*!< G2P1 (Bitfield-Mask: 0x01)                            */
#define TSI_PHM_G2P0_Pos                  (8UL)                     /*!< G2P0 (Bit 8)                                          */
#define TSI_PHM_G2P0_Msk                  (0x100UL)                 /*!< G2P0 (Bitfield-Mask: 0x01)                            */
#define TSI_PHM_G1P3_Pos                  (7UL)                     /*!< G1P3 (Bit 7)                                          */
#define TSI_PHM_G1P3_Msk                  (0x80UL)                  /*!< G1P3 (Bitfield-Mask: 0x01)                            */
#define TSI_PHM_G1P2_Pos                  (6UL)                     /*!< G1P2 (Bit 6)                                          */
#define TSI_PHM_G1P2_Msk                  (0x40UL)                  /*!< G1P2 (Bitfield-Mask: 0x01)                            */
#define TSI_PHM_G1P1_Pos                  (5UL)                     /*!< G1P1 (Bit 5)                                          */
#define TSI_PHM_G1P1_Msk                  (0x20UL)                  /*!< G1P1 (Bitfield-Mask: 0x01)                            */
#define TSI_PHM_G1P0_Pos                  (4UL)                     /*!< G1P0 (Bit 4)                                          */
#define TSI_PHM_G1P0_Msk                  (0x10UL)                  /*!< G1P0 (Bitfield-Mask: 0x01)                            */
#define TSI_PHM_G0P3_Pos                  (3UL)                     /*!< G0P3 (Bit 3)                                          */
#define TSI_PHM_G0P3_Msk                  (0x8UL)                   /*!< G0P3 (Bitfield-Mask: 0x01)                            */
#define TSI_PHM_G0P2_Pos                  (2UL)                     /*!< G0P2 (Bit 2)                                          */
#define TSI_PHM_G0P2_Msk                  (0x4UL)                   /*!< G0P2 (Bitfield-Mask: 0x01)                            */
#define TSI_PHM_G0P1_Pos                  (1UL)                     /*!< G0P1 (Bit 1)                                          */
#define TSI_PHM_G0P1_Msk                  (0x2UL)                   /*!< G0P1 (Bitfield-Mask: 0x01)                            */
#define TSI_PHM_G0P0_Pos                  (0UL)                     /*!< G0P0 (Bit 0)                                          */
#define TSI_PHM_G0P0_Msk                  (0x1UL)                   /*!< G0P0 (Bitfield-Mask: 0x01)                            */
/* ==========================================================  ASW  ========================================================== */
#define TSI_ASW_G5P3_Pos                  (23UL)                    /*!< G5P3 (Bit 23)                                         */
#define TSI_ASW_G5P3_Msk                  (0x800000UL)              /*!< G5P3 (Bitfield-Mask: 0x01)                            */
#define TSI_ASW_G5P2_Pos                  (22UL)                    /*!< G5P2 (Bit 22)                                         */
#define TSI_ASW_G5P2_Msk                  (0x400000UL)              /*!< G5P2 (Bitfield-Mask: 0x01)                            */
#define TSI_ASW_G5P1_Pos                  (21UL)                    /*!< G5P1 (Bit 21)                                         */
#define TSI_ASW_G5P1_Msk                  (0x200000UL)              /*!< G5P1 (Bitfield-Mask: 0x01)                            */
#define TSI_ASW_G5P0_Pos                  (20UL)                    /*!< G5P0 (Bit 20)                                         */
#define TSI_ASW_G5P0_Msk                  (0x100000UL)              /*!< G5P0 (Bitfield-Mask: 0x01)                            */
#define TSI_ASW_G4P3_Pos                  (19UL)                    /*!< G4P3 (Bit 19)                                         */
#define TSI_ASW_G4P3_Msk                  (0x80000UL)               /*!< G4P3 (Bitfield-Mask: 0x01)                            */
#define TSI_ASW_G4P2_Pos                  (18UL)                    /*!< G4P2 (Bit 18)                                         */
#define TSI_ASW_G4P2_Msk                  (0x40000UL)               /*!< G4P2 (Bitfield-Mask: 0x01)                            */
#define TSI_ASW_G4P1_Pos                  (17UL)                    /*!< G4P1 (Bit 17)                                         */
#define TSI_ASW_G4P1_Msk                  (0x20000UL)               /*!< G4P1 (Bitfield-Mask: 0x01)                            */
#define TSI_ASW_G4P0_Pos                  (16UL)                    /*!< G4P0 (Bit 16)                                         */
#define TSI_ASW_G4P0_Msk                  (0x10000UL)               /*!< G4P0 (Bitfield-Mask: 0x01)                            */
#define TSI_ASW_G3P3_Pos                  (15UL)                    /*!< G3P3 (Bit 15)                                         */
#define TSI_ASW_G3P3_Msk                  (0x8000UL)                /*!< G3P3 (Bitfield-Mask: 0x01)                            */
#define TSI_ASW_G3P2_Pos                  (14UL)                    /*!< G3P2 (Bit 14)                                         */
#define TSI_ASW_G3P2_Msk                  (0x4000UL)                /*!< G3P2 (Bitfield-Mask: 0x01)                            */
#define TSI_ASW_G3P1_Pos                  (13UL)                    /*!< G3P1 (Bit 13)                                         */
#define TSI_ASW_G3P1_Msk                  (0x2000UL)                /*!< G3P1 (Bitfield-Mask: 0x01)                            */
#define TSI_ASW_G3P0_Pos                  (12UL)                    /*!< G3P0 (Bit 12)                                         */
#define TSI_ASW_G3P0_Msk                  (0x1000UL)                /*!< G3P0 (Bitfield-Mask: 0x01)                            */
#define TSI_ASW_G2P3_Pos                  (11UL)                    /*!< G2P3 (Bit 11)                                         */
#define TSI_ASW_G2P3_Msk                  (0x800UL)                 /*!< G2P3 (Bitfield-Mask: 0x01)                            */
#define TSI_ASW_G2P2_Pos                  (10UL)                    /*!< G2P2 (Bit 10)                                         */
#define TSI_ASW_G2P2_Msk                  (0x400UL)                 /*!< G2P2 (Bitfield-Mask: 0x01)                            */
#define TSI_ASW_G2P1_Pos                  (9UL)                     /*!< G2P1 (Bit 9)                                          */
#define TSI_ASW_G2P1_Msk                  (0x200UL)                 /*!< G2P1 (Bitfield-Mask: 0x01)                            */
#define TSI_ASW_G2P0_Pos                  (8UL)                     /*!< G2P0 (Bit 8)                                          */
#define TSI_ASW_G2P0_Msk                  (0x100UL)                 /*!< G2P0 (Bitfield-Mask: 0x01)                            */
#define TSI_ASW_G1P3_Pos                  (7UL)                     /*!< G1P3 (Bit 7)                                          */
#define TSI_ASW_G1P3_Msk                  (0x80UL)                  /*!< G1P3 (Bitfield-Mask: 0x01)                            */
#define TSI_ASW_G1P2_Pos                  (6UL)                     /*!< G1P2 (Bit 6)                                          */
#define TSI_ASW_G1P2_Msk                  (0x40UL)                  /*!< G1P2 (Bitfield-Mask: 0x01)                            */
#define TSI_ASW_G1P1_Pos                  (5UL)                     /*!< G1P1 (Bit 5)                                          */
#define TSI_ASW_G1P1_Msk                  (0x20UL)                  /*!< G1P1 (Bitfield-Mask: 0x01)                            */
#define TSI_ASW_G1P0_Pos                  (4UL)                     /*!< G1P0 (Bit 4)                                          */
#define TSI_ASW_G1P0_Msk                  (0x10UL)                  /*!< G1P0 (Bitfield-Mask: 0x01)                            */
#define TSI_ASW_G0P3_Pos                  (3UL)                     /*!< G0P3 (Bit 3)                                          */
#define TSI_ASW_G0P3_Msk                  (0x8UL)                   /*!< G0P3 (Bitfield-Mask: 0x01)                            */
#define TSI_ASW_G0P2_Pos                  (2UL)                     /*!< G0P2 (Bit 2)                                          */
#define TSI_ASW_G0P2_Msk                  (0x4UL)                   /*!< G0P2 (Bitfield-Mask: 0x01)                            */
#define TSI_ASW_G0P1_Pos                  (1UL)                     /*!< G0P1 (Bit 1)                                          */
#define TSI_ASW_G0P1_Msk                  (0x2UL)                   /*!< G0P1 (Bitfield-Mask: 0x01)                            */
#define TSI_ASW_G0P0_Pos                  (0UL)                     /*!< G0P0 (Bit 0)                                          */
#define TSI_ASW_G0P0_Msk                  (0x1UL)                   /*!< G0P0 (Bitfield-Mask: 0x01)                            */
/* ========================================================  SAMPCFG  ======================================================== */
#define TSI_SAMPCFG_G5P3_Pos              (23UL)                    /*!< G5P3 (Bit 23)                                         */
#define TSI_SAMPCFG_G5P3_Msk              (0x800000UL)              /*!< G5P3 (Bitfield-Mask: 0x01)                            */
#define TSI_SAMPCFG_G5P2_Pos              (22UL)                    /*!< G5P2 (Bit 22)                                         */
#define TSI_SAMPCFG_G5P2_Msk              (0x400000UL)              /*!< G5P2 (Bitfield-Mask: 0x01)                            */
#define TSI_SAMPCFG_G5P1_Pos              (21UL)                    /*!< G5P1 (Bit 21)                                         */
#define TSI_SAMPCFG_G5P1_Msk              (0x200000UL)              /*!< G5P1 (Bitfield-Mask: 0x01)                            */
#define TSI_SAMPCFG_G5P0_Pos              (20UL)                    /*!< G5P0 (Bit 20)                                         */
#define TSI_SAMPCFG_G5P0_Msk              (0x100000UL)              /*!< G5P0 (Bitfield-Mask: 0x01)                            */
#define TSI_SAMPCFG_G4P3_Pos              (19UL)                    /*!< G4P3 (Bit 19)                                         */
#define TSI_SAMPCFG_G4P3_Msk              (0x80000UL)               /*!< G4P3 (Bitfield-Mask: 0x01)                            */
#define TSI_SAMPCFG_G4P2_Pos              (18UL)                    /*!< G4P2 (Bit 18)                                         */
#define TSI_SAMPCFG_G4P2_Msk              (0x40000UL)               /*!< G4P2 (Bitfield-Mask: 0x01)                            */
#define TSI_SAMPCFG_G4P1_Pos              (17UL)                    /*!< G4P1 (Bit 17)                                         */
#define TSI_SAMPCFG_G4P1_Msk              (0x20000UL)               /*!< G4P1 (Bitfield-Mask: 0x01)                            */
#define TSI_SAMPCFG_G4P0_Pos              (16UL)                    /*!< G4P0 (Bit 16)                                         */
#define TSI_SAMPCFG_G4P0_Msk              (0x10000UL)               /*!< G4P0 (Bitfield-Mask: 0x01)                            */
#define TSI_SAMPCFG_G3P3_Pos              (15UL)                    /*!< G3P3 (Bit 15)                                         */
#define TSI_SAMPCFG_G3P3_Msk              (0x8000UL)                /*!< G3P3 (Bitfield-Mask: 0x01)                            */
#define TSI_SAMPCFG_G3P2_Pos              (14UL)                    /*!< G3P2 (Bit 14)                                         */
#define TSI_SAMPCFG_G3P2_Msk              (0x4000UL)                /*!< G3P2 (Bitfield-Mask: 0x01)                            */
#define TSI_SAMPCFG_G3P1_Pos              (13UL)                    /*!< G3P1 (Bit 13)                                         */
#define TSI_SAMPCFG_G3P1_Msk              (0x2000UL)                /*!< G3P1 (Bitfield-Mask: 0x01)                            */
#define TSI_SAMPCFG_G3P0_Pos              (12UL)                    /*!< G3P0 (Bit 12)                                         */
#define TSI_SAMPCFG_G3P0_Msk              (0x1000UL)                /*!< G3P0 (Bitfield-Mask: 0x01)                            */
#define TSI_SAMPCFG_G2P3_Pos              (11UL)                    /*!< G2P3 (Bit 11)                                         */
#define TSI_SAMPCFG_G2P3_Msk              (0x800UL)                 /*!< G2P3 (Bitfield-Mask: 0x01)                            */
#define TSI_SAMPCFG_G2P2_Pos              (10UL)                    /*!< G2P2 (Bit 10)                                         */
#define TSI_SAMPCFG_G2P2_Msk              (0x400UL)                 /*!< G2P2 (Bitfield-Mask: 0x01)                            */
#define TSI_SAMPCFG_G2P1_Pos              (9UL)                     /*!< G2P1 (Bit 9)                                          */
#define TSI_SAMPCFG_G2P1_Msk              (0x200UL)                 /*!< G2P1 (Bitfield-Mask: 0x01)                            */
#define TSI_SAMPCFG_G2P0_Pos              (8UL)                     /*!< G2P0 (Bit 8)                                          */
#define TSI_SAMPCFG_G2P0_Msk              (0x100UL)                 /*!< G2P0 (Bitfield-Mask: 0x01)                            */
#define TSI_SAMPCFG_G1P3_Pos              (7UL)                     /*!< G1P3 (Bit 7)                                          */
#define TSI_SAMPCFG_G1P3_Msk              (0x80UL)                  /*!< G1P3 (Bitfield-Mask: 0x01)                            */
#define TSI_SAMPCFG_G1P2_Pos              (6UL)                     /*!< G1P2 (Bit 6)                                          */
#define TSI_SAMPCFG_G1P2_Msk              (0x40UL)                  /*!< G1P2 (Bitfield-Mask: 0x01)                            */
#define TSI_SAMPCFG_G1P1_Pos              (5UL)                     /*!< G1P1 (Bit 5)                                          */
#define TSI_SAMPCFG_G1P1_Msk              (0x20UL)                  /*!< G1P1 (Bitfield-Mask: 0x01)                            */
#define TSI_SAMPCFG_G1P0_Pos              (4UL)                     /*!< G1P0 (Bit 4)                                          */
#define TSI_SAMPCFG_G1P0_Msk              (0x10UL)                  /*!< G1P0 (Bitfield-Mask: 0x01)                            */
#define TSI_SAMPCFG_G0P3_Pos              (3UL)                     /*!< G0P3 (Bit 3)                                          */
#define TSI_SAMPCFG_G0P3_Msk              (0x8UL)                   /*!< G0P3 (Bitfield-Mask: 0x01)                            */
#define TSI_SAMPCFG_G0P2_Pos              (2UL)                     /*!< G0P2 (Bit 2)                                          */
#define TSI_SAMPCFG_G0P2_Msk              (0x4UL)                   /*!< G0P2 (Bitfield-Mask: 0x01)                            */
#define TSI_SAMPCFG_G0P1_Pos              (1UL)                     /*!< G0P1 (Bit 1)                                          */
