RIOT-OS/RIOT/cpu/gd32f3x0/include/gd32f3x0_periph.h
#define TSI_SAMPCFG_G0P1_Msk              (0x2UL)                   /*!< G0P1 (Bitfield-Mask: 0x01)                            */
#define TSI_SAMPCFG_G0P0_Pos              (0UL)                     /*!< G0P0 (Bit 0)                                          */
#define TSI_SAMPCFG_G0P0_Msk              (0x1UL)                   /*!< G0P0 (Bitfield-Mask: 0x01)                            */
/* =========================================================  CHCFG  ========================================================= */
#define TSI_CHCFG_G5P3_Pos                (23UL)                    /*!< G5P3 (Bit 23)                                         */
#define TSI_CHCFG_G5P3_Msk                (0x800000UL)              /*!< G5P3 (Bitfield-Mask: 0x01)                            */
#define TSI_CHCFG_G5P2_Pos                (22UL)                    /*!< G5P2 (Bit 22)                                         */
#define TSI_CHCFG_G5P2_Msk                (0x400000UL)              /*!< G5P2 (Bitfield-Mask: 0x01)                            */
#define TSI_CHCFG_G5P1_Pos                (21UL)                    /*!< G5P1 (Bit 21)                                         */
#define TSI_CHCFG_G5P1_Msk                (0x200000UL)              /*!< G5P1 (Bitfield-Mask: 0x01)                            */
#define TSI_CHCFG_G5P0_Pos                (20UL)                    /*!< G5P0 (Bit 20)                                         */
#define TSI_CHCFG_G5P0_Msk                (0x100000UL)              /*!< G5P0 (Bitfield-Mask: 0x01)                            */
#define TSI_CHCFG_G4P3_Pos                (19UL)                    /*!< G4P3 (Bit 19)                                         */
#define TSI_CHCFG_G4P3_Msk                (0x80000UL)               /*!< G4P3 (Bitfield-Mask: 0x01)                            */
#define TSI_CHCFG_G4P2_Pos                (18UL)                    /*!< G4P2 (Bit 18)                                         */
#define TSI_CHCFG_G4P2_Msk                (0x40000UL)               /*!< G4P2 (Bitfield-Mask: 0x01)                            */
#define TSI_CHCFG_G4P1_Pos                (17UL)                    /*!< G4P1 (Bit 17)                                         */
#define TSI_CHCFG_G4P1_Msk                (0x20000UL)               /*!< G4P1 (Bitfield-Mask: 0x01)                            */
#define TSI_CHCFG_G4P0_Pos                (16UL)                    /*!< G4P0 (Bit 16)                                         */
#define TSI_CHCFG_G4P0_Msk                (0x10000UL)               /*!< G4P0 (Bitfield-Mask: 0x01)                            */
#define TSI_CHCFG_G3P3_Pos                (15UL)                    /*!< G3P3 (Bit 15)                                         */
#define TSI_CHCFG_G3P3_Msk                (0x8000UL)                /*!< G3P3 (Bitfield-Mask: 0x01)                            */
#define TSI_CHCFG_G3P2_Pos                (14UL)                    /*!< G3P2 (Bit 14)                                         */
#define TSI_CHCFG_G3P2_Msk                (0x4000UL)                /*!< G3P2 (Bitfield-Mask: 0x01)                            */
#define TSI_CHCFG_G3P1_Pos                (13UL)                    /*!< G3P1 (Bit 13)                                         */
#define TSI_CHCFG_G3P1_Msk                (0x2000UL)                /*!< G3P1 (Bitfield-Mask: 0x01)                            */
#define TSI_CHCFG_G3P0_Pos                (12UL)                    /*!< G3P0 (Bit 12)                                         */
#define TSI_CHCFG_G3P0_Msk                (0x1000UL)                /*!< G3P0 (Bitfield-Mask: 0x01)                            */
#define TSI_CHCFG_G2P3_Pos                (11UL)                    /*!< G2P3 (Bit 11)                                         */
#define TSI_CHCFG_G2P3_Msk                (0x800UL)                 /*!< G2P3 (Bitfield-Mask: 0x01)                            */
#define TSI_CHCFG_G2P2_Pos                (10UL)                    /*!< G2P2 (Bit 10)                                         */
#define TSI_CHCFG_G2P2_Msk                (0x400UL)                 /*!< G2P2 (Bitfield-Mask: 0x01)                            */
#define TSI_CHCFG_G2P1_Pos                (9UL)                     /*!< G2P1 (Bit 9)                                          */
#define TSI_CHCFG_G2P1_Msk                (0x200UL)                 /*!< G2P1 (Bitfield-Mask: 0x01)                            */
#define TSI_CHCFG_G2P0_Pos                (8UL)                     /*!< G2P0 (Bit 8)                                          */
#define TSI_CHCFG_G2P0_Msk                (0x100UL)                 /*!< G2P0 (Bitfield-Mask: 0x01)                            */
#define TSI_CHCFG_G1P3_Pos                (7UL)                     /*!< G1P3 (Bit 7)                                          */
#define TSI_CHCFG_G1P3_Msk                (0x80UL)                  /*!< G1P3 (Bitfield-Mask: 0x01)                            */
#define TSI_CHCFG_G1P2_Pos                (6UL)                     /*!< G1P2 (Bit 6)                                          */
#define TSI_CHCFG_G1P2_Msk                (0x40UL)                  /*!< G1P2 (Bitfield-Mask: 0x01)                            */
#define TSI_CHCFG_G1P1_Pos                (5UL)                     /*!< G1P1 (Bit 5)                                          */
#define TSI_CHCFG_G1P1_Msk                (0x20UL)                  /*!< G1P1 (Bitfield-Mask: 0x01)                            */
#define TSI_CHCFG_G1P0_Pos                (4UL)                     /*!< G1P0 (Bit 4)                                          */
#define TSI_CHCFG_G1P0_Msk                (0x10UL)                  /*!< G1P0 (Bitfield-Mask: 0x01)                            */
#define TSI_CHCFG_G0P3_Pos                (3UL)                     /*!< G0P3 (Bit 3)                                          */
#define TSI_CHCFG_G0P3_Msk                (0x8UL)                   /*!< G0P3 (Bitfield-Mask: 0x01)                            */
#define TSI_CHCFG_G0P2_Pos                (2UL)                     /*!< G0P2 (Bit 2)                                          */
#define TSI_CHCFG_G0P2_Msk                (0x4UL)                   /*!< G0P2 (Bitfield-Mask: 0x01)                            */
#define TSI_CHCFG_G0P1_Pos                (1UL)                     /*!< G0P1 (Bit 1)                                          */
#define TSI_CHCFG_G0P1_Msk                (0x2UL)                   /*!< G0P1 (Bitfield-Mask: 0x01)                            */
#define TSI_CHCFG_G0P0_Pos                (0UL)                     /*!< G0P0 (Bit 0)                                          */
#define TSI_CHCFG_G0P0_Msk                (0x1UL)                   /*!< G0P0 (Bitfield-Mask: 0x01)                            */
/* =========================================================  GCTL  ========================================================== */
#define TSI_GCTL_GC5_Pos                  (21UL)                    /*!< GC5 (Bit 21)                                          */
#define TSI_GCTL_GC5_Msk                  (0x200000UL)              /*!< GC5 (Bitfield-Mask: 0x01)                             */
#define TSI_GCTL_GC4_Pos                  (20UL)                    /*!< GC4 (Bit 20)                                          */
#define TSI_GCTL_GC4_Msk                  (0x100000UL)              /*!< GC4 (Bitfield-Mask: 0x01)                             */
#define TSI_GCTL_GC3_Pos                  (19UL)                    /*!< GC3 (Bit 19)                                          */
#define TSI_GCTL_GC3_Msk                  (0x80000UL)               /*!< GC3 (Bitfield-Mask: 0x01)                             */
#define TSI_GCTL_GC2_Pos                  (18UL)                    /*!< GC2 (Bit 18)                                          */
#define TSI_GCTL_GC2_Msk                  (0x40000UL)               /*!< GC2 (Bitfield-Mask: 0x01)                             */
#define TSI_GCTL_GC1_Pos                  (17UL)                    /*!< GC1 (Bit 17)                                          */
#define TSI_GCTL_GC1_Msk                  (0x20000UL)               /*!< GC1 (Bitfield-Mask: 0x01)                             */
#define TSI_GCTL_GC0_Pos                  (16UL)                    /*!< GC0 (Bit 16)                                          */
#define TSI_GCTL_GC0_Msk                  (0x10000UL)               /*!< GC0 (Bitfield-Mask: 0x01)                             */
#define TSI_GCTL_GE5_Pos                  (5UL)                     /*!< GE5 (Bit 5)                                           */
#define TSI_GCTL_GE5_Msk                  (0x20UL)                  /*!< GE5 (Bitfield-Mask: 0x01)                             */
#define TSI_GCTL_GE4_Pos                  (4UL)                     /*!< GE4 (Bit 4)                                           */
#define TSI_GCTL_GE4_Msk                  (0x10UL)                  /*!< GE4 (Bitfield-Mask: 0x01)                             */
#define TSI_GCTL_GE3_Pos                  (3UL)                     /*!< GE3 (Bit 3)                                           */
#define TSI_GCTL_GE3_Msk                  (0x8UL)                   /*!< GE3 (Bitfield-Mask: 0x01)                             */
#define TSI_GCTL_GE2_Pos                  (2UL)                     /*!< GE2 (Bit 2)                                           */
#define TSI_GCTL_GE2_Msk                  (0x4UL)                   /*!< GE2 (Bitfield-Mask: 0x01)                             */
#define TSI_GCTL_GE1_Pos                  (1UL)                     /*!< GE1 (Bit 1)                                           */
#define TSI_GCTL_GE1_Msk                  (0x2UL)                   /*!< GE1 (Bitfield-Mask: 0x01)                             */
#define TSI_GCTL_GE0_Pos                  (0UL)                     /*!< GE0 (Bit 0)                                           */
#define TSI_GCTL_GE0_Msk                  (0x1UL)                   /*!< GE0 (Bitfield-Mask: 0x01)                             */
/* ========================================================  G0CYCN  ========================================================= */
#define TSI_G0CYCN_CYCN_Pos               (0UL)                     /*!< CYCN (Bit 0)                                          */
#define TSI_G0CYCN_CYCN_Msk               (0x3fffUL)                /*!< CYCN (Bitfield-Mask: 0x3fff)                          */
/* ========================================================  G1CYCN  ========================================================= */
#define TSI_G1CYCN_CYCN_Pos               (0UL)                     /*!< CYCN (Bit 0)                                          */
#define TSI_G1CYCN_CYCN_Msk               (0x3fffUL)                /*!< CYCN (Bitfield-Mask: 0x3fff)                          */
/* ========================================================  G2CYCN  ========================================================= */
#define TSI_G2CYCN_CYCN_Pos               (0UL)                     /*!< CYCN (Bit 0)                                          */
#define TSI_G2CYCN_CYCN_Msk               (0x3fffUL)                /*!< CYCN (Bitfield-Mask: 0x3fff)                          */
/* ========================================================  G3CYCN  ========================================================= */
#define TSI_G3CYCN_CYCN_Pos               (0UL)                     /*!< CYCN (Bit 0)                                          */
#define TSI_G3CYCN_CYCN_Msk               (0x3fffUL)                /*!< CYCN (Bitfield-Mask: 0x3fff)                          */
/* ========================================================  G4CYCN  ========================================================= */
#define TSI_G4CYCN_CYCN_Pos               (0UL)                     /*!< CYCN (Bit 0)                                          */
#define TSI_G4CYCN_CYCN_Msk               (0x3fffUL)                /*!< CYCN (Bitfield-Mask: 0x3fff)                          */
/* ========================================================  G5CYCN  ========================================================= */
#define TSI_G5CYCN_CYCN_Pos               (0UL)                     /*!< CYCN (Bit 0)                                          */
#define TSI_G5CYCN_CYCN_Msk               (0x3fffUL)                /*!< CYCN (Bitfield-Mask: 0x3fff)                          */
/* =========================================================  CTL1  ========================================================== */
#define TSI_CTL1_ECDIV_Pos                (28UL)                    /*!< ECDIV (Bit 28)                                        */
#define TSI_CTL1_ECDIV_Msk                (0x30000000UL)            /*!< ECDIV (Bitfield-Mask: 0x03)                           */
#define TSI_CTL1_CTCDIV_MSB_Pos           (24UL)                    /*!< CTCDIV_MSB (Bit 24)                                   */
#define TSI_CTL1_CTCDIV_MSB_Msk           (0x1000000UL)             /*!< CTCDIV_MSB (Bitfield-Mask: 0x01)                      */


/* =========================================================================================================================== */
/* ================                                          USART0                                           ================ */
/* =========================================================================================================================== */

