RIOT-OS/RIOT/cpu/gd32f3x0/include/gd32f3x0_periph.h
/* =========================================================  CTL0  ========================================================== */
#define USART0_CTL0_EBIE_Pos              (27UL)                    /*!< EBIE (Bit 27)                                         */
#define USART0_CTL0_EBIE_Msk              (0x8000000UL)             /*!< EBIE (Bitfield-Mask: 0x01)                            */
#define USART0_CTL0_RTIE_Pos              (26UL)                    /*!< RTIE (Bit 26)                                         */
#define USART0_CTL0_RTIE_Msk              (0x4000000UL)             /*!< RTIE (Bitfield-Mask: 0x01)                            */
#define USART0_CTL0_DEA_Pos               (21UL)                    /*!< DEA (Bit 21)                                          */
#define USART0_CTL0_DEA_Msk               (0x3e00000UL)             /*!< DEA (Bitfield-Mask: 0x1f)                             */
#define USART0_CTL0_DED_Pos               (16UL)                    /*!< DED (Bit 16)                                          */
#define USART0_CTL0_DED_Msk               (0x1f0000UL)              /*!< DED (Bitfield-Mask: 0x1f)                             */
#define USART0_CTL0_OVSMOD_Pos            (15UL)                    /*!< OVSMOD (Bit 15)                                       */
#define USART0_CTL0_OVSMOD_Msk            (0x8000UL)                /*!< OVSMOD (Bitfield-Mask: 0x01)                          */
#define USART0_CTL0_AMIE_Pos              (14UL)                    /*!< AMIE (Bit 14)                                         */
#define USART0_CTL0_AMIE_Msk              (0x4000UL)                /*!< AMIE (Bitfield-Mask: 0x01)                            */
#define USART0_CTL0_MEN_Pos               (13UL)                    /*!< MEN (Bit 13)                                          */
#define USART0_CTL0_MEN_Msk               (0x2000UL)                /*!< MEN (Bitfield-Mask: 0x01)                             */
#define USART0_CTL0_WL_Pos                (12UL)                    /*!< WL (Bit 12)                                           */
#define USART0_CTL0_WL_Msk                (0x1000UL)                /*!< WL (Bitfield-Mask: 0x01)                              */
#define USART0_CTL0_WM_Pos                (11UL)                    /*!< WM (Bit 11)                                           */
#define USART0_CTL0_WM_Msk                (0x800UL)                 /*!< WM (Bitfield-Mask: 0x01)                              */
#define USART0_CTL0_PCEN_Pos              (10UL)                    /*!< PCEN (Bit 10)                                         */
#define USART0_CTL0_PCEN_Msk              (0x400UL)                 /*!< PCEN (Bitfield-Mask: 0x01)                            */
#define USART0_CTL0_PM_Pos                (9UL)                     /*!< PM (Bit 9)                                            */
#define USART0_CTL0_PM_Msk                (0x200UL)                 /*!< PM (Bitfield-Mask: 0x01)                              */
#define USART0_CTL0_PERRIE_Pos            (8UL)                     /*!< PERRIE (Bit 8)                                        */
#define USART0_CTL0_PERRIE_Msk            (0x100UL)                 /*!< PERRIE (Bitfield-Mask: 0x01)                          */
#define USART0_CTL0_TBEIE_Pos             (7UL)                     /*!< TBEIE (Bit 7)                                         */
#define USART0_CTL0_TBEIE_Msk             (0x80UL)                  /*!< TBEIE (Bitfield-Mask: 0x01)                           */
#define USART0_CTL0_TCIE_Pos              (6UL)                     /*!< TCIE (Bit 6)                                          */
#define USART0_CTL0_TCIE_Msk              (0x40UL)                  /*!< TCIE (Bitfield-Mask: 0x01)                            */
#define USART0_CTL0_RBNEIE_Pos            (5UL)                     /*!< RBNEIE (Bit 5)                                        */
#define USART0_CTL0_RBNEIE_Msk            (0x20UL)                  /*!< RBNEIE (Bitfield-Mask: 0x01)                          */
#define USART0_CTL0_IDLEIE_Pos            (4UL)                     /*!< IDLEIE (Bit 4)                                        */
#define USART0_CTL0_IDLEIE_Msk            (0x10UL)                  /*!< IDLEIE (Bitfield-Mask: 0x01)                          */
#define USART0_CTL0_TEN_Pos               (3UL)                     /*!< TEN (Bit 3)                                           */
#define USART0_CTL0_TEN_Msk               (0x8UL)                   /*!< TEN (Bitfield-Mask: 0x01)                             */
#define USART0_CTL0_REN_Pos               (2UL)                     /*!< REN (Bit 2)                                           */
#define USART0_CTL0_REN_Msk               (0x4UL)                   /*!< REN (Bitfield-Mask: 0x01)                             */
#define USART0_CTL0_UESM_Pos              (1UL)                     /*!< UESM (Bit 1)                                          */
#define USART0_CTL0_UESM_Msk              (0x2UL)                   /*!< UESM (Bitfield-Mask: 0x01)                            */
#define USART0_CTL0_UEN_Pos               (0UL)                     /*!< UEN (Bit 0)                                           */
#define USART0_CTL0_UEN_Msk               (0x1UL)                   /*!< UEN (Bitfield-Mask: 0x01)                             */
/* =========================================================  CTL1  ========================================================== */
#define USART0_CTL1_ADDR_Pos              (24UL)                    /*!< ADDR (Bit 24)                                         */
#define USART0_CTL1_ADDR_Msk              (0xff000000UL)            /*!< ADDR (Bitfield-Mask: 0xff)                            */
#define USART0_CTL1_RTEN_Pos              (23UL)                    /*!< RTEN (Bit 23)                                         */
#define USART0_CTL1_RTEN_Msk              (0x800000UL)              /*!< RTEN (Bitfield-Mask: 0x01)                            */
#define USART0_CTL1_ABDM_Pos              (21UL)                    /*!< ABDM (Bit 21)                                         */
#define USART0_CTL1_ABDM_Msk              (0x600000UL)              /*!< ABDM (Bitfield-Mask: 0x03)                            */
#define USART0_CTL1_ABDEN_Pos             (20UL)                    /*!< ABDEN (Bit 20)                                        */
#define USART0_CTL1_ABDEN_Msk             (0x100000UL)              /*!< ABDEN (Bitfield-Mask: 0x01)                           */
#define USART0_CTL1_MSBF_Pos              (19UL)                    /*!< MSBF (Bit 19)                                         */
#define USART0_CTL1_MSBF_Msk              (0x80000UL)               /*!< MSBF (Bitfield-Mask: 0x01)                            */
#define USART0_CTL1_DINV_Pos              (18UL)                    /*!< DINV (Bit 18)                                         */
#define USART0_CTL1_DINV_Msk              (0x40000UL)               /*!< DINV (Bitfield-Mask: 0x01)                            */
#define USART0_CTL1_TINV_Pos              (17UL)                    /*!< TINV (Bit 17)                                         */
#define USART0_CTL1_TINV_Msk              (0x20000UL)               /*!< TINV (Bitfield-Mask: 0x01)                            */
#define USART0_CTL1_RINV_Pos              (16UL)                    /*!< RINV (Bit 16)                                         */
#define USART0_CTL1_RINV_Msk              (0x10000UL)               /*!< RINV (Bitfield-Mask: 0x01)                            */
#define USART0_CTL1_STRP_Pos              (15UL)                    /*!< STRP (Bit 15)                                         */
#define USART0_CTL1_STRP_Msk              (0x8000UL)                /*!< STRP (Bitfield-Mask: 0x01)                            */
#define USART0_CTL1_LMEN_Pos              (14UL)                    /*!< LMEN (Bit 14)                                         */
#define USART0_CTL1_LMEN_Msk              (0x4000UL)                /*!< LMEN (Bitfield-Mask: 0x01)                            */
#define USART0_CTL1_STB_Pos               (12UL)                    /*!< STB (Bit 12)                                          */
#define USART0_CTL1_STB_Msk               (0x3000UL)                /*!< STB (Bitfield-Mask: 0x03)                             */
#define USART0_CTL1_CKEN_Pos              (11UL)                    /*!< CKEN (Bit 11)                                         */
#define USART0_CTL1_CKEN_Msk              (0x800UL)                 /*!< CKEN (Bitfield-Mask: 0x01)                            */
#define USART0_CTL1_CPL_Pos               (10UL)                    /*!< CPL (Bit 10)                                          */
#define USART0_CTL1_CPL_Msk               (0x400UL)                 /*!< CPL (Bitfield-Mask: 0x01)                             */
#define USART0_CTL1_CPH_Pos               (9UL)                     /*!< CPH (Bit 9)                                           */
#define USART0_CTL1_CPH_Msk               (0x200UL)                 /*!< CPH (Bitfield-Mask: 0x01)                             */
#define USART0_CTL1_CLEN_Pos              (8UL)                     /*!< CLEN (Bit 8)                                          */
#define USART0_CTL1_CLEN_Msk              (0x100UL)                 /*!< CLEN (Bitfield-Mask: 0x01)                            */
#define USART0_CTL1_LBDIE_Pos             (6UL)                     /*!< LBDIE (Bit 6)                                         */
#define USART0_CTL1_LBDIE_Msk             (0x40UL)                  /*!< LBDIE (Bitfield-Mask: 0x01)                           */
#define USART0_CTL1_LBLEN_Pos             (5UL)                     /*!< LBLEN (Bit 5)                                         */
#define USART0_CTL1_LBLEN_Msk             (0x20UL)                  /*!< LBLEN (Bitfield-Mask: 0x01)                           */
#define USART0_CTL1_ADDM_Pos              (4UL)                     /*!< ADDM (Bit 4)                                          */
#define USART0_CTL1_ADDM_Msk              (0x10UL)                  /*!< ADDM (Bitfield-Mask: 0x01)                            */
/* =========================================================  CTL2  ========================================================== */
#define USART0_CTL2_WUIE_Pos              (22UL)                    /*!< WUIE (Bit 22)                                         */
#define USART0_CTL2_WUIE_Msk              (0x400000UL)              /*!< WUIE (Bitfield-Mask: 0x01)                            */
#define USART0_CTL2_WUM_Pos               (20UL)                    /*!< WUM (Bit 20)                                          */
#define USART0_CTL2_WUM_Msk               (0x300000UL)              /*!< WUM (Bitfield-Mask: 0x03)                             */
#define USART0_CTL2_SCRTNUM_Pos           (17UL)                    /*!< SCRTNUM (Bit 17)                                      */
#define USART0_CTL2_SCRTNUM_Msk           (0xe0000UL)               /*!< SCRTNUM (Bitfield-Mask: 0x07)                         */
#define USART0_CTL2_DEP_Pos               (15UL)                    /*!< DEP (Bit 15)                                          */
#define USART0_CTL2_DEP_Msk               (0x8000UL)                /*!< DEP (Bitfield-Mask: 0x01)                             */
#define USART0_CTL2_DEM_Pos               (14UL)                    /*!< DEM (Bit 14)                                          */
#define USART0_CTL2_DEM_Msk               (0x4000UL)                /*!< DEM (Bitfield-Mask: 0x01)                             */
#define USART0_CTL2_DDRE_Pos              (13UL)                    /*!< DDRE (Bit 13)                                         */
#define USART0_CTL2_DDRE_Msk              (0x2000UL)                /*!< DDRE (Bitfield-Mask: 0x01)                            */
#define USART0_CTL2_OVRD_Pos              (12UL)                    /*!< OVRD (Bit 12)                                         */
#define USART0_CTL2_OVRD_Msk              (0x1000UL)                /*!< OVRD (Bitfield-Mask: 0x01)                            */
#define USART0_CTL2_OSB_Pos               (11UL)                    /*!< OSB (Bit 11)                                          */
#define USART0_CTL2_OSB_Msk               (0x800UL)                 /*!< OSB (Bitfield-Mask: 0x01)                             */
#define USART0_CTL2_CTSIE_Pos             (10UL)                    /*!< CTSIE (Bit 10)                                        */
#define USART0_CTL2_CTSIE_Msk             (0x400UL)                 /*!< CTSIE (Bitfield-Mask: 0x01)                           */
#define USART0_CTL2_CTSEN_Pos             (9UL)                     /*!< CTSEN (Bit 9)                                         */
#define USART0_CTL2_CTSEN_Msk             (0x200UL)                 /*!< CTSEN (Bitfield-Mask: 0x01)                           */
#define USART0_CTL2_RTSEN_Pos             (8UL)                     /*!< RTSEN (Bit 8)                                         */
#define USART0_CTL2_RTSEN_Msk             (0x100UL)                 /*!< RTSEN (Bitfield-Mask: 0x01)                           */
#define USART0_CTL2_DENT_Pos              (7UL)                     /*!< DENT (Bit 7)                                          */
#define USART0_CTL2_DENT_Msk              (0x80UL)                  /*!< DENT (Bitfield-Mask: 0x01)                            */
#define USART0_CTL2_DENR_Pos              (6UL)                     /*!< DENR (Bit 6)                                          */
#define USART0_CTL2_DENR_Msk              (0x40UL)                  /*!< DENR (Bitfield-Mask: 0x01)                            */
#define USART0_CTL2_SCEN_Pos              (5UL)                     /*!< SCEN (Bit 5)                                          */
#define USART0_CTL2_SCEN_Msk              (0x20UL)                  /*!< SCEN (Bitfield-Mask: 0x01)                            */
#define USART0_CTL2_NKEN_Pos              (4UL)                     /*!< NKEN (Bit 4)                                          */
#define USART0_CTL2_NKEN_Msk              (0x10UL)                  /*!< NKEN (Bitfield-Mask: 0x01)                            */
#define USART0_CTL2_HDEN_Pos              (3UL)                     /*!< HDEN (Bit 3)                                          */
#define USART0_CTL2_HDEN_Msk              (0x8UL)                   /*!< HDEN (Bitfield-Mask: 0x01)                            */
#define USART0_CTL2_IRLP_Pos              (2UL)                     /*!< IRLP (Bit 2)                                          */
#define USART0_CTL2_IRLP_Msk              (0x4UL)                   /*!< IRLP (Bitfield-Mask: 0x01)                            */
#define USART0_CTL2_IREN_Pos              (1UL)                     /*!< IREN (Bit 1)                                          */
#define USART0_CTL2_IREN_Msk              (0x2UL)                   /*!< IREN (Bitfield-Mask: 0x01)                            */
#define USART0_CTL2_ERRIE_Pos             (0UL)                     /*!< ERRIE (Bit 0)                                         */
#define USART0_CTL2_ERRIE_Msk             (0x1UL)                   /*!< ERRIE (Bitfield-Mask: 0x01)                           */
/* =========================================================  BAUD  ========================================================== */
#define USART0_BAUD_BRR_INT_Pos           (4UL)                     /*!< BRR_INT (Bit 4)                                       */
#define USART0_BAUD_BRR_INT_Msk           (0xfff0UL)                /*!< BRR_INT (Bitfield-Mask: 0xfff)                        */
#define USART0_BAUD_BRR_FRA_Pos           (0UL)                     /*!< BRR_FRA (Bit 0)                                       */
#define USART0_BAUD_BRR_FRA_Msk           (0xfUL)                   /*!< BRR_FRA (Bitfield-Mask: 0x0f)                         */
/* ==========================================================  GP  =========================================================== */
#define USART0_GP_GUAT_Pos                (8UL)                     /*!< GUAT (Bit 8)                                          */
#define USART0_GP_GUAT_Msk                (0xff00UL)                /*!< GUAT (Bitfield-Mask: 0xff)                            */
#define USART0_GP_PSC_Pos                 (0UL)                     /*!< PSC (Bit 0)                                           */
#define USART0_GP_PSC_Msk                 (0xffUL)                  /*!< PSC (Bitfield-Mask: 0xff)                             */
/* ==========================================================  RT  =========================================================== */
#define USART0_RT_BL_Pos                  (24UL)                    /*!< BL (Bit 24)                                           */
#define USART0_RT_BL_Msk                  (0xff000000UL)            /*!< BL (Bitfield-Mask: 0xff)                              */
#define USART0_RT_RT_Pos                  (0UL)                     /*!< RT (Bit 0)                                            */
#define USART0_RT_RT_Msk                  (0xffffffUL)              /*!< RT (Bitfield-Mask: 0xffffff)                          */
/* ==========================================================  CMD  ========================================================== */
#define USART0_CMD_TXFCMD_Pos             (4UL)                     /*!< TXFCMD (Bit 4)                                        */
#define USART0_CMD_TXFCMD_Msk             (0x10UL)                  /*!< TXFCMD (Bitfield-Mask: 0x01)                          */
#define USART0_CMD_RXFCMD_Pos             (3UL)                     /*!< RXFCMD (Bit 3)                                        */
#define USART0_CMD_RXFCMD_Msk             (0x8UL)                   /*!< RXFCMD (Bitfield-Mask: 0x01)                          */
#define USART0_CMD_MMCMD_Pos              (2UL)                     /*!< MMCMD (Bit 2)                                         */
#define USART0_CMD_MMCMD_Msk              (0x4UL)                   /*!< MMCMD (Bitfield-Mask: 0x01)                           */
#define USART0_CMD_SBKCMD_Pos             (1UL)                     /*!< SBKCMD (Bit 1)                                        */
#define USART0_CMD_SBKCMD_Msk             (0x2UL)                   /*!< SBKCMD (Bitfield-Mask: 0x01)                          */
#define USART0_CMD_ABDCMD_Pos             (0UL)                     /*!< ABDCMD (Bit 0)                                        */
#define USART0_CMD_ABDCMD_Msk             (0x1UL)                   /*!< ABDCMD (Bitfield-Mask: 0x01)                          */
/* =========================================================  STAT  ========================================================== */
#define USART0_STAT_REA_Pos               (22UL)                    /*!< REA (Bit 22)                                          */
#define USART0_STAT_REA_Msk               (0x400000UL)              /*!< REA (Bitfield-Mask: 0x01)                             */
#define USART0_STAT_TEA_Pos               (21UL)                    /*!< TEA (Bit 21)                                          */
#define USART0_STAT_TEA_Msk               (0x200000UL)              /*!< TEA (Bitfield-Mask: 0x01)                             */
#define USART0_STAT_WUF_Pos               (20UL)                    /*!< WUF (Bit 20)                                          */
#define USART0_STAT_WUF_Msk               (0x100000UL)              /*!< WUF (Bitfield-Mask: 0x01)                             */
#define USART0_STAT_RWU_Pos               (19UL)                    /*!< RWU (Bit 19)                                          */
#define USART0_STAT_RWU_Msk               (0x80000UL)               /*!< RWU (Bitfield-Mask: 0x01)                             */
#define USART0_STAT_SBF_Pos               (18UL)                    /*!< SBF (Bit 18)                                          */
#define USART0_STAT_SBF_Msk               (0x40000UL)               /*!< SBF (Bitfield-Mask: 0x01)                             */
#define USART0_STAT_AMF_Pos               (17UL)                    /*!< AMF (Bit 17)                                          */
#define USART0_STAT_AMF_Msk               (0x20000UL)               /*!< AMF (Bitfield-Mask: 0x01)                             */
#define USART0_STAT_BSY_Pos               (16UL)                    /*!< BSY (Bit 16)                                          */
#define USART0_STAT_BSY_Msk               (0x10000UL)               /*!< BSY (Bitfield-Mask: 0x01)                             */
#define USART0_STAT_ABDF_Pos              (15UL)                    /*!< ABDF (Bit 15)                                         */
#define USART0_STAT_ABDF_Msk              (0x8000UL)                /*!< ABDF (Bitfield-Mask: 0x01)                            */
#define USART0_STAT_ABDE_Pos              (14UL)                    /*!< ABDE (Bit 14)                                         */
#define USART0_STAT_ABDE_Msk              (0x4000UL)                /*!< ABDE (Bitfield-Mask: 0x01)                            */
#define USART0_STAT_EBF_Pos               (12UL)                    /*!< EBF (Bit 12)                                          */
#define USART0_STAT_EBF_Msk               (0x1000UL)                /*!< EBF (Bitfield-Mask: 0x01)                             */
#define USART0_STAT_RTF_Pos               (11UL)                    /*!< RTF (Bit 11)                                          */
#define USART0_STAT_RTF_Msk               (0x800UL)                 /*!< RTF (Bitfield-Mask: 0x01)                             */
#define USART0_STAT_CTS_Pos               (10UL)                    /*!< CTS (Bit 10)                                          */
#define USART0_STAT_CTS_Msk               (0x400UL)                 /*!< CTS (Bitfield-Mask: 0x01)                             */
#define USART0_STAT_CTSF_Pos              (9UL)                     /*!< CTSF (Bit 9)                                          */
#define USART0_STAT_CTSF_Msk              (0x200UL)                 /*!< CTSF (Bitfield-Mask: 0x01)                            */
#define USART0_STAT_LBDF_Pos              (8UL)                     /*!< LBDF (Bit 8)                                          */
#define USART0_STAT_LBDF_Msk              (0x100UL)                 /*!< LBDF (Bitfield-Mask: 0x01)                            */
#define USART0_STAT_TBE_Pos               (7UL)                     /*!< TBE (Bit 7)                                           */
#define USART0_STAT_TBE_Msk               (0x80UL)                  /*!< TBE (Bitfield-Mask: 0x01)                             */
#define USART0_STAT_TC_Pos                (6UL)                     /*!< TC (Bit 6)                                            */
#define USART0_STAT_TC_Msk                (0x40UL)                  /*!< TC (Bitfield-Mask: 0x01)                              */
#define USART0_STAT_RBNE_Pos              (5UL)                     /*!< RBNE (Bit 5)                                          */
#define USART0_STAT_RBNE_Msk              (0x20UL)                  /*!< RBNE (Bitfield-Mask: 0x01)                            */
#define USART0_STAT_IDLEF_Pos             (4UL)                     /*!< IDLEF (Bit 4)                                         */
#define USART0_STAT_IDLEF_Msk             (0x10UL)                  /*!< IDLEF (Bitfield-Mask: 0x01)                           */
#define USART0_STAT_ORERR_Pos             (3UL)                     /*!< ORERR (Bit 3)                                         */
#define USART0_STAT_ORERR_Msk             (0x8UL)                   /*!< ORERR (Bitfield-Mask: 0x01)                           */
#define USART0_STAT_NERR_Pos              (2UL)                     /*!< NERR (Bit 2)                                          */
#define USART0_STAT_NERR_Msk              (0x4UL)                   /*!< NERR (Bitfield-Mask: 0x01)                            */
