RIOT-OS/RIOT/cpu/gd32f3x0/include/gd32f3x0_periph.h
/* =======================================================  HCH1INTEN  ======================================================= */
#define USBFS_HOST_HCH1INTEN_TFIE_Pos     (0UL)                     /*!< TFIE (Bit 0)                                          */
#define USBFS_HOST_HCH1INTEN_TFIE_Msk     (0x1UL)                   /*!< TFIE (Bitfield-Mask: 0x01)                            */
#define USBFS_HOST_HCH1INTEN_CHIE_Pos     (1UL)                     /*!< CHIE (Bit 1)                                          */
#define USBFS_HOST_HCH1INTEN_CHIE_Msk     (0x2UL)                   /*!< CHIE (Bitfield-Mask: 0x01)                            */
#define USBFS_HOST_HCH1INTEN_STALLIE_Pos  (3UL)                     /*!< STALLIE (Bit 3)                                       */
#define USBFS_HOST_HCH1INTEN_STALLIE_Msk  (0x8UL)                   /*!< STALLIE (Bitfield-Mask: 0x01)                         */
#define USBFS_HOST_HCH1INTEN_NAKIE_Pos    (4UL)                     /*!< NAKIE (Bit 4)                                         */
#define USBFS_HOST_HCH1INTEN_NAKIE_Msk    (0x10UL)                  /*!< NAKIE (Bitfield-Mask: 0x01)                           */
#define USBFS_HOST_HCH1INTEN_ACKIE_Pos    (5UL)                     /*!< ACKIE (Bit 5)                                         */
#define USBFS_HOST_HCH1INTEN_ACKIE_Msk    (0x20UL)                  /*!< ACKIE (Bitfield-Mask: 0x01)                           */
#define USBFS_HOST_HCH1INTEN_USBERIE_Pos  (7UL)                     /*!< USBERIE (Bit 7)                                       */
#define USBFS_HOST_HCH1INTEN_USBERIE_Msk  (0x80UL)                  /*!< USBERIE (Bitfield-Mask: 0x01)                         */
#define USBFS_HOST_HCH1INTEN_BBERIE_Pos   (8UL)                     /*!< BBERIE (Bit 8)                                        */
#define USBFS_HOST_HCH1INTEN_BBERIE_Msk   (0x100UL)                 /*!< BBERIE (Bitfield-Mask: 0x01)                          */
#define USBFS_HOST_HCH1INTEN_REQOVRIE_Pos (9UL)                     /*!< REQOVRIE (Bit 9)                                      */
#define USBFS_HOST_HCH1INTEN_REQOVRIE_Msk (0x200UL)                 /*!< REQOVRIE (Bitfield-Mask: 0x01)                        */
#define USBFS_HOST_HCH1INTEN_DTERIE_Pos   (10UL)                    /*!< DTERIE (Bit 10)                                       */
#define USBFS_HOST_HCH1INTEN_DTERIE_Msk   (0x400UL)                 /*!< DTERIE (Bitfield-Mask: 0x01)                          */
/* =======================================================  HCH2INTEN  ======================================================= */
#define USBFS_HOST_HCH2INTEN_TFIE_Pos     (0UL)                     /*!< TFIE (Bit 0)                                          */
#define USBFS_HOST_HCH2INTEN_TFIE_Msk     (0x1UL)                   /*!< TFIE (Bitfield-Mask: 0x01)                            */
#define USBFS_HOST_HCH2INTEN_CHIE_Pos     (1UL)                     /*!< CHIE (Bit 1)                                          */
#define USBFS_HOST_HCH2INTEN_CHIE_Msk     (0x2UL)                   /*!< CHIE (Bitfield-Mask: 0x01)                            */
#define USBFS_HOST_HCH2INTEN_STALLIE_Pos  (3UL)                     /*!< STALLIE (Bit 3)                                       */
#define USBFS_HOST_HCH2INTEN_STALLIE_Msk  (0x8UL)                   /*!< STALLIE (Bitfield-Mask: 0x01)                         */
#define USBFS_HOST_HCH2INTEN_NAKIE_Pos    (4UL)                     /*!< NAKIE (Bit 4)                                         */
#define USBFS_HOST_HCH2INTEN_NAKIE_Msk    (0x10UL)                  /*!< NAKIE (Bitfield-Mask: 0x01)                           */
#define USBFS_HOST_HCH2INTEN_ACKIE_Pos    (5UL)                     /*!< ACKIE (Bit 5)                                         */
#define USBFS_HOST_HCH2INTEN_ACKIE_Msk    (0x20UL)                  /*!< ACKIE (Bitfield-Mask: 0x01)                           */
#define USBFS_HOST_HCH2INTEN_USBERIE_Pos  (7UL)                     /*!< USBERIE (Bit 7)                                       */
#define USBFS_HOST_HCH2INTEN_USBERIE_Msk  (0x80UL)                  /*!< USBERIE (Bitfield-Mask: 0x01)                         */
#define USBFS_HOST_HCH2INTEN_BBERIE_Pos   (8UL)                     /*!< BBERIE (Bit 8)                                        */
#define USBFS_HOST_HCH2INTEN_BBERIE_Msk   (0x100UL)                 /*!< BBERIE (Bitfield-Mask: 0x01)                          */
#define USBFS_HOST_HCH2INTEN_REQOVRIE_Pos (9UL)                     /*!< REQOVRIE (Bit 9)                                      */
#define USBFS_HOST_HCH2INTEN_REQOVRIE_Msk (0x200UL)                 /*!< REQOVRIE (Bitfield-Mask: 0x01)                        */
#define USBFS_HOST_HCH2INTEN_DTERIE_Pos   (10UL)                    /*!< DTERIE (Bit 10)                                       */
#define USBFS_HOST_HCH2INTEN_DTERIE_Msk   (0x400UL)                 /*!< DTERIE (Bitfield-Mask: 0x01)                          */
/* =======================================================  HCH3INTEN  ======================================================= */
#define USBFS_HOST_HCH3INTEN_TFIE_Pos     (0UL)                     /*!< TFIE (Bit 0)                                          */
#define USBFS_HOST_HCH3INTEN_TFIE_Msk     (0x1UL)                   /*!< TFIE (Bitfield-Mask: 0x01)                            */
#define USBFS_HOST_HCH3INTEN_CHIE_Pos     (1UL)                     /*!< CHIE (Bit 1)                                          */
#define USBFS_HOST_HCH3INTEN_CHIE_Msk     (0x2UL)                   /*!< CHIE (Bitfield-Mask: 0x01)                            */
#define USBFS_HOST_HCH3INTEN_STALLIE_Pos  (3UL)                     /*!< STALLIE (Bit 3)                                       */
#define USBFS_HOST_HCH3INTEN_STALLIE_Msk  (0x8UL)                   /*!< STALLIE (Bitfield-Mask: 0x01)                         */
#define USBFS_HOST_HCH3INTEN_NAKIE_Pos    (4UL)                     /*!< NAKIE (Bit 4)                                         */
#define USBFS_HOST_HCH3INTEN_NAKIE_Msk    (0x10UL)                  /*!< NAKIE (Bitfield-Mask: 0x01)                           */
#define USBFS_HOST_HCH3INTEN_ACKIE_Pos    (5UL)                     /*!< ACKIE (Bit 5)                                         */
#define USBFS_HOST_HCH3INTEN_ACKIE_Msk    (0x20UL)                  /*!< ACKIE (Bitfield-Mask: 0x01)                           */
#define USBFS_HOST_HCH3INTEN_USBERIE_Pos  (7UL)                     /*!< USBERIE (Bit 7)                                       */
#define USBFS_HOST_HCH3INTEN_USBERIE_Msk  (0x80UL)                  /*!< USBERIE (Bitfield-Mask: 0x01)                         */
#define USBFS_HOST_HCH3INTEN_BBERIE_Pos   (8UL)                     /*!< BBERIE (Bit 8)                                        */
#define USBFS_HOST_HCH3INTEN_BBERIE_Msk   (0x100UL)                 /*!< BBERIE (Bitfield-Mask: 0x01)                          */
#define USBFS_HOST_HCH3INTEN_REQOVRIE_Pos (9UL)                     /*!< REQOVRIE (Bit 9)                                      */
#define USBFS_HOST_HCH3INTEN_REQOVRIE_Msk (0x200UL)                 /*!< REQOVRIE (Bitfield-Mask: 0x01)                        */
#define USBFS_HOST_HCH3INTEN_DTERIE_Pos   (10UL)                    /*!< DTERIE (Bit 10)                                       */
#define USBFS_HOST_HCH3INTEN_DTERIE_Msk   (0x400UL)                 /*!< DTERIE (Bitfield-Mask: 0x01)                          */
/* =======================================================  HCH4INTEN  ======================================================= */
#define USBFS_HOST_HCH4INTEN_TFIE_Pos     (0UL)                     /*!< TFIE (Bit 0)                                          */
#define USBFS_HOST_HCH4INTEN_TFIE_Msk     (0x1UL)                   /*!< TFIE (Bitfield-Mask: 0x01)                            */
#define USBFS_HOST_HCH4INTEN_CHIE_Pos     (1UL)                     /*!< CHIE (Bit 1)                                          */
#define USBFS_HOST_HCH4INTEN_CHIE_Msk     (0x2UL)                   /*!< CHIE (Bitfield-Mask: 0x01)                            */
#define USBFS_HOST_HCH4INTEN_STALLIE_Pos  (3UL)                     /*!< STALLIE (Bit 3)                                       */
#define USBFS_HOST_HCH4INTEN_STALLIE_Msk  (0x8UL)                   /*!< STALLIE (Bitfield-Mask: 0x01)                         */
#define USBFS_HOST_HCH4INTEN_NAKIE_Pos    (4UL)                     /*!< NAKIE (Bit 4)                                         */
#define USBFS_HOST_HCH4INTEN_NAKIE_Msk    (0x10UL)                  /*!< NAKIE (Bitfield-Mask: 0x01)                           */
#define USBFS_HOST_HCH4INTEN_ACKIE_Pos    (5UL)                     /*!< ACKIE (Bit 5)                                         */
#define USBFS_HOST_HCH4INTEN_ACKIE_Msk    (0x20UL)                  /*!< ACKIE (Bitfield-Mask: 0x01)                           */
#define USBFS_HOST_HCH4INTEN_USBERIE_Pos  (7UL)                     /*!< USBERIE (Bit 7)                                       */
#define USBFS_HOST_HCH4INTEN_USBERIE_Msk  (0x80UL)                  /*!< USBERIE (Bitfield-Mask: 0x01)                         */
#define USBFS_HOST_HCH4INTEN_BBERIE_Pos   (8UL)                     /*!< BBERIE (Bit 8)                                        */
#define USBFS_HOST_HCH4INTEN_BBERIE_Msk   (0x100UL)                 /*!< BBERIE (Bitfield-Mask: 0x01)                          */
#define USBFS_HOST_HCH4INTEN_REQOVRIE_Pos (9UL)                     /*!< REQOVRIE (Bit 9)                                      */
#define USBFS_HOST_HCH4INTEN_REQOVRIE_Msk (0x200UL)                 /*!< REQOVRIE (Bitfield-Mask: 0x01)                        */
#define USBFS_HOST_HCH4INTEN_DTERIE_Pos   (10UL)                    /*!< DTERIE (Bit 10)                                       */
#define USBFS_HOST_HCH4INTEN_DTERIE_Msk   (0x400UL)                 /*!< DTERIE (Bitfield-Mask: 0x01)                          */
/* =======================================================  HCH5INTEN  ======================================================= */
#define USBFS_HOST_HCH5INTEN_TFIE_Pos     (0UL)                     /*!< TFIE (Bit 0)                                          */
#define USBFS_HOST_HCH5INTEN_TFIE_Msk     (0x1UL)                   /*!< TFIE (Bitfield-Mask: 0x01)                            */
#define USBFS_HOST_HCH5INTEN_CHIE_Pos     (1UL)                     /*!< CHIE (Bit 1)                                          */
#define USBFS_HOST_HCH5INTEN_CHIE_Msk     (0x2UL)                   /*!< CHIE (Bitfield-Mask: 0x01)                            */
#define USBFS_HOST_HCH5INTEN_STALLIE_Pos  (3UL)                     /*!< STALLIE (Bit 3)                                       */
#define USBFS_HOST_HCH5INTEN_STALLIE_Msk  (0x8UL)                   /*!< STALLIE (Bitfield-Mask: 0x01)                         */
#define USBFS_HOST_HCH5INTEN_NAKIE_Pos    (4UL)                     /*!< NAKIE (Bit 4)                                         */
#define USBFS_HOST_HCH5INTEN_NAKIE_Msk    (0x10UL)                  /*!< NAKIE (Bitfield-Mask: 0x01)                           */
#define USBFS_HOST_HCH5INTEN_ACKIE_Pos    (5UL)                     /*!< ACKIE (Bit 5)                                         */
#define USBFS_HOST_HCH5INTEN_ACKIE_Msk    (0x20UL)                  /*!< ACKIE (Bitfield-Mask: 0x01)                           */
#define USBFS_HOST_HCH5INTEN_USBERIE_Pos  (7UL)                     /*!< USBERIE (Bit 7)                                       */
#define USBFS_HOST_HCH5INTEN_USBERIE_Msk  (0x80UL)                  /*!< USBERIE (Bitfield-Mask: 0x01)                         */
#define USBFS_HOST_HCH5INTEN_BBERIE_Pos   (8UL)                     /*!< BBERIE (Bit 8)                                        */
#define USBFS_HOST_HCH5INTEN_BBERIE_Msk   (0x100UL)                 /*!< BBERIE (Bitfield-Mask: 0x01)                          */
#define USBFS_HOST_HCH5INTEN_REQOVRIE_Pos (9UL)                     /*!< REQOVRIE (Bit 9)                                      */
#define USBFS_HOST_HCH5INTEN_REQOVRIE_Msk (0x200UL)                 /*!< REQOVRIE (Bitfield-Mask: 0x01)                        */
#define USBFS_HOST_HCH5INTEN_DTERIE_Pos   (10UL)                    /*!< DTERIE (Bit 10)                                       */
#define USBFS_HOST_HCH5INTEN_DTERIE_Msk   (0x400UL)                 /*!< DTERIE (Bitfield-Mask: 0x01)                          */
/* =======================================================  HCH6INTEN  ======================================================= */
#define USBFS_HOST_HCH6INTEN_TFIE_Pos     (0UL)                     /*!< TFIE (Bit 0)                                          */
#define USBFS_HOST_HCH6INTEN_TFIE_Msk     (0x1UL)                   /*!< TFIE (Bitfield-Mask: 0x01)                            */
#define USBFS_HOST_HCH6INTEN_CHIE_Pos     (1UL)                     /*!< CHIE (Bit 1)                                          */
#define USBFS_HOST_HCH6INTEN_CHIE_Msk     (0x2UL)                   /*!< CHIE (Bitfield-Mask: 0x01)                            */
#define USBFS_HOST_HCH6INTEN_STALLIE_Pos  (3UL)                     /*!< STALLIE (Bit 3)                                       */
#define USBFS_HOST_HCH6INTEN_STALLIE_Msk  (0x8UL)                   /*!< STALLIE (Bitfield-Mask: 0x01)                         */
#define USBFS_HOST_HCH6INTEN_NAKIE_Pos    (4UL)                     /*!< NAKIE (Bit 4)                                         */
#define USBFS_HOST_HCH6INTEN_NAKIE_Msk    (0x10UL)                  /*!< NAKIE (Bitfield-Mask: 0x01)                           */
#define USBFS_HOST_HCH6INTEN_ACKIE_Pos    (5UL)                     /*!< ACKIE (Bit 5)                                         */
#define USBFS_HOST_HCH6INTEN_ACKIE_Msk    (0x20UL)                  /*!< ACKIE (Bitfield-Mask: 0x01)                           */
#define USBFS_HOST_HCH6INTEN_USBERIE_Pos  (7UL)                     /*!< USBERIE (Bit 7)                                       */
#define USBFS_HOST_HCH6INTEN_USBERIE_Msk  (0x80UL)                  /*!< USBERIE (Bitfield-Mask: 0x01)                         */
#define USBFS_HOST_HCH6INTEN_BBERIE_Pos   (8UL)                     /*!< BBERIE (Bit 8)                                        */
#define USBFS_HOST_HCH6INTEN_BBERIE_Msk   (0x100UL)                 /*!< BBERIE (Bitfield-Mask: 0x01)                          */
#define USBFS_HOST_HCH6INTEN_REQOVRIE_Pos (9UL)                     /*!< REQOVRIE (Bit 9)                                      */
#define USBFS_HOST_HCH6INTEN_REQOVRIE_Msk (0x200UL)                 /*!< REQOVRIE (Bitfield-Mask: 0x01)                        */
#define USBFS_HOST_HCH6INTEN_DTERIE_Pos   (10UL)                    /*!< DTERIE (Bit 10)                                       */
#define USBFS_HOST_HCH6INTEN_DTERIE_Msk   (0x400UL)                 /*!< DTERIE (Bitfield-Mask: 0x01)                          */
/* =======================================================  HCH7INTEN  ======================================================= */
#define USBFS_HOST_HCH7INTEN_TFIE_Pos     (0UL)                     /*!< TFIE (Bit 0)                                          */
#define USBFS_HOST_HCH7INTEN_TFIE_Msk     (0x1UL)                   /*!< TFIE (Bitfield-Mask: 0x01)                            */
#define USBFS_HOST_HCH7INTEN_CHIE_Pos     (1UL)                     /*!< CHIE (Bit 1)                                          */
#define USBFS_HOST_HCH7INTEN_CHIE_Msk     (0x2UL)                   /*!< CHIE (Bitfield-Mask: 0x01)                            */
#define USBFS_HOST_HCH7INTEN_STALLIE_Pos  (3UL)                     /*!< STALLIE (Bit 3)                                       */
#define USBFS_HOST_HCH7INTEN_STALLIE_Msk  (0x8UL)                   /*!< STALLIE (Bitfield-Mask: 0x01)                         */
#define USBFS_HOST_HCH7INTEN_NAKIE_Pos    (4UL)                     /*!< NAKIE (Bit 4)                                         */
#define USBFS_HOST_HCH7INTEN_NAKIE_Msk    (0x10UL)                  /*!< NAKIE (Bitfield-Mask: 0x01)                           */
#define USBFS_HOST_HCH7INTEN_ACKIE_Pos    (5UL)                     /*!< ACKIE (Bit 5)                                         */
#define USBFS_HOST_HCH7INTEN_ACKIE_Msk    (0x20UL)                  /*!< ACKIE (Bitfield-Mask: 0x01)                           */
#define USBFS_HOST_HCH7INTEN_USBERIE_Pos  (7UL)                     /*!< USBERIE (Bit 7)                                       */
#define USBFS_HOST_HCH7INTEN_USBERIE_Msk  (0x80UL)                  /*!< USBERIE (Bitfield-Mask: 0x01)                         */
#define USBFS_HOST_HCH7INTEN_BBERIE_Pos   (8UL)                     /*!< BBERIE (Bit 8)                                        */
#define USBFS_HOST_HCH7INTEN_BBERIE_Msk   (0x100UL)                 /*!< BBERIE (Bitfield-Mask: 0x01)                          */
#define USBFS_HOST_HCH7INTEN_REQOVRIE_Pos (9UL)                     /*!< REQOVRIE (Bit 9)                                      */
#define USBFS_HOST_HCH7INTEN_REQOVRIE_Msk (0x200UL)                 /*!< REQOVRIE (Bitfield-Mask: 0x01)                        */
#define USBFS_HOST_HCH7INTEN_DTERIE_Pos   (10UL)                    /*!< DTERIE (Bit 10)                                       */
#define USBFS_HOST_HCH7INTEN_DTERIE_Msk   (0x400UL)                 /*!< DTERIE (Bitfield-Mask: 0x01)                          */
/* ========================================================  HCH0LEN  ======================================================== */
#define USBFS_HOST_HCH0LEN_TLEN_Pos       (0UL)                     /*!< TLEN (Bit 0)                                          */
#define USBFS_HOST_HCH0LEN_TLEN_Msk       (0x7ffffUL)               /*!< TLEN (Bitfield-Mask: 0x7ffff)                         */
#define USBFS_HOST_HCH0LEN_PCNT_Pos       (19UL)                    /*!< PCNT (Bit 19)                                         */
#define USBFS_HOST_HCH0LEN_PCNT_Msk       (0x1ff80000UL)            /*!< PCNT (Bitfield-Mask: 0x3ff)                           */
#define USBFS_HOST_HCH0LEN_DPID_Pos       (29UL)                    /*!< DPID (Bit 29)                                         */
#define USBFS_HOST_HCH0LEN_DPID_Msk       (0x60000000UL)            /*!< DPID (Bitfield-Mask: 0x03)                            */
/* ========================================================  HCH1LEN  ======================================================== */
#define USBFS_HOST_HCH1LEN_TLEN_Pos       (0UL)                     /*!< TLEN (Bit 0)                                          */
#define USBFS_HOST_HCH1LEN_TLEN_Msk       (0x7ffffUL)               /*!< TLEN (Bitfield-Mask: 0x7ffff)                         */
#define USBFS_HOST_HCH1LEN_PCNT_Pos       (19UL)                    /*!< PCNT (Bit 19)                                         */
#define USBFS_HOST_HCH1LEN_PCNT_Msk       (0x1ff80000UL)            /*!< PCNT (Bitfield-Mask: 0x3ff)                           */
#define USBFS_HOST_HCH1LEN_DPID_Pos       (29UL)                    /*!< DPID (Bit 29)                                         */
#define USBFS_HOST_HCH1LEN_DPID_Msk       (0x60000000UL)            /*!< DPID (Bitfield-Mask: 0x03)                            */
/* ========================================================  HCH2LEN  ======================================================== */
#define USBFS_HOST_HCH2LEN_TLEN_Pos       (0UL)                     /*!< TLEN (Bit 0)                                          */
#define USBFS_HOST_HCH2LEN_TLEN_Msk       (0x7ffffUL)               /*!< TLEN (Bitfield-Mask: 0x7ffff)                         */
#define USBFS_HOST_HCH2LEN_PCNT_Pos       (19UL)                    /*!< PCNT (Bit 19)                                         */
#define USBFS_HOST_HCH2LEN_PCNT_Msk       (0x1ff80000UL)            /*!< PCNT (Bitfield-Mask: 0x3ff)                           */
#define USBFS_HOST_HCH2LEN_DPID_Pos       (29UL)                    /*!< DPID (Bit 29)                                         */
#define USBFS_HOST_HCH2LEN_DPID_Msk       (0x60000000UL)            /*!< DPID (Bitfield-Mask: 0x03)                            */
/* ========================================================  HCH3LEN  ======================================================== */
#define USBFS_HOST_HCH3LEN_TLEN_Pos       (0UL)                     /*!< TLEN (Bit 0)                                          */
#define USBFS_HOST_HCH3LEN_TLEN_Msk       (0x7ffffUL)               /*!< TLEN (Bitfield-Mask: 0x7ffff)                         */
#define USBFS_HOST_HCH3LEN_PCNT_Pos       (19UL)                    /*!< PCNT (Bit 19)                                         */
#define USBFS_HOST_HCH3LEN_PCNT_Msk       (0x1ff80000UL)            /*!< PCNT (Bitfield-Mask: 0x3ff)                           */
#define USBFS_HOST_HCH3LEN_DPID_Pos       (29UL)                    /*!< DPID (Bit 29)                                         */
#define USBFS_HOST_HCH3LEN_DPID_Msk       (0x60000000UL)            /*!< DPID (Bitfield-Mask: 0x03)                            */
/* ========================================================  HCH4LEN  ======================================================== */
#define USBFS_HOST_HCH4LEN_TLEN_Pos       (0UL)                     /*!< TLEN (Bit 0)                                          */
#define USBFS_HOST_HCH4LEN_TLEN_Msk       (0x7ffffUL)               /*!< TLEN (Bitfield-Mask: 0x7ffff)                         */
#define USBFS_HOST_HCH4LEN_PCNT_Pos       (19UL)                    /*!< PCNT (Bit 19)                                         */
#define USBFS_HOST_HCH4LEN_PCNT_Msk       (0x1ff80000UL)            /*!< PCNT (Bitfield-Mask: 0x3ff)                           */
#define USBFS_HOST_HCH4LEN_DPID_Pos       (29UL)                    /*!< DPID (Bit 29)                                         */
#define USBFS_HOST_HCH4LEN_DPID_Msk       (0x60000000UL)            /*!< DPID (Bitfield-Mask: 0x03)                            */
/* ========================================================  HCH5LEN  ======================================================== */
#define USBFS_HOST_HCH5LEN_TLEN_Pos       (0UL)                     /*!< TLEN (Bit 0)                                          */
#define USBFS_HOST_HCH5LEN_TLEN_Msk       (0x7ffffUL)               /*!< TLEN (Bitfield-Mask: 0x7ffff)                         */
#define USBFS_HOST_HCH5LEN_PCNT_Pos       (19UL)                    /*!< PCNT (Bit 19)                                         */
#define USBFS_HOST_HCH5LEN_PCNT_Msk       (0x1ff80000UL)            /*!< PCNT (Bitfield-Mask: 0x3ff)                           */
#define USBFS_HOST_HCH5LEN_DPID_Pos       (29UL)                    /*!< DPID (Bit 29)                                         */
#define USBFS_HOST_HCH5LEN_DPID_Msk       (0x60000000UL)            /*!< DPID (Bitfield-Mask: 0x03)                            */
/* ========================================================  HCH6LEN  ======================================================== */
#define USBFS_HOST_HCH6LEN_TLEN_Pos       (0UL)                     /*!< TLEN (Bit 0)                                          */
#define USBFS_HOST_HCH6LEN_TLEN_Msk       (0x7ffffUL)               /*!< TLEN (Bitfield-Mask: 0x7ffff)                         */
#define USBFS_HOST_HCH6LEN_PCNT_Pos       (19UL)                    /*!< PCNT (Bit 19)                                         */
#define USBFS_HOST_HCH6LEN_PCNT_Msk       (0x1ff80000UL)            /*!< PCNT (Bitfield-Mask: 0x3ff)                           */
#define USBFS_HOST_HCH6LEN_DPID_Pos       (29UL)                    /*!< DPID (Bit 29)                                         */
#define USBFS_HOST_HCH6LEN_DPID_Msk       (0x60000000UL)            /*!< DPID (Bitfield-Mask: 0x03)                            */
/* ========================================================  HCH7LEN  ======================================================== */
#define USBFS_HOST_HCH7LEN_TLEN_Pos       (0UL)                     /*!< TLEN (Bit 0)                                          */
