RIOT-OS/RIOT/cpu/gd32f3x0/include/gd32f3x0_periph.h
#define USBFS_DEVICE_DIEP3CTL_MPL_Pos     (0UL)                     /*!< MPL (Bit 0)                                           */
#define USBFS_DEVICE_DIEP3CTL_MPL_Msk     (0x7ffUL)                 /*!< MPL (Bitfield-Mask: 0x7ff)                            */
/* =======================================================  DOEP0CTL  ======================================================== */
#define USBFS_DEVICE_DOEP0CTL_EPEN_Pos    (31UL)                    /*!< EPEN (Bit 31)                                         */
#define USBFS_DEVICE_DOEP0CTL_EPEN_Msk    (0x80000000UL)            /*!< EPEN (Bitfield-Mask: 0x01)                            */
#define USBFS_DEVICE_DOEP0CTL_EPD_Pos     (30UL)                    /*!< EPD (Bit 30)                                          */
#define USBFS_DEVICE_DOEP0CTL_EPD_Msk     (0x40000000UL)            /*!< EPD (Bitfield-Mask: 0x01)                             */
#define USBFS_DEVICE_DOEP0CTL_SNAK_Pos    (27UL)                    /*!< SNAK (Bit 27)                                         */
#define USBFS_DEVICE_DOEP0CTL_SNAK_Msk    (0x8000000UL)             /*!< SNAK (Bitfield-Mask: 0x01)                            */
#define USBFS_DEVICE_DOEP0CTL_CNAK_Pos    (26UL)                    /*!< CNAK (Bit 26)                                         */
#define USBFS_DEVICE_DOEP0CTL_CNAK_Msk    (0x4000000UL)             /*!< CNAK (Bitfield-Mask: 0x01)                            */
#define USBFS_DEVICE_DOEP0CTL_STALL_Pos   (21UL)                    /*!< STALL (Bit 21)                                        */
#define USBFS_DEVICE_DOEP0CTL_STALL_Msk   (0x200000UL)              /*!< STALL (Bitfield-Mask: 0x01)                           */
#define USBFS_DEVICE_DOEP0CTL_SNOOP_Pos   (20UL)                    /*!< SNOOP (Bit 20)                                        */
#define USBFS_DEVICE_DOEP0CTL_SNOOP_Msk   (0x100000UL)              /*!< SNOOP (Bitfield-Mask: 0x01)                           */
#define USBFS_DEVICE_DOEP0CTL_EPTYPE_Pos  (18UL)                    /*!< EPTYPE (Bit 18)                                       */
#define USBFS_DEVICE_DOEP0CTL_EPTYPE_Msk  (0xc0000UL)               /*!< EPTYPE (Bitfield-Mask: 0x03)                          */
#define USBFS_DEVICE_DOEP0CTL_NAKS_Pos    (17UL)                    /*!< NAKS (Bit 17)                                         */
#define USBFS_DEVICE_DOEP0CTL_NAKS_Msk    (0x20000UL)               /*!< NAKS (Bitfield-Mask: 0x01)                            */
#define USBFS_DEVICE_DOEP0CTL_EPACT_Pos   (15UL)                    /*!< EPACT (Bit 15)                                        */
#define USBFS_DEVICE_DOEP0CTL_EPACT_Msk   (0x8000UL)                /*!< EPACT (Bitfield-Mask: 0x01)                           */
#define USBFS_DEVICE_DOEP0CTL_MPL_Pos     (0UL)                     /*!< MPL (Bit 0)                                           */
#define USBFS_DEVICE_DOEP0CTL_MPL_Msk     (0x3UL)                   /*!< MPL (Bitfield-Mask: 0x03)                             */
/* =======================================================  DOEP1CTL  ======================================================== */
#define USBFS_DEVICE_DOEP1CTL_EPEN_Pos    (31UL)                    /*!< EPEN (Bit 31)                                         */
#define USBFS_DEVICE_DOEP1CTL_EPEN_Msk    (0x80000000UL)            /*!< EPEN (Bitfield-Mask: 0x01)                            */
#define USBFS_DEVICE_DOEP1CTL_EPD_Pos     (30UL)                    /*!< EPD (Bit 30)                                          */
#define USBFS_DEVICE_DOEP1CTL_EPD_Msk     (0x40000000UL)            /*!< EPD (Bitfield-Mask: 0x01)                             */
#define USBFS_DEVICE_DOEP1CTL_SD1PID_SODDFRM_Pos (29UL)             /*!< SD1PID_SODDFRM (Bit 29)                               */
#define USBFS_DEVICE_DOEP1CTL_SD1PID_SODDFRM_Msk (0x20000000UL)     /*!< SD1PID_SODDFRM (Bitfield-Mask: 0x01)                  */
#define USBFS_DEVICE_DOEP1CTL_SD0PID_SEVENFRM_Pos (28UL)            /*!< SD0PID_SEVENFRM (Bit 28)                              */
#define USBFS_DEVICE_DOEP1CTL_SD0PID_SEVENFRM_Msk (0x10000000UL)    /*!< SD0PID_SEVENFRM (Bitfield-Mask: 0x01)                 */
#define USBFS_DEVICE_DOEP1CTL_SNAK_Pos    (27UL)                    /*!< SNAK (Bit 27)                                         */
#define USBFS_DEVICE_DOEP1CTL_SNAK_Msk    (0x8000000UL)             /*!< SNAK (Bitfield-Mask: 0x01)                            */
#define USBFS_DEVICE_DOEP1CTL_CNAK_Pos    (26UL)                    /*!< CNAK (Bit 26)                                         */
#define USBFS_DEVICE_DOEP1CTL_CNAK_Msk    (0x4000000UL)             /*!< CNAK (Bitfield-Mask: 0x01)                            */
#define USBFS_DEVICE_DOEP1CTL_STALL_Pos   (21UL)                    /*!< STALL (Bit 21)                                        */
#define USBFS_DEVICE_DOEP1CTL_STALL_Msk   (0x200000UL)              /*!< STALL (Bitfield-Mask: 0x01)                           */
#define USBFS_DEVICE_DOEP1CTL_SNOOP_Pos   (20UL)                    /*!< SNOOP (Bit 20)                                        */
#define USBFS_DEVICE_DOEP1CTL_SNOOP_Msk   (0x100000UL)              /*!< SNOOP (Bitfield-Mask: 0x01)                           */
#define USBFS_DEVICE_DOEP1CTL_EPTYPE_Pos  (18UL)                    /*!< EPTYPE (Bit 18)                                       */
#define USBFS_DEVICE_DOEP1CTL_EPTYPE_Msk  (0xc0000UL)               /*!< EPTYPE (Bitfield-Mask: 0x03)                          */
#define USBFS_DEVICE_DOEP1CTL_NAKS_Pos    (17UL)                    /*!< NAKS (Bit 17)                                         */
#define USBFS_DEVICE_DOEP1CTL_NAKS_Msk    (0x20000UL)               /*!< NAKS (Bitfield-Mask: 0x01)                            */
#define USBFS_DEVICE_DOEP1CTL_EOFRM_DPID_Pos (16UL)                 /*!< EOFRM_DPID (Bit 16)                                   */
#define USBFS_DEVICE_DOEP1CTL_EOFRM_DPID_Msk (0x10000UL)            /*!< EOFRM_DPID (Bitfield-Mask: 0x01)                      */
#define USBFS_DEVICE_DOEP1CTL_EPACT_Pos   (15UL)                    /*!< EPACT (Bit 15)                                        */
#define USBFS_DEVICE_DOEP1CTL_EPACT_Msk   (0x8000UL)                /*!< EPACT (Bitfield-Mask: 0x01)                           */
#define USBFS_DEVICE_DOEP1CTL_MPL_Pos     (0UL)                     /*!< MPL (Bit 0)                                           */
#define USBFS_DEVICE_DOEP1CTL_MPL_Msk     (0x7ffUL)                 /*!< MPL (Bitfield-Mask: 0x7ff)                            */
/* =======================================================  DOEP2CTL  ======================================================== */
#define USBFS_DEVICE_DOEP2CTL_EPEN_Pos    (31UL)                    /*!< EPEN (Bit 31)                                         */
#define USBFS_DEVICE_DOEP2CTL_EPEN_Msk    (0x80000000UL)            /*!< EPEN (Bitfield-Mask: 0x01)                            */
#define USBFS_DEVICE_DOEP2CTL_EPD_Pos     (30UL)                    /*!< EPD (Bit 30)                                          */
#define USBFS_DEVICE_DOEP2CTL_EPD_Msk     (0x40000000UL)            /*!< EPD (Bitfield-Mask: 0x01)                             */
#define USBFS_DEVICE_DOEP2CTL_SD1PID_SODDFRM_Pos (29UL)             /*!< SD1PID_SODDFRM (Bit 29)                               */
#define USBFS_DEVICE_DOEP2CTL_SD1PID_SODDFRM_Msk (0x20000000UL)     /*!< SD1PID_SODDFRM (Bitfield-Mask: 0x01)                  */
#define USBFS_DEVICE_DOEP2CTL_SD0PID_SEVENFRM_Pos (28UL)            /*!< SD0PID_SEVENFRM (Bit 28)                              */
#define USBFS_DEVICE_DOEP2CTL_SD0PID_SEVENFRM_Msk (0x10000000UL)    /*!< SD0PID_SEVENFRM (Bitfield-Mask: 0x01)                 */
#define USBFS_DEVICE_DOEP2CTL_SNAK_Pos    (27UL)                    /*!< SNAK (Bit 27)                                         */
#define USBFS_DEVICE_DOEP2CTL_SNAK_Msk    (0x8000000UL)             /*!< SNAK (Bitfield-Mask: 0x01)                            */
#define USBFS_DEVICE_DOEP2CTL_CNAK_Pos    (26UL)                    /*!< CNAK (Bit 26)                                         */
#define USBFS_DEVICE_DOEP2CTL_CNAK_Msk    (0x4000000UL)             /*!< CNAK (Bitfield-Mask: 0x01)                            */
#define USBFS_DEVICE_DOEP2CTL_STALL_Pos   (21UL)                    /*!< STALL (Bit 21)                                        */
#define USBFS_DEVICE_DOEP2CTL_STALL_Msk   (0x200000UL)              /*!< STALL (Bitfield-Mask: 0x01)                           */
#define USBFS_DEVICE_DOEP2CTL_SNOOP_Pos   (20UL)                    /*!< SNOOP (Bit 20)                                        */
#define USBFS_DEVICE_DOEP2CTL_SNOOP_Msk   (0x100000UL)              /*!< SNOOP (Bitfield-Mask: 0x01)                           */
#define USBFS_DEVICE_DOEP2CTL_EPTYPE_Pos  (18UL)                    /*!< EPTYPE (Bit 18)                                       */
#define USBFS_DEVICE_DOEP2CTL_EPTYPE_Msk  (0xc0000UL)               /*!< EPTYPE (Bitfield-Mask: 0x03)                          */
#define USBFS_DEVICE_DOEP2CTL_NAKS_Pos    (17UL)                    /*!< NAKS (Bit 17)                                         */
#define USBFS_DEVICE_DOEP2CTL_NAKS_Msk    (0x20000UL)               /*!< NAKS (Bitfield-Mask: 0x01)                            */
#define USBFS_DEVICE_DOEP2CTL_EOFRM_DPID_Pos (16UL)                 /*!< EOFRM_DPID (Bit 16)                                   */
#define USBFS_DEVICE_DOEP2CTL_EOFRM_DPID_Msk (0x10000UL)            /*!< EOFRM_DPID (Bitfield-Mask: 0x01)                      */
#define USBFS_DEVICE_DOEP2CTL_EPACT_Pos   (15UL)                    /*!< EPACT (Bit 15)                                        */
#define USBFS_DEVICE_DOEP2CTL_EPACT_Msk   (0x8000UL)                /*!< EPACT (Bitfield-Mask: 0x01)                           */
#define USBFS_DEVICE_DOEP2CTL_MPL_Pos     (0UL)                     /*!< MPL (Bit 0)                                           */
#define USBFS_DEVICE_DOEP2CTL_MPL_Msk     (0x7ffUL)                 /*!< MPL (Bitfield-Mask: 0x7ff)                            */
/* =======================================================  DOEP3CTL  ======================================================== */
#define USBFS_DEVICE_DOEP3CTL_EPEN_Pos    (31UL)                    /*!< EPEN (Bit 31)                                         */
#define USBFS_DEVICE_DOEP3CTL_EPEN_Msk    (0x80000000UL)            /*!< EPEN (Bitfield-Mask: 0x01)                            */
#define USBFS_DEVICE_DOEP3CTL_EPD_Pos     (30UL)                    /*!< EPD (Bit 30)                                          */
#define USBFS_DEVICE_DOEP3CTL_EPD_Msk     (0x40000000UL)            /*!< EPD (Bitfield-Mask: 0x01)                             */
#define USBFS_DEVICE_DOEP3CTL_SD1PID_SODDFRM_Pos (29UL)             /*!< SD1PID_SODDFRM (Bit 29)                               */
#define USBFS_DEVICE_DOEP3CTL_SD1PID_SODDFRM_Msk (0x20000000UL)     /*!< SD1PID_SODDFRM (Bitfield-Mask: 0x01)                  */
#define USBFS_DEVICE_DOEP3CTL_SD0PID_SEVENFRM_Pos (28UL)            /*!< SD0PID_SEVENFRM (Bit 28)                              */
#define USBFS_DEVICE_DOEP3CTL_SD0PID_SEVENFRM_Msk (0x10000000UL)    /*!< SD0PID_SEVENFRM (Bitfield-Mask: 0x01)                 */
#define USBFS_DEVICE_DOEP3CTL_SNAK_Pos    (27UL)                    /*!< SNAK (Bit 27)                                         */
#define USBFS_DEVICE_DOEP3CTL_SNAK_Msk    (0x8000000UL)             /*!< SNAK (Bitfield-Mask: 0x01)                            */
#define USBFS_DEVICE_DOEP3CTL_CNAK_Pos    (26UL)                    /*!< CNAK (Bit 26)                                         */
#define USBFS_DEVICE_DOEP3CTL_CNAK_Msk    (0x4000000UL)             /*!< CNAK (Bitfield-Mask: 0x01)                            */
#define USBFS_DEVICE_DOEP3CTL_STALL_Pos   (21UL)                    /*!< STALL (Bit 21)                                        */
#define USBFS_DEVICE_DOEP3CTL_STALL_Msk   (0x200000UL)              /*!< STALL (Bitfield-Mask: 0x01)                           */
#define USBFS_DEVICE_DOEP3CTL_SNOOP_Pos   (20UL)                    /*!< SNOOP (Bit 20)                                        */
#define USBFS_DEVICE_DOEP3CTL_SNOOP_Msk   (0x100000UL)              /*!< SNOOP (Bitfield-Mask: 0x01)                           */
#define USBFS_DEVICE_DOEP3CTL_EPTYPE_Pos  (18UL)                    /*!< EPTYPE (Bit 18)                                       */
#define USBFS_DEVICE_DOEP3CTL_EPTYPE_Msk  (0xc0000UL)               /*!< EPTYPE (Bitfield-Mask: 0x03)                          */
#define USBFS_DEVICE_DOEP3CTL_NAKS_Pos    (17UL)                    /*!< NAKS (Bit 17)                                         */
#define USBFS_DEVICE_DOEP3CTL_NAKS_Msk    (0x20000UL)               /*!< NAKS (Bitfield-Mask: 0x01)                            */
#define USBFS_DEVICE_DOEP3CTL_EOFRM_DPID_Pos (16UL)                 /*!< EOFRM_DPID (Bit 16)                                   */
#define USBFS_DEVICE_DOEP3CTL_EOFRM_DPID_Msk (0x10000UL)            /*!< EOFRM_DPID (Bitfield-Mask: 0x01)                      */
#define USBFS_DEVICE_DOEP3CTL_EPACT_Pos   (15UL)                    /*!< EPACT (Bit 15)                                        */
#define USBFS_DEVICE_DOEP3CTL_EPACT_Msk   (0x8000UL)                /*!< EPACT (Bitfield-Mask: 0x01)                           */
#define USBFS_DEVICE_DOEP3CTL_MPL_Pos     (0UL)                     /*!< MPL (Bit 0)                                           */
#define USBFS_DEVICE_DOEP3CTL_MPL_Msk     (0x7ffUL)                 /*!< MPL (Bitfield-Mask: 0x7ff)                            */
/* =======================================================  DIEP0INTF  ======================================================= */
#define USBFS_DEVICE_DIEP0INTF_TXFE_Pos   (7UL)                     /*!< TXFE (Bit 7)                                          */
#define USBFS_DEVICE_DIEP0INTF_TXFE_Msk   (0x80UL)                  /*!< TXFE (Bitfield-Mask: 0x01)                            */
#define USBFS_DEVICE_DIEP0INTF_IEPNE_Pos  (6UL)                     /*!< IEPNE (Bit 6)                                         */
#define USBFS_DEVICE_DIEP0INTF_IEPNE_Msk  (0x40UL)                  /*!< IEPNE (Bitfield-Mask: 0x01)                           */
#define USBFS_DEVICE_DIEP0INTF_EPTXFUD_Pos (4UL)                    /*!< EPTXFUD (Bit 4)                                       */
#define USBFS_DEVICE_DIEP0INTF_EPTXFUD_Msk (0x10UL)                 /*!< EPTXFUD (Bitfield-Mask: 0x01)                         */
#define USBFS_DEVICE_DIEP0INTF_CITO_Pos   (3UL)                     /*!< CITO (Bit 3)                                          */
#define USBFS_DEVICE_DIEP0INTF_CITO_Msk   (0x8UL)                   /*!< CITO (Bitfield-Mask: 0x01)                            */
#define USBFS_DEVICE_DIEP0INTF_EPDIS_Pos  (1UL)                     /*!< EPDIS (Bit 1)                                         */
#define USBFS_DEVICE_DIEP0INTF_EPDIS_Msk  (0x2UL)                   /*!< EPDIS (Bitfield-Mask: 0x01)                           */
#define USBFS_DEVICE_DIEP0INTF_TF_Pos     (0UL)                     /*!< TF (Bit 0)                                            */
#define USBFS_DEVICE_DIEP0INTF_TF_Msk     (0x1UL)                   /*!< TF (Bitfield-Mask: 0x01)                              */
/* =======================================================  DIEP1INTF  ======================================================= */
#define USBFS_DEVICE_DIEP1INTF_TXFE_Pos   (7UL)                     /*!< TXFE (Bit 7)                                          */
#define USBFS_DEVICE_DIEP1INTF_TXFE_Msk   (0x80UL)                  /*!< TXFE (Bitfield-Mask: 0x01)                            */
#define USBFS_DEVICE_DIEP1INTF_IEPNE_Pos  (6UL)                     /*!< IEPNE (Bit 6)                                         */
#define USBFS_DEVICE_DIEP1INTF_IEPNE_Msk  (0x40UL)                  /*!< IEPNE (Bitfield-Mask: 0x01)                           */
#define USBFS_DEVICE_DIEP1INTF_EPTXFUD_Pos (4UL)                    /*!< EPTXFUD (Bit 4)                                       */
#define USBFS_DEVICE_DIEP1INTF_EPTXFUD_Msk (0x10UL)                 /*!< EPTXFUD (Bitfield-Mask: 0x01)                         */
#define USBFS_DEVICE_DIEP1INTF_CITO_Pos   (3UL)                     /*!< CITO (Bit 3)                                          */
#define USBFS_DEVICE_DIEP1INTF_CITO_Msk   (0x8UL)                   /*!< CITO (Bitfield-Mask: 0x01)                            */
#define USBFS_DEVICE_DIEP1INTF_EPDIS_Pos  (1UL)                     /*!< EPDIS (Bit 1)                                         */
#define USBFS_DEVICE_DIEP1INTF_EPDIS_Msk  (0x2UL)                   /*!< EPDIS (Bitfield-Mask: 0x01)                           */
#define USBFS_DEVICE_DIEP1INTF_TF_Pos     (0UL)                     /*!< TF (Bit 0)                                            */
#define USBFS_DEVICE_DIEP1INTF_TF_Msk     (0x1UL)                   /*!< TF (Bitfield-Mask: 0x01)                              */
/* =======================================================  DIEP2INTF  ======================================================= */
#define USBFS_DEVICE_DIEP2INTF_TXFE_Pos   (7UL)                     /*!< TXFE (Bit 7)                                          */
#define USBFS_DEVICE_DIEP2INTF_TXFE_Msk   (0x80UL)                  /*!< TXFE (Bitfield-Mask: 0x01)                            */
#define USBFS_DEVICE_DIEP2INTF_IEPNE_Pos  (6UL)                     /*!< IEPNE (Bit 6)                                         */
#define USBFS_DEVICE_DIEP2INTF_IEPNE_Msk  (0x40UL)                  /*!< IEPNE (Bitfield-Mask: 0x01)                           */
#define USBFS_DEVICE_DIEP2INTF_EPTXFUD_Pos (4UL)                    /*!< EPTXFUD (Bit 4)                                       */
#define USBFS_DEVICE_DIEP2INTF_EPTXFUD_Msk (0x10UL)                 /*!< EPTXFUD (Bitfield-Mask: 0x01)                         */
#define USBFS_DEVICE_DIEP2INTF_CITO_Pos   (3UL)                     /*!< CITO (Bit 3)                                          */
#define USBFS_DEVICE_DIEP2INTF_CITO_Msk   (0x8UL)                   /*!< CITO (Bitfield-Mask: 0x01)                            */
#define USBFS_DEVICE_DIEP2INTF_EPDIS_Pos  (1UL)                     /*!< EPDIS (Bit 1)                                         */
#define USBFS_DEVICE_DIEP2INTF_EPDIS_Msk  (0x2UL)                   /*!< EPDIS (Bitfield-Mask: 0x01)                           */
#define USBFS_DEVICE_DIEP2INTF_TF_Pos     (0UL)                     /*!< TF (Bit 0)                                            */
#define USBFS_DEVICE_DIEP2INTF_TF_Msk     (0x1UL)                   /*!< TF (Bitfield-Mask: 0x01)                              */
/* =======================================================  DIEP3INTF  ======================================================= */
#define USBFS_DEVICE_DIEP3INTF_TXFE_Pos   (7UL)                     /*!< TXFE (Bit 7)                                          */
#define USBFS_DEVICE_DIEP3INTF_TXFE_Msk   (0x80UL)                  /*!< TXFE (Bitfield-Mask: 0x01)                            */
#define USBFS_DEVICE_DIEP3INTF_IEPNE_Pos  (6UL)                     /*!< IEPNE (Bit 6)                                         */
#define USBFS_DEVICE_DIEP3INTF_IEPNE_Msk  (0x40UL)                  /*!< IEPNE (Bitfield-Mask: 0x01)                           */
#define USBFS_DEVICE_DIEP3INTF_EPTXFUD_Pos (4UL)                    /*!< EPTXFUD (Bit 4)                                       */
#define USBFS_DEVICE_DIEP3INTF_EPTXFUD_Msk (0x10UL)                 /*!< EPTXFUD (Bitfield-Mask: 0x01)                         */
#define USBFS_DEVICE_DIEP3INTF_CITO_Pos   (3UL)                     /*!< CITO (Bit 3)                                          */
#define USBFS_DEVICE_DIEP3INTF_CITO_Msk   (0x8UL)                   /*!< CITO (Bitfield-Mask: 0x01)                            */
#define USBFS_DEVICE_DIEP3INTF_EPDIS_Pos  (1UL)                     /*!< EPDIS (Bit 1)                                         */
#define USBFS_DEVICE_DIEP3INTF_EPDIS_Msk  (0x2UL)                   /*!< EPDIS (Bitfield-Mask: 0x01)                           */
#define USBFS_DEVICE_DIEP3INTF_TF_Pos     (0UL)                     /*!< TF (Bit 0)                                            */
#define USBFS_DEVICE_DIEP3INTF_TF_Msk     (0x1UL)                   /*!< TF (Bitfield-Mask: 0x01)                              */
/* =======================================================  DOEP0INTF  ======================================================= */
#define USBFS_DEVICE_DOEP0INTF_BTBSTP_Pos (6UL)                     /*!< BTBSTP (Bit 6)                                        */
#define USBFS_DEVICE_DOEP0INTF_BTBSTP_Msk (0x40UL)                  /*!< BTBSTP (Bitfield-Mask: 0x01)                          */
#define USBFS_DEVICE_DOEP0INTF_EPRXFOVR_Pos (4UL)                   /*!< EPRXFOVR (Bit 4)                                      */
#define USBFS_DEVICE_DOEP0INTF_EPRXFOVR_Msk (0x10UL)                /*!< EPRXFOVR (Bitfield-Mask: 0x01)                        */
#define USBFS_DEVICE_DOEP0INTF_STPF_Pos   (3UL)                     /*!< STPF (Bit 3)                                          */
#define USBFS_DEVICE_DOEP0INTF_STPF_Msk   (0x8UL)                   /*!< STPF (Bitfield-Mask: 0x01)                            */
#define USBFS_DEVICE_DOEP0INTF_EPDIS_Pos  (1UL)                     /*!< EPDIS (Bit 1)                                         */
#define USBFS_DEVICE_DOEP0INTF_EPDIS_Msk  (0x2UL)                   /*!< EPDIS (Bitfield-Mask: 0x01)                           */
#define USBFS_DEVICE_DOEP0INTF_TF_Pos     (0UL)                     /*!< TF (Bit 0)                                            */
#define USBFS_DEVICE_DOEP0INTF_TF_Msk     (0x1UL)                   /*!< TF (Bitfield-Mask: 0x01)                              */
/* =======================================================  DOEP1INTF  ======================================================= */
#define USBFS_DEVICE_DOEP1INTF_BTBSTP_Pos (6UL)                     /*!< BTBSTP (Bit 6)                                        */
#define USBFS_DEVICE_DOEP1INTF_BTBSTP_Msk (0x40UL)                  /*!< BTBSTP (Bitfield-Mask: 0x01)                          */
#define USBFS_DEVICE_DOEP1INTF_EPRXFOVR_Pos (4UL)                   /*!< EPRXFOVR (Bit 4)                                      */
#define USBFS_DEVICE_DOEP1INTF_EPRXFOVR_Msk (0x10UL)                /*!< EPRXFOVR (Bitfield-Mask: 0x01)                        */
#define USBFS_DEVICE_DOEP1INTF_STPF_Pos   (3UL)                     /*!< STPF (Bit 3)                                          */
#define USBFS_DEVICE_DOEP1INTF_STPF_Msk   (0x8UL)                   /*!< STPF (Bitfield-Mask: 0x01)                            */
#define USBFS_DEVICE_DOEP1INTF_EPDIS_Pos  (1UL)                     /*!< EPDIS (Bit 1)                                         */
#define USBFS_DEVICE_DOEP1INTF_EPDIS_Msk  (0x2UL)                   /*!< EPDIS (Bitfield-Mask: 0x01)                           */
#define USBFS_DEVICE_DOEP1INTF_TF_Pos     (0UL)                     /*!< TF (Bit 0)                                            */
#define USBFS_DEVICE_DOEP1INTF_TF_Msk     (0x1UL)                   /*!< TF (Bitfield-Mask: 0x01)                              */
/* =======================================================  DOEP2INTF  ======================================================= */
#define USBFS_DEVICE_DOEP2INTF_BTBSTP_Pos (6UL)                     /*!< BTBSTP (Bit 6)                                        */
#define USBFS_DEVICE_DOEP2INTF_BTBSTP_Msk (0x40UL)                  /*!< BTBSTP (Bitfield-Mask: 0x01)                          */
#define USBFS_DEVICE_DOEP2INTF_EPRXFOVR_Pos (4UL)                   /*!< EPRXFOVR (Bit 4)                                      */
#define USBFS_DEVICE_DOEP2INTF_EPRXFOVR_Msk (0x10UL)                /*!< EPRXFOVR (Bitfield-Mask: 0x01)                        */
#define USBFS_DEVICE_DOEP2INTF_STPF_Pos   (3UL)                     /*!< STPF (Bit 3)                                          */
