RIOT-OS/RIOT/cpu/gd32f3x0/include/gd32f3x0_periph.h
#define USBFS_DEVICE_DOEP2INTF_STPF_Msk   (0x8UL)                   /*!< STPF (Bitfield-Mask: 0x01)                            */
#define USBFS_DEVICE_DOEP2INTF_EPDIS_Pos  (1UL)                     /*!< EPDIS (Bit 1)                                         */
#define USBFS_DEVICE_DOEP2INTF_EPDIS_Msk  (0x2UL)                   /*!< EPDIS (Bitfield-Mask: 0x01)                           */
#define USBFS_DEVICE_DOEP2INTF_TF_Pos     (0UL)                     /*!< TF (Bit 0)                                            */
#define USBFS_DEVICE_DOEP2INTF_TF_Msk     (0x1UL)                   /*!< TF (Bitfield-Mask: 0x01)                              */
/* =======================================================  DOEP3INTF  ======================================================= */
#define USBFS_DEVICE_DOEP3INTF_BTBSTP_Pos (6UL)                     /*!< BTBSTP (Bit 6)                                        */
#define USBFS_DEVICE_DOEP3INTF_BTBSTP_Msk (0x40UL)                  /*!< BTBSTP (Bitfield-Mask: 0x01)                          */
#define USBFS_DEVICE_DOEP3INTF_EPRXFOVR_Pos (4UL)                   /*!< EPRXFOVR (Bit 4)                                      */
#define USBFS_DEVICE_DOEP3INTF_EPRXFOVR_Msk (0x10UL)                /*!< EPRXFOVR (Bitfield-Mask: 0x01)                        */
#define USBFS_DEVICE_DOEP3INTF_STPF_Pos   (3UL)                     /*!< STPF (Bit 3)                                          */
#define USBFS_DEVICE_DOEP3INTF_STPF_Msk   (0x8UL)                   /*!< STPF (Bitfield-Mask: 0x01)                            */
#define USBFS_DEVICE_DOEP3INTF_EPDIS_Pos  (1UL)                     /*!< EPDIS (Bit 1)                                         */
#define USBFS_DEVICE_DOEP3INTF_EPDIS_Msk  (0x2UL)                   /*!< EPDIS (Bitfield-Mask: 0x01)                           */
#define USBFS_DEVICE_DOEP3INTF_TF_Pos     (0UL)                     /*!< TF (Bit 0)                                            */
#define USBFS_DEVICE_DOEP3INTF_TF_Msk     (0x1UL)                   /*!< TF (Bitfield-Mask: 0x01)                              */
/* =======================================================  DIEP0LEN  ======================================================== */
#define USBFS_DEVICE_DIEP0LEN_PCNT_Pos    (19UL)                    /*!< PCNT (Bit 19)                                         */
#define USBFS_DEVICE_DIEP0LEN_PCNT_Msk    (0x180000UL)              /*!< PCNT (Bitfield-Mask: 0x03)                            */
#define USBFS_DEVICE_DIEP0LEN_TLEN_Pos    (0UL)                     /*!< TLEN (Bit 0)                                          */
#define USBFS_DEVICE_DIEP0LEN_TLEN_Msk    (0x7fUL)                  /*!< TLEN (Bitfield-Mask: 0x7f)                            */
/* =======================================================  DOEP0LEN  ======================================================== */
#define USBFS_DEVICE_DOEP0LEN_STPCNT_Pos  (29UL)                    /*!< STPCNT (Bit 29)                                       */
#define USBFS_DEVICE_DOEP0LEN_STPCNT_Msk  (0x60000000UL)            /*!< STPCNT (Bitfield-Mask: 0x03)                          */
#define USBFS_DEVICE_DOEP0LEN_PCNT_Pos    (19UL)                    /*!< PCNT (Bit 19)                                         */
#define USBFS_DEVICE_DOEP0LEN_PCNT_Msk    (0x80000UL)               /*!< PCNT (Bitfield-Mask: 0x01)                            */
#define USBFS_DEVICE_DOEP0LEN_TLEN_Pos    (0UL)                     /*!< TLEN (Bit 0)                                          */
#define USBFS_DEVICE_DOEP0LEN_TLEN_Msk    (0x7fUL)                  /*!< TLEN (Bitfield-Mask: 0x7f)                            */
/* =======================================================  DIEP1LEN  ======================================================== */
#define USBFS_DEVICE_DIEP1LEN_MCPF_Pos    (29UL)                    /*!< MCPF (Bit 29)                                         */
#define USBFS_DEVICE_DIEP1LEN_MCPF_Msk    (0x60000000UL)            /*!< MCPF (Bitfield-Mask: 0x03)                            */
#define USBFS_DEVICE_DIEP1LEN_PCNT_Pos    (19UL)                    /*!< PCNT (Bit 19)                                         */
#define USBFS_DEVICE_DIEP1LEN_PCNT_Msk    (0x1ff80000UL)            /*!< PCNT (Bitfield-Mask: 0x3ff)                           */
#define USBFS_DEVICE_DIEP1LEN_TLEN_Pos    (0UL)                     /*!< TLEN (Bit 0)                                          */
#define USBFS_DEVICE_DIEP1LEN_TLEN_Msk    (0x7ffffUL)               /*!< TLEN (Bitfield-Mask: 0x7ffff)                         */
/* =======================================================  DIEP2LEN  ======================================================== */
#define USBFS_DEVICE_DIEP2LEN_MCPF_Pos    (29UL)                    /*!< MCPF (Bit 29)                                         */
#define USBFS_DEVICE_DIEP2LEN_MCPF_Msk    (0x60000000UL)            /*!< MCPF (Bitfield-Mask: 0x03)                            */
#define USBFS_DEVICE_DIEP2LEN_PCNT_Pos    (19UL)                    /*!< PCNT (Bit 19)                                         */
#define USBFS_DEVICE_DIEP2LEN_PCNT_Msk    (0x1ff80000UL)            /*!< PCNT (Bitfield-Mask: 0x3ff)                           */
#define USBFS_DEVICE_DIEP2LEN_TLEN_Pos    (0UL)                     /*!< TLEN (Bit 0)                                          */
#define USBFS_DEVICE_DIEP2LEN_TLEN_Msk    (0x7ffffUL)               /*!< TLEN (Bitfield-Mask: 0x7ffff)                         */
/* =======================================================  DIEP3LEN  ======================================================== */
#define USBFS_DEVICE_DIEP3LEN_MCPF_Pos    (29UL)                    /*!< MCPF (Bit 29)                                         */
#define USBFS_DEVICE_DIEP3LEN_MCPF_Msk    (0x60000000UL)            /*!< MCPF (Bitfield-Mask: 0x03)                            */
#define USBFS_DEVICE_DIEP3LEN_PCNT_Pos    (19UL)                    /*!< PCNT (Bit 19)                                         */
#define USBFS_DEVICE_DIEP3LEN_PCNT_Msk    (0x1ff80000UL)            /*!< PCNT (Bitfield-Mask: 0x3ff)                           */
#define USBFS_DEVICE_DIEP3LEN_TLEN_Pos    (0UL)                     /*!< TLEN (Bit 0)                                          */
#define USBFS_DEVICE_DIEP3LEN_TLEN_Msk    (0x7ffffUL)               /*!< TLEN (Bitfield-Mask: 0x7ffff)                         */
/* =======================================================  DOEP1LEN  ======================================================== */
#define USBFS_DEVICE_DOEP1LEN_STPCNT_RXDPID_Pos (29UL)              /*!< STPCNT_RXDPID (Bit 29)                                */
#define USBFS_DEVICE_DOEP1LEN_STPCNT_RXDPID_Msk (0x60000000UL)      /*!< STPCNT_RXDPID (Bitfield-Mask: 0x03)                   */
#define USBFS_DEVICE_DOEP1LEN_PCNT_Pos    (19UL)                    /*!< PCNT (Bit 19)                                         */
#define USBFS_DEVICE_DOEP1LEN_PCNT_Msk    (0x1ff80000UL)            /*!< PCNT (Bitfield-Mask: 0x3ff)                           */
#define USBFS_DEVICE_DOEP1LEN_TLEN_Pos    (0UL)                     /*!< TLEN (Bit 0)                                          */
#define USBFS_DEVICE_DOEP1LEN_TLEN_Msk    (0x7ffffUL)               /*!< TLEN (Bitfield-Mask: 0x7ffff)                         */
/* =======================================================  DOEP2LEN  ======================================================== */
#define USBFS_DEVICE_DOEP2LEN_STPCNT_RXDPID_Pos (29UL)              /*!< STPCNT_RXDPID (Bit 29)                                */
#define USBFS_DEVICE_DOEP2LEN_STPCNT_RXDPID_Msk (0x60000000UL)      /*!< STPCNT_RXDPID (Bitfield-Mask: 0x03)                   */
#define USBFS_DEVICE_DOEP2LEN_PCNT_Pos    (19UL)                    /*!< PCNT (Bit 19)                                         */
#define USBFS_DEVICE_DOEP2LEN_PCNT_Msk    (0x1ff80000UL)            /*!< PCNT (Bitfield-Mask: 0x3ff)                           */
#define USBFS_DEVICE_DOEP2LEN_TLEN_Pos    (0UL)                     /*!< TLEN (Bit 0)                                          */
#define USBFS_DEVICE_DOEP2LEN_TLEN_Msk    (0x7ffffUL)               /*!< TLEN (Bitfield-Mask: 0x7ffff)                         */
/* =======================================================  DOEP3LEN  ======================================================== */
#define USBFS_DEVICE_DOEP3LEN_STPCNT_RXDPID_Pos (29UL)              /*!< STPCNT_RXDPID (Bit 29)                                */
#define USBFS_DEVICE_DOEP3LEN_STPCNT_RXDPID_Msk (0x60000000UL)      /*!< STPCNT_RXDPID (Bitfield-Mask: 0x03)                   */
#define USBFS_DEVICE_DOEP3LEN_PCNT_Pos    (19UL)                    /*!< PCNT (Bit 19)                                         */
#define USBFS_DEVICE_DOEP3LEN_PCNT_Msk    (0x1ff80000UL)            /*!< PCNT (Bitfield-Mask: 0x3ff)                           */
#define USBFS_DEVICE_DOEP3LEN_TLEN_Pos    (0UL)                     /*!< TLEN (Bit 0)                                          */
#define USBFS_DEVICE_DOEP3LEN_TLEN_Msk    (0x7ffffUL)               /*!< TLEN (Bitfield-Mask: 0x7ffff)                         */
/* ======================================================  DIEP0TFSTAT  ====================================================== */
#define USBFS_DEVICE_DIEP0TFSTAT_IEPTFS_Pos (0UL)                   /*!< IEPTFS (Bit 0)                                        */
#define USBFS_DEVICE_DIEP0TFSTAT_IEPTFS_Msk (0xffffUL)              /*!< IEPTFS (Bitfield-Mask: 0xffff)                        */
/* ======================================================  DIEP1TFSTAT  ====================================================== */
#define USBFS_DEVICE_DIEP1TFSTAT_IEPTFS_Pos (0UL)                   /*!< IEPTFS (Bit 0)                                        */
#define USBFS_DEVICE_DIEP1TFSTAT_IEPTFS_Msk (0xffffUL)              /*!< IEPTFS (Bitfield-Mask: 0xffff)                        */
/* ======================================================  DIEP2TFSTAT  ====================================================== */
#define USBFS_DEVICE_DIEP2TFSTAT_IEPTFS_Pos (0UL)                   /*!< IEPTFS (Bit 0)                                        */
#define USBFS_DEVICE_DIEP2TFSTAT_IEPTFS_Msk (0xffffUL)              /*!< IEPTFS (Bitfield-Mask: 0xffff)                        */
/* ======================================================  DIEP3TFSTAT  ====================================================== */
#define USBFS_DEVICE_DIEP3TFSTAT_IEPTFS_Pos (0UL)                   /*!< IEPTFS (Bit 0)                                        */
#define USBFS_DEVICE_DIEP3TFSTAT_IEPTFS_Msk (0xffffUL)              /*!< IEPTFS (Bitfield-Mask: 0xffff)                        */


/* =========================================================================================================================== */
/* ================                                       USBFS_PWRCLK                                        ================ */
/* =========================================================================================================================== */

/* =======================================================  PWRCLKCTL  ======================================================= */
#define USBFS_PWRCLK_PWRCLKCTL_SUCLK_Pos  (0UL)                     /*!< SUCLK (Bit 0)                                         */
#define USBFS_PWRCLK_PWRCLKCTL_SUCLK_Msk  (0x1UL)                   /*!< SUCLK (Bitfield-Mask: 0x01)                           */
#define USBFS_PWRCLK_PWRCLKCTL_SHCLK_Pos  (1UL)                     /*!< SHCLK (Bit 1)                                         */
#define USBFS_PWRCLK_PWRCLKCTL_SHCLK_Msk  (0x2UL)                   /*!< SHCLK (Bitfield-Mask: 0x01)                           */


/* =========================================================================================================================== */
/* ================                                           WWDGT                                           ================ */
/* =========================================================================================================================== */

/* ==========================================================  CTL  ========================================================== */
#define WWDGT_CTL_WDGTEN_Pos              (7UL)                     /*!< WDGTEN (Bit 7)                                        */
#define WWDGT_CTL_WDGTEN_Msk              (0x80UL)                  /*!< WDGTEN (Bitfield-Mask: 0x01)                          */
#define WWDGT_CTL_CNT_Pos                 (0UL)                     /*!< CNT (Bit 0)                                           */
#define WWDGT_CTL_CNT_Msk                 (0x7fUL)                  /*!< CNT (Bitfield-Mask: 0x7f)                             */
/* ==========================================================  CFG  ========================================================== */
#define WWDGT_CFG_EWIE_Pos                (9UL)                     /*!< EWIE (Bit 9)                                          */
#define WWDGT_CFG_EWIE_Msk                (0x200UL)                 /*!< EWIE (Bitfield-Mask: 0x01)                            */
#define WWDGT_CFG_PSC_Pos                 (7UL)                     /*!< PSC (Bit 7)                                           */
#define WWDGT_CFG_PSC_Msk                 (0x180UL)                 /*!< PSC (Bitfield-Mask: 0x03)                             */
#define WWDGT_CFG_WIN_Pos                 (0UL)                     /*!< WIN (Bit 0)                                           */
#define WWDGT_CFG_WIN_Msk                 (0x7fUL)                  /*!< WIN (Bitfield-Mask: 0x7f)                             */
/* =========================================================  STAT  ========================================================== */
#define WWDGT_STAT_EWIF_Pos               (0UL)                     /*!< EWIF (Bit 0)                                          */
#define WWDGT_STAT_EWIF_Msk               (0x1UL)                   /*!< EWIF (Bitfield-Mask: 0x01)                            */

/** @} */ /* End of group PosMask_peripherals */


#ifdef __cplusplus
}
#endif

#endif /* GD32F3X0_PERIPH_H */


/** @} */ /* End of group GD32F3x0 */

/** @} */ /* End of group  */
